[{"@type": "imdb.api.name.bio", "akas": ["Ana De Armas", "Ana Celia de Armas"], "id": "/name/nm1869101/", "image": {"height": 2667, "id": "/name/nm1869101/images/rm38502657", "url": "https://m.media-amazon.com/images/M/MV5BMWM3MDMzNjMtODM5Ny00YmY0LWJhNzQtNTE1ZDNlNjllNDQ0XkEyXkFqcGdeQXVyODkzNTgxMDg@._V1_.jpg", "width": 4000}, "legacyNameText": "de Armas, Ana", "name": "Ana de Armas", "birthDate": "1988-04-30", "birthPlace": "Havana, Cuba", "gender": "female", "heightCentimeters": 168.0, "realName": "Ana Celia de Armas Caso", "spouses": [{"attributes": "(divorced)", "fromDate": "2011-07", "id": "/name/nm2784795/", "name": "Marc Clotet", "toDate": "2013"}], "trademarks": ["Striking hazel-green eyes"], "miniBios": [{"author": "Ana de Armas's representative", "id": "/name/nm1869101/bio/mb0088050", "language": "en", "text": "Ana de Armas was born in Cuba on April 30, 1988. At the age of 14, she began her studies at the National Theatre School of Havana, where she graduated after 4 years. At the age of 16, she made her first film, Una rosa de Francia (2006), directed by Manuel Gutiérrez Aragón. A few titles came after until she moved to Spain, where she continued her film career, and started on TV. In 2014 she moved to Los Angeles. She has appeared in films such as War Dogs (2016), Hands of Stone (2016) and Blade Runner 2049 (2017)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0005392/", "image": {"height": 805, "id": "/name/nm0005392/images/rm2464037889", "url": "https://m.media-amazon.com/images/M/MV5BYjcxNjIxOWYtMWY0MS00ZmU4LWE1NGQtYzQ0ZGQ4MmUzZWJiXkEyXkFqcGdeQXVyNTIwMzYwNg@@._V1_.jpg", "width": 532}, "legacyNameText": "Russell, Keri", "name": "Keri Russell", "birthDate": "1976-03-23", "birthPlace": "Fountain Valley, California, USA", "gender": "female", "heightCentimeters": 162.56, "nicknames": ["Care Bear"], "realName": "Keri Lynn Russell", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2014", "id": "/name/nm0722629/", "name": "Matthew Rhys"}, {"attributes": "(divorced) (2 children)", "fromDate": "2007-02-14", "name": "Shane Deary", "toDate": "2013"}], "miniBios": [{"author": "Cindy <CindaMac97@aol.com> and Suzey", "id": "/name/nm0005392/bio/mb0030919", "language": "en", "text": "Keri Russell was born in Fountain Valley, California, to Stephanie (Stephens) and David Harold Russell, an executive at Nissan Motors. She began her career on the Mickey Mouse Club in 1991. She stayed with the show until 1993. After leaving The All New Mickey Mouse Club (1989) (where she, along with her castmates recorded an album, MMC), she moved to LA to pursue an acting career. She starred in Aaron Spelling's Malibu Shores (1996) on NBC.\n\nKeri's breakthrough role came in 1998 where she played \"Felicity Porter\" in the WB's popular series Felicity (1998). In 1999, Keri won her first Golden Globe award for her role in Felicity (1998) in which she continued until the show ended in 2002. Keri pursued a movie career starring alongside Mel Gibson in We Were Soldiers (2002) and Joan Allen in The Upside of Anger (2005). In 2004, Keri made her Broadway debut in \"Fat Pig\" alongside Andrew McCarthy and Jeremy Piven."}]}, {"@type": "imdb.api.name.bio", "akas": ["Priyanka Chopra", "Piggy Chops"], "id": "/name/nm1231899/", "image": {"height": 1529, "id": "/name/nm1231899/images/rm2819207936", "url": "https://m.media-amazon.com/images/M/MV5BMjAxNzUwNjExOV5BMl5BanBnXkFtZTcwNDUyMTUxNw@@._V1_.jpg", "width": 2048}, "legacyNameText": "Chopra Jonas, Priyanka", "name": "Priyanka Chopra Jonas", "birthDate": "1982-07-18", "birthPlace": "Jamshedpur, Bihar, India", "gender": "female", "heightCentimeters": 165.1, "nicknames": ["Pri", "Piggy Chops"], "realName": "Priyanka Chopra", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2018-12-01", "id": "/name/nm2679917/", "name": "Nick Jonas"}], "trademarks": ["Beautiful smile", "Full lips", "Full cheeks", "Long wavy hair", "Curvy body"], "miniBios": [{"author": "amina", "id": "/name/nm1231899/bio/mb0006561", "language": "en", "text": "Priyanka Chopra Jonas (née Chopra) was born on July 18, 1982 in Jamshedpur, India, to the family of Capt. Dr. Ashok Chopra and Dr. Madhu Chopra, both Indian Army physicians. She had a very varied upbringing. She started her education at La Martinière Girls College in Lucknow as a resident student; a short stay at Maria Goretti College in Bareilly prepared her for further studies in the U.S. Having completed tenth grade in Boston, Massachusetts, U.S., she decided to become a software engineer or a criminal psychologist. She enjoys Indian music and dance; flair for writing poetry and short stories; reading, especially biographies; and has worked for a lot of social welfare programs."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0687146/", "image": {"height": 900, "id": "/name/nm0687146/images/rm3634087681", "url": "https://m.media-amazon.com/images/M/MV5BZTQyMzQzMjEtODVjMS00YzEzLWJjNzItY2I0MWM1YjY3MjZkXkEyXkFqcGdeQXVyMTMxNjMxMjE5._V1_.jpg", "width": 720}, "legacyNameText": "Plemons, Jesse", "name": "Jesse Plemons", "birthDate": "1988-04-02", "birthPlace": "Dallas, Texas, USA", "gender": "male", "heightCentimeters": 177.8, "nicknames": ["Meth Damon"], "realName": "Jesse Lon Plemons", "spouses": [{"attributes": "(2 children)", "current": true, "fromDate": "2022-07-02", "id": "/name/nm0000379/", "name": "Kirsten Dunst"}], "miniBios": [{"author": "Bonitao", "id": "/name/nm0687146/bio/mb0953041", "language": "en", "text": "Jesse Lon Plemons is an American actor. He began his career as a child actor and achieved a career breakthrough with his major role as Landry Clarke in the NBC drama series Friday Night Lights (2006-2011). He subsequently portrayed Todd Alquist in season 5 of the AMC crime drama series Breaking Bad (2012-2013) and its sequel film El Camino: A Breaking Bad Movie (2019). For his role as Ed Blumquist in season 2 of the FX anthology series Fargo (2015), he received his first Primetime Emmy Award nomination and won a Critics' Choice Television Award. He received a second Emmy nomination for his portrayal of Robert Daly in \"USS Callister\", an episode of the Netflix anthology series Black Mirror (2017).\n\nPlemons has appeared in supporting roles in several films including The Master (2012), The Homesman (2014), Black Mass, Bridge of Spies (both 2015), Game Night, Vice (both 2018), The Irishman (2019), Judas and the Black Messiah, Jungle Cruise, and The Power of the Dog (all in 2021). He starred in the psychological thriller film I'm Thinking of Ending Things (2020). He was nominated for the Independent Spirit Award for Best Male Lead for his role as David Mulcahey in Other People (2016). For his performance in The Power of the Dog, he was nominated for a BAFTA Award for Best Actor in a Supporting Role and the Academy Award for Best Supporting Actor."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2962353/", "image": {"height": 711, "id": "/name/nm2962353/images/rm4287634176", "url": "https://m.media-amazon.com/images/M/MV5BMTkzNjE5MzY5M15BMl5BanBnXkFtZTgwMDI5ODMxODE@._V1_.jpg", "width": 1024}, "legacyNameText": "Klementieff, Pom", "name": "Pom Klementieff", "birthDate": "1986-05-03", "birthPlace": "Quebec City, Quebec, Canada", "gender": "female", "heightCentimeters": 170.18, "nicknames": ["Pominator"], "miniBios": [{"author": "ahmetkozan", "id": "/name/nm2962353/bio/mb0621317", "language": "en", "text": "Pom Klementieff (born 3 May 1986) is a French actress. She was trained at the Cours Florent drama school in Paris and has appeared in such films as Loup (2009), Sleepless Night (2011) and Hacker's Game (2015). She plays the role of Mantis in the Marvel Cinematic Universe films Guardians of the Galaxy Vol. 2 (2017), Avengers: Infinity War (2018) and Avengers: Endgame (2019).\n\nPom Klementieff was born in Quebec City, Canada, to a Korean mother and French-Russian father, who was working there as a consul with the French government. Her grandfather was painter Eugène Klementieff. Her parents chose the name \"Pom\" because it is similar in pronunciation to the Korean words for both \"spring\" and \"tiger\". Klementieff lived in Canada for one year before her family traveled extensively due to her father's job. They lived in Japan and the Ivory Coast, before settling in France.\n\nKlementieff's father died of cancer when she was 5, and her mother had schizophrenia and was unable to care for children, so Klementieff was raised by her paternal uncle and aunt. Her uncle, whom she described as \"like [her] second father\", died on her 18th birthday, and her older brother committed suicide just seven years later, this time on her 25th birthday. Klementieff briefly attended law school after her uncle's death to appease her aunt but did not find the career path appealing. She also worked as a waitress and saleswoman in France. She started acting at age 19 at the Cours Florent drama school in Paris. A few months into her education, she won a theater competition that awarded her free classes for two years with the school's top teachers.\n\nKlementieff's first professional acting job was the French independent film Après lui (2007), portraying the stepdaughter of the protagonist played by Catherine Deneuve. Filming for her scenes took three days. During one scene, Klementieff was supposed to push someone down a set of stairs but accidentally fell down the stairs herself, and director Gaël Morel kept that shot in the final film. Her first leading role was in Loup (2009), a French film about a tribe of reindeer herders in the Siberian mountains. During filming, Klementieff stayed in a camp, hours from the nearest village, where temperatures dropped well below zero. During filming she befriended nomads who lived there, worked with real wolves, rode reindeer, and swam with a horse in a lake.\n\nKlementieff made her Hollywood debut in Spike Lee's Oldboy (2013), a remake of the South Korean film of the same name. She portrayed Haeng-Bok, the bodyguard of the antagonist played by Sharlto Copley. A fan of the original film, Klementieff heard about the part through Roy Lee, a producer with the remake, and took boxing lessons after learning the role involved martial arts. After showcasing her boxing skills during her audition, Lee asked her to go home and come back wearing a more feminine outfit and make-up, like her character in the film. She contributed some of her own clothes to the character's wardrobe, and trained three hours a day for two months for an on-screen fight with star Josh Brolin. Klementieff came up with the name Haeng-Bok, Korean for \"happiness\", herself after Lee asked her to research possible names for the character.\n\nKlementieff moved to Los Angeles after Oldboy was filmed and began pursuing more Hollywood auditions. She continued taekwondo after the film, and has a purple belt as of the summer of 2014. Her next acting role was the film Hacker's Game (2015), in which she plays a hacker she compared to Lisbeth Salander from the novel The Girl with the Dragon Tattoo. Klementieff used her boxing skills again in the film, and due to the movie's low budget, she had to do her own make-up and choose her own wardrobe. It was her idea to dye her hair purple for the role, to which the directors first objected but later acquiesced. She joined the Marvel Cinematic Universe in the role of Mantis in Guardians of the Galaxy Vol. 2 (2017) and appeared in the same role in the film Avengers: Infinity War (2018) and Avengers: Endgame (2019)."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "I", "id": "/name/nm0272581/", "image": {"height": 2048, "id": "/name/nm0272581/images/rm1044706816", "url": "https://m.media-amazon.com/images/M/MV5BODYwMzk0MTk5MV5BMl5BanBnXkFtZTgwNzMwNjM0NTE@._V1_.jpg", "width": 1365}, "legacyNameText": "Ferguson, Rebecca (I)", "name": "Rebecca Ferguson", "birthDate": "1983-10-19", "birthPlace": "Sweden", "gender": "female", "heightCentimeters": 165.1, "realName": "Rebecca Louisa Ferguson Sundström", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2019-01", "name": "Rory"}], "miniBios": [{"author": "Polly_Kat", "id": "/name/nm0272581/bio/mb0265397", "language": "en", "text": "Rebecca Ferguson was born Rebecca Louisa Ferguson Sundström in Stockholm, Sweden, and grew up in its Vasastaden district. Her father is Swedish. Her mother, Rosemary Ferguson, is British, of Scottish and Northern Irish descent, and moved to Sweden at the age of 25. Rebecca attended an English-speaking school in Sweden and was raised bilingual, speaking Swedish and English. As a student, she attended the Adolf Fredrik's Music School in Stockholm and graduated in 1999.\n\nShe came into prominence with her breakout role of upper-class girl Anna Gripenhielm in the soap-opera Nya tider (1999), when she was 16 years old.\n\nShe lives in the seaside town of Simrishamn, on the Swedish south coast. Ferguson has said she wanted to get away from city life and the public spotlight following her soap opera success. Swedish director Richard Hobert, spotted her at the town market in 2011, which led to her starring in his film A One-Way Trip to Antibes (2011).\n\nFerguson taught Argentinian Tango at a dance company in Sweden for a few years.\n\nIn 2013, Rebecca played Queen Elizabeth Woodville in the BBC historical drama The White Queen (2013), for which she got a Golden Globe nomination.\n\nIn 2015, Ferguson played Ilsa Faust, the female lead in Mission: Impossible - Rogue Nation (2015). Her co-star, Tom Cruise, chose her for the film after having seen her in the mini-series The White Queen (2013). Her performance in the movie was highly praised and Rebecca will reprise her role in the sixth Mission: Impossible film.\n\nIn 2016, she starred in Despite the Falling Snow (2016), Florence Foster Jenkins (2016) and The Girl on the Train (2016).\n\nHer other projects are Dune, Life (2017), The Snowman (2017), The Greatest Showman (2017), The Lady and the Panda and Mission: Impossible - Fallout (2018)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0001722/", "image": {"height": 600, "id": "/name/nm0001722/images/rm2243470849", "url": "https://m.media-amazon.com/images/M/MV5BZjY1OTk4MDgtNmU1Mi00ODBjLTk3YjktNTI1ZGExYTE3MGY4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg", "width": 400}, "legacyNameText": "Sewell, Rufus", "name": "Rufus Sewell", "birthDate": "1967-10-29", "birthPlace": "Twickenham, Middlesex, England, UK", "gender": "male", "heightCentimeters": 182.88, "nicknames": ["Roof"], "realName": "Rufus Frederick Sewell", "spouses": [{"attributes": "(divorced) (1 child)", "fromDate": "2004-02", "id": "/name/nm1945266/", "name": "Amy Gardner", "toDate": "2006"}, {"attributes": "(divorced)", "fromDate": "1999-03-24", "name": "Yasmin Abdallah", "toDate": "2000-03"}], "trademarks": ["Lazy eye", "Gravelly voice", "Often plays villains"], "miniBios": [{"author": "Anonymous", "id": "/name/nm0001722/bio/mb0032242", "language": "en", "text": "Rufus Sewell was born on the 29th of October 1967 in Twickenham, England. His mother, Jo, was Welsh, and was an artist and painter. His father, Bill Sewell, was an Australian animator who died when Rufus was 10. He has one brother, Caspar. He attended London's Central School of Speech and Drama and left in June of 1989 after completing three years of training.\n\nHe made his London Stage debut in \"Making It Better\" for which he won the \"Best Newcomer Award\"; he also originated the role of Septimus Hodge in Tom Stoppards \"Arcadia\" and was nominated for an Olivier Award. On the Broadway stage, he debuted in \"Translations\" and received the Broadway Theater World Award. His film work has been equally varied and acclaimed from the junkie in Twenty-One (1991), the sweet bus driver in A Man of No Importance (1994), and the volatile artist in Carrington (1995). The lustful son in Cold Comfort Farm (1995), the protagonist hounded Dostoevsky-like in Dark City (1998), the star-crossed suitor in Dangerous Beauty (1998), to the the bitter, acidic, alcoholic coke-head of The Very Thought of You (1998), he has appeared in some of the most acclaimed theatre, film and television productions."}]}, null, {"@type": "imdb.api.name.bio", "id": "/name/nm8349839/", "image": {"height": 3576, "id": "/name/nm8349839/images/rm1789013249", "url": "https://m.media-amazon.com/images/M/MV5BMTIzNjQ5YjgtZGE1Ny00MjdkLThmZmEtOTdlZGFiZWQxYTdkXkEyXkFqcGdeQXVyMTM1MjAxMDc3._V1_.jpg", "width": 2418}, "legacyNameText": "Anderson, Ever", "name": "Ever Anderson", "birthDate": "2007-11-03", "birthPlace": "Los Angeles, California, USA", "gender": "female", "heightCentimeters": 168.91, "realName": "Ever Gabo Anderson", "miniBios": [{"author": "Bonitao", "id": "/name/nm8349839/bio/mb0958898", "language": "en", "text": "Ever Gabo Anderson is an American actress and model. She is known for portraying a young Natasha Romanoff in the 2021 film Black Widow and will star as Wendy Darling in the 2022 film Peter Pan & Wendy. Her mother is actress Milla Jovovich and her father is director Paul W. S. Anderson. She has two younger sisters, Dashiel and Osian. She is of Russian and Serbian descent through her mother, and of English descent through her father."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm6096118/", "image": {"height": 5912, "id": "/name/nm6096118/images/rm465907713", "url": "https://m.media-amazon.com/images/M/MV5BMzc2OWYyZjctMzNjZi00ZmM4LTliZGYtOGMzYWUzNWY3NzdjXkEyXkFqcGdeQXVyMTA1ODAyOTI1._V1_.jpg", "width": 3943}, "legacyNameText": "Lillis, Sophia", "name": "Sophia Lillis", "birthDate": "2002-02-13", "birthPlace": "Brooklyn, New York City, New York, USA", "gender": "female", "heightCentimeters": 152.4, "trademarks": ["Red hair", "Freckles"], "miniBios": [{"author": "A", "id": "/name/nm6096118/bio/mb0481803", "language": "en", "text": "Sophia Lillis was born in Crown Heights, Brooklyn. She started her acting career at the age of seven, when her stepfather encouraged her to take acting classes at Lee Strasberg Theatre and Film Institute in Manhattan. While studying there, a teacher recommended her for a role in an NYU student film. She then signed a deal with an agent and started auditioning for roles. She started out in short films but later landed her breakthrough role in the horror film It (2017). She has also starred in the films It Chapter Two (2019), Nancy Drew and the Hidden Staircase (2019), and Gretel & Hansel (2020)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Elisabeth Olsen", "Lizzie Olsen"], "disambiguation": "I", "id": "/name/nm0647634/", "image": {"height": 899, "id": "/name/nm0647634/images/rm1874240768", "url": "https://m.media-amazon.com/images/M/MV5BMjEzMjA0ODk1OF5BMl5BanBnXkFtZTcwMTA4ODM3OQ@@._V1_.jpg", "width": 640}, "legacyNameText": "Olsen, Elizabeth (I)", "name": "Elizabeth Olsen", "birthDate": "1989-02-16", "birthPlace": "Los Angeles, California, USA", "gender": "female", "heightCentimeters": 167.64, "nicknames": ["Lizzie"], "realName": "Elizabeth Chase Olsen", "spouses": [{"current": true, "fromDate": "2021-06", "id": "/name/nm7943957/", "name": "Robbie Arnett"}], "trademarks": ["Warm brown hair", "Clear green eyes"], "miniBios": [{"author": "Akram Braham", "id": "/name/nm0647634/bio/mb0255655", "language": "en", "text": "Elizabeth Chase \"Lizzie\" Olsen (born February 16, 1989) is an American actress. She is known for her roles in the films Silent House (2011), Liberal Arts (2012), Godzilla (2014), Avengers: Age of Ultron (2015), and Captain America: Civil War (2016). For her role in the critically-acclaimed Martha Marcy May Marlene (2011), she was nominated for numerous awards, including the Independent Spirit Award for Best Female Lead. She is the younger sister of actresses and fashion designers Mary-Kate Olsen and Ashley Olsen.\n\nOlsen was born in Sherman Oaks, California to Jarnette \"Jarnie\", a personal manager, and David \"Dave\" Olsen, a real estate developer and mortgage banker. She is the younger sister of twins Mary-Kate Olsen and Ashley Olsen, who became famous as TV and movie stars at an early age. Her oldest brother is named Trent Olsen, and she has two younger half-siblings. In 1996, Olsen's parents divorced. The Olsens have Norwegian and English ancestry.\n\nAs a child, Olsen received ballet and singing lessons. She began acting at age 4, and by 11 she'd had small roles in How the West Was Fun and the straight-to-video series The Adventures of Mary-Kate & Ashley. Having appeared in her sisters' videos, when she was in the fourth grade, Olsen began to go on auditions for other projects, auditioning for the film Spy Kids. She almost quit acting in 2004 over the media frenzy surrounding Mary-Kate's eating disorder.\n\nShe attended Campbell Hall School in North Hollywood, California from kindergarten through grade 12. After graduation, she enrolled at New York University's Tisch School of the Arts. In 2009, Olsen spent a semester studying in Moscow, Russia at the Moscow Art Theatre School through the MATS program at the Eugene O'Neill Theater Center.\n\nOlsen's breakout role came in 2011, when she appeared in the film Martha Marcy May Marlene. The film, along with Olsen's performance, received critical acclaim. Olsen was nominated for and won numerous critics awards for her portrayal of the titular character Martha, a girl suffering from delusions and paranoia after fleeing her life in a cult and returning to her family. She next appeared in the horror film remake Silent House, in which she played the role of Sarah. The film received mixed reviews, although Olsen's performance was once again praised. Olsen also appeared in the music video \"The Queen\" by Carlotta. Olsen filmed the movie Red Lights during mid-2011, and it was released in the U.S. on July 13, 2012. She starred in Josh Radnor's film Liberal Arts, which was released on January 22, 2012. She and Dakota Fanning starred in Very Good Girls, a 2013 release.\n\nIn January 2013, Olsen was nominated for the BAFTA Rising Star Award. She co-starred in the 2013 American remake of the 2003 South Korean film Oldboy; she played Marie, a young social worker who developed a relationship with the protagonist, played by Josh Brolin. She played Edie Parker, Jack Kerouac's first wife and the author of the Beat Generation memoir You'll Be Okay, in Kill Your Darlings.\n\nIn 2014, Olsen starred in Legendary's Godzilla a reboot, opposite Bryan Cranston and Aaron Taylor-Johnson. Olsen joined the Marvel Cinematic Universe by playing the Scarlet Witch in Avengers: Age of Ultron, the 2015 Avengers sequel. She first appeared as the character in a mid-credits scene of the film Captain America: The Winter Soldier, again alongside her Godzilla co-star Taylor-Johnson, who portrayed her brother Quicksilver. She reprised this role as the Scarlet Witch in the 2015 film Avengers: Age of Ultron and the 2016 film Captain America: Civil War.\n\nIn September 2014, it was announced that Olsen would portray Audrey Williams, Hank Williams' wife, manager, and duet partner in the upcoming 2015 biopic I Saw the Light directed by Marc Abraham and starring Tom Hiddleston as Hank Williams.\n\nIn January 2016, it was announced that Olsen would team up with her Avengers: Age of Ultron co-star Jeremy Renner in Taylor Sheridan's directorial feature film debut, Wind River.\n\nOlsen attended New York University's Tisch School of the Arts and the Atlantic Theater Company and graduated in March 2013 after six years of intermittent study. Her sisters' clothing line \"Elizabeth and James\" was named after her and her older brother.\n\nOlsen started dating fellow actor Boyd Holbrook in September 2012 after meeting him on the film Very Good Girls. They became engaged in March 2014 but called it off in January 2015."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "I", "id": "/name/nm1039950/", "image": {"height": 862, "id": "/name/nm1039950/images/rm3061094913", "url": "https://m.media-amazon.com/images/M/MV5BY2Q4NjgxODgtMTg1MC00NmQxLWE4ZDctODVkMzA0NWYxZDY2XkEyXkFqcGdeQXVyMjE5MzM3MjA@._V1_.jpg", "width": 1241}, "legacyNameText": "Epps, Preston (I)", "name": "Preston Epps", "birthDate": "1930-07-19", "birthPlace": "Mangum, Oklahoma", "deathCause": "natural causes", "deathDate": "2019-05-09", "deathPlace": "Los Angeles, California, USA", "gender": "male", "isDead": true, "miniBios": [{"author": "frankfob2@yahoo.com", "id": "/name/nm1039950/bio/mb0258937", "language": "en", "text": "Born in Oakland, CA, in 1931, Preston Epps learned to play various percussion instruments, including the bongos, while he was in the US military during the Korean War, where he was stationed in Okinawa, Japan. After his hitch was over he moved to Southern California and began to make some money playing bongos in coffee houses around the area. He came to the attention of Los Angeles disc jockey Art Laboe, who owned Original Sound Records and signed Epps to that label. In 1959 it released his single \"Bongo Rock\", which shot to #14 on the Billboard Hot 100 chart. His follow-up record, \"Bongo Bongo Bongo\", sold respectably but didn't reach the heights that \"Bongo Rock\" did. In 1960 he released an album, but the public's taste for bongo music had begun to ebb. He released a string of bongo music over the next few years, but they didn't go anywhere\n\nIn 1957 he appeared (uncredited) as a bongo player in Calypso Heat Wave (1957) and in 1968 he had a small part in Girl in Gold Boots (1968), also as a bongo player. He continued to work as a session musician in the L.A. recording scene in the 1960s and 1970s. He also kept busy playing in various clubs and nightspots into the 1990s."}]}, {"@type": "imdb.api.name.bio", "akas": ["Katee Sachoff"], "disambiguation": "I", "id": "/name/nm0755267/", "image": {"height": 2048, "id": "/name/nm0755267/images/rm2704357888", "url": "https://m.media-amazon.com/images/M/MV5BMTc4MTAxMDMxMV5BMl5BanBnXkFtZTgwMTYxNjE5MDI@._V1_.jpg", "width": 1537}, "legacyNameText": "Sackhoff, Katee (I)", "name": "Katee Sackhoff", "birthDate": "1980-04-08", "birthPlace": "Portland, Oregon, USA", "gender": "female", "heightCentimeters": 167.64, "realName": "Kathryn Ann Sackhoff", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2021-10-02", "id": "/name/nm7108124/", "name": "Robin Gadsby"}], "trademarks": ["Often plays strong willed, no-nonsense characters"], "miniBios": [{"author": "ahmetkozan", "id": "/name/nm0755267/bio/mb0572987", "language": "en", "text": "Kathryn Ann \"Katee\" Sackhoff (born April 8, 1980) is an American actress known for playing Lieutenant Kara \"Starbuck\" Thrace on the Sci Fi Channel's television program Battlestar Galactica (2004-2009). She was nominated for four Saturn Awards for her work on Battlestar Galactica and won the award for Best Supporting Actress on Television in 2005.\n\nSackhoff has also starred in the short-lived TV series The Fearing Mind (2000-2001) and The Education of Max Bickford (2001-2002); had recurring roles in the TV series Bionic Woman (2007), Nip/Tuck (2009), CSI: Crime Scene Investigation (2010-2011), and Star Wars: The Clone Wars (2012-2013); and had a lead role in the eighth season of 24 as Dana Walsh (2010). She voices several characters including Bitch Pudding on Adult Swim's stop motion animated series Robot Chicken. Between 2012 and 2017, she starred in the A&E and Netflix series Longmire as Deputy Sheriff Victoria \"Vic\" Moretti before recurring on The Flash as Amunet.\n\nShe had lead roles in the films Halloween: Resurrection (2002); White Noise: The Light (2007); Batman: Year One (2011); The Haunting in Connecticut 2: Ghosts of Georgia, Sexy Evil Genius, Riddick, Oculus (2013) and Don't Knock Twice (2016).\n\nSackhoff was born in Portland, Oregon, and grew up in St. Helens, Oregon. Her mother, Mary, worked as an English-as-second-language (ESL) program coordinator, and her father, Dennis, is a land developer. Her brother, Erick, is co-owner of a vehicle modification shop near Portland. She graduated from Sunset High School in Beaverton in 1998. She began swimming at an early age and by high school, was planning to pursue a career in the sport until her right knee was injured. This led her to begin practicing yoga-which she continues today-and to pursue an interest in acting.\n\nHer first acting role was in the Lifetime movie Fifteen and Pregnant in which she played a teenager with a baby. The movie starred Kirsten Dunst and motivated her to move to Hollywood and pursue a career in acting after graduating high school. Sackhoff's first recurring role was Annie in MTV's Undressed, next gaining a supporting role as Nell Bickford in The Education of Max Bickford. Sackhoff made her motion picture debut in My First Mister, and next appeared in film as Jenna \"Jen\" Danzig in Halloween: Resurrection.\n\nIn August 2012, Sackhoff became the co-host of the Schmoes Know Movies podcast on the Toad Hop Network. One of her first shows was with guest Sean Astin.\n\nSackhoff announced in April 2015 a new TV-series project, Rain, which she wrote and is executive-producing through her Fly Free Productions. She also had a role in the video game Call of Duty: Black Ops III, performing voice over and motion capture as Sarah Hall. She portrayed Pink Ranger Kimberly in Power/Rangers, a short depicting a dystopian future in the Power Rangers universe.\n\nIn 2017, Sackhoff joined The CW series The Flash in the recurring role of villainess Amunet (Blacksmith), for which she is billed as a special guest star."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "I", "id": "/name/nm0534635/", "image": {"height": 791, "id": "/name/nm0534635/images/rm703400960", "url": "https://m.media-amazon.com/images/M/MV5BMTUyMDgxNDYxOV5BMl5BanBnXkFtZTgwMTExMDEwMDI@._V1_.jpg", "width": 586}, "legacyNameText": "Madden, Richard (I)", "name": "Richard Madden", "birthDate": "1986-06-18", "birthPlace": "Elderslie, Renfrewshire, Scotland, UK", "gender": "male", "heightCentimeters": 177.0, "trademarks": ["Grey streak"], "miniBios": [{"author": "scaryofmonsters, CordeliaFitzgerald", "id": "/name/nm0534635/bio/mb0358015", "language": "en", "text": "Richard Madden, born 18 June 1986, is a Scottish stage, film, and television actor best known for portraying Robb Stark in the HBO series \"Game of Thrones\" and Prince Kit in Disney's \"Cinderella.\" Starring as David Budd in the BBC miniseries \"Bodyguard\" has also brought him more international acclaim and attention including a Golden Globe and other nominations. Despite his seemingly overnight success, Madden has been acting since he was in his teens, with only a brief break where he focused on school.\n\nMadden was born in Elderslie, Renfrewshire, Scotland, where he was brought up with two sisters. His mother, Pat, is a classroom assistant, and his father, Richard, is in the fire brigade."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm6073955/", "image": {"height": 1600, "id": "/name/nm6073955/images/rm338167297", "url": "https://m.media-amazon.com/images/M/MV5BOGM4ZGI5MTMtMTRkZC00MmM0LThmZTItNzNkZjM2MTg3N2U1XkEyXkFqcGdeQXVyNTQ1OTQ0OTA@._V1_.jpg", "width": 1194}, "legacyNameText": "Pugh, Florence", "name": "Florence Pugh", "birthDate": "1996-01-03", "birthPlace": "Oxford, Oxfordshire, England, UK", "gender": "female", "heightCentimeters": 162.0, "nicknames": ["Flossie Rose"], "realName": "Florence Rose Pugh", "trademarks": ["Distinct frown in dramatic scenes."], "miniBios": [{"author": "Pedro Borges", "id": "/name/nm6073955/bio/mb0570448", "language": "en", "text": "Florence Pugh is an English actress. She is known for Midsommar (2019), Little Women (2019), her MCU debut Black Widow (2021), and Fighting with My Family (2019).\n\nPugh made her film debut in The Falling (2014). She also appears in Lady Macbeth (2016), Outlaw King (2018), Malevolent (2018), and the AMC Mini-Series The Little Drummer Girl (2018).\n\nIn 2018, she was nominated for a BAFTA EE Rising Star Award. In 2020, she was nominated for an Oscar and a BAFTA Film Award for Best Supporting Actress for her role as Amy March in Little Women."}]}, {"@type": "imdb.api.name.bio", "akas": ["Pedro Balmaceda", "Alexander Pascal"], "id": "/name/nm0050959/", "image": {"height": 1354, "id": "/name/nm0050959/images/rm1287600129", "url": "https://m.media-amazon.com/images/M/MV5BMGNlYTVlYTMtMjRhMC00YjY5LTkwMzMtZDE4MWQzMzgwYmUzXkEyXkFqcGdeQXVyMjI0OTExNzk@._V1_.jpg", "width": 1104}, "legacyNameText": "Pascal, Pedro", "name": "Pedro Pascal", "birthDate": "1975-04-02", "birthPlace": "Santiago de Chile, Metropolitan Region, Chile", "gender": "male", "heightCentimeters": 179.1, "realName": "Jose Pedro Balmaceda Pascal", "trademarks": ["Mustache", "Very short, yet ragged beard"], "miniBios": [{"author": "Pedro Borges", "id": "/name/nm0050959/bio/mb0394960", "language": "en", "text": "Pedro Pascal is a Chilean-born actor. He is best known for portraying the roles of Oberyn Martell in the fourth season of the HBO series Game of Thrones (2011), Javier Peña in the Netflix series Narcos (2015), the titular character in the Disney+ series The Mandalorian (2019) and Joel Miller in the HBO series The Last of Us (2023).\n\nHe's long-time friends with Triple Frontier (2019) co-star Oscar Isaac."}]}, {"@type": "imdb.api.name.bio", "akas": ["Karen Gillian"], "id": "/name/nm2394794/", "image": {"height": 2048, "id": "/name/nm2394794/images/rm3226844928", "url": "https://m.media-amazon.com/images/M/MV5BMTQwMDQ0NDk1OV5BMl5BanBnXkFtZTcwNDcxOTExNg@@._V1_.jpg", "width": 1411}, "legacyNameText": "Gillan, Karen", "name": "Karen Gillan", "birthDate": "1987-11-28", "birthPlace": "Inverness, Scotland, UK", "gender": "female", "heightCentimeters": 180.0, "nicknames": ["Kaz"], "realName": "Karen Sheila Gillan", "spouses": [{"current": true, "fromDate": "2022-05", "id": "/name/nm3304457/", "name": "Nick Kocher"}], "trademarks": ["Red hair", "Energetic personality", "Scottish accent", "Towering height"], "miniBios": [{"author": "Questnl", "id": "/name/nm2394794/bio/mb0093520", "language": "en", "text": "Karen Sheila Gillan was born and raised in Inverness, Scotland, as the only child of Marie Paterson and husband John Gillan, who is a singer and recording artist. She developed a love for acting very early on, attending several youth theatre groups and taking part in a wide range of productions at her school, Charleston Academy.\n\nAt age 16, Karen decided she wanted to pursue her acting career further and, studied under the renowned theatre director Scott Johnston at the Performing Arts Studio Scotland. She later attended the prestigious Italia Conti Academy in London. During her first year, she landed a role on Rebus (2000) and soon appeared in a variety of programs including Channel 4's Stacked (2008) and The Kevin Bishop Show (2008), as well as a two-year stint on the long-running series Doctor Who (2005). Karen also stars in the film Outcast (2010), starring James Nesbitt. Her most recent starring role is as Eliza Dooley on the situation comedy Selfie (2014)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Daisey Head", "Daisy May Head"], "id": "/name/nm1724742/", "image": {"height": 3609, "id": "/name/nm1724742/images/rm1448851457", "url": "https://m.media-amazon.com/images/M/MV5BNTE2ZWY1ZTMtNjAxNC00ZjRjLWI5MzgtOTYzYzNhNjU5ZTMzXkEyXkFqcGdeQXVyNjUxMjc1OTM@._V1_.jpg", "width": 2400}, "legacyNameText": "Head, Daisy", "name": "Daisy Head", "birthDate": "1991-03-07", "birthPlace": "England, UK", "gender": "female", "heightCentimeters": 167.64, "realName": "Daisy May Head", "miniBios": [{"id": "/name/nm1724742/bio/bo432985521", "language": "en", "text": "Daisy Head was born on March 7, 1991 in England, UK. She is an actress, known for Dungeons & Dragons: Honor Among Thieves (2023), Underworld: Blood Wars (2016) and Fallen (2016)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm4911194/", "image": {"height": 6582, "id": "/name/nm4911194/images/rm551623425", "url": "https://m.media-amazon.com/images/M/MV5BNmQ1MDJhYmUtNTJhYS00Njk2LTgyMmEtYmNhM2JiZGMwMTc0XkEyXkFqcGdeQXVyMzQwODQxNTU@._V1_.jpg", "width": 4388}, "legacyNameText": "Ortega, Jenna", "name": "Jenna Ortega", "birthDate": "2002-09-27", "birthPlace": "Coachella Valley, California, USA", "gender": "female", "heightCentimeters": 154.94, "nicknames": ["ReeRee"], "realName": "Jenna Marie Ortega", "miniBios": [{"author": "Tales Grimm & MLC", "id": "/name/nm4911194/bio/mb0363482", "language": "en", "text": "Jenna Marie Ortega was born on September 27, 2002 in Coachella Valley, California. She began acting at age 9 and has portrayed Harley, a creative-engineering prodigy navigating life as the middle child in a family of 7 children in \"Stuck in the Middle,\" a Disney Channel series told from Harley's perspective.\n\nOrtega is known not only for her stellar performance in multiple Disney productions but also for her roles in many award-winning movies and television series, such as her portrayal of Young Jane in The CW Television Network's iconic comedy-drama \"Jane the Virgin,\" and Darcy in the 2015 Netflix sitcom \"Richie Rich.\" In 2020 she co-starred as Phoebe in the horror sequel The Babysitter: Killer Queen (2020). Restless in her profession, Jenna is accountable for more than 15 television staples and blockbuster films to date, commonly accepting lead roles.\n\nThe daughter of mixed Mexican and Puerto Rican parents, Ortega makes it very clear to her audience that she is proud of her heritage and grateful for having the opportunity to share her culture with the world. In a 2016 Pop Sugar interview, Jenna conveys that succeeding in the American film industry as a Latina was an uphill battle, throttled by subjective casting and strict ethnic guidelines followed in the early 2000s. Despite this difficulty, Ortega did not let cultural barriers and prejudice hinder her progress as a rising star.\n\nWorking with the most prestigious studios in the film industry, Jenna Ortega has achieved a high status in her profession and gilded her family name for generations to come."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm1821446/", "image": {"height": 2048, "id": "/name/nm1821446/images/rm3597922304", "url": "https://m.media-amazon.com/images/M/MV5BNjk5ODc5MTU3MF5BMl5BanBnXkFtZTgwOTk2MjI5NDE@._V1_.jpg", "width": 1365}, "legacyNameText": "Waddingham, Hannah", "name": "Hannah Waddingham", "birthDate": "1974-07-28", "birthPlace": "London, England, UK", "gender": "female", "heightCentimeters": 180.0, "trademarks": ["Towering height"], "miniBios": [{"author": "LT & CS", "id": "/name/nm1821446/bio/mb0807883", "language": "en", "text": "Hannah Waddingham was born on 1974, in Wandsworth, London. Her family was involved in performing arts as her mother, Melodie Kelly, and both her maternal grandparents were opera singers.\n\nShe is best known for her contribution to West End musical theatre, particularly her performances in the original London production of \"Spamalot\" as the Lady of the Lake and as Desiree Armfelt in Trevor Nunn's acclaimed revival of \"A Little Night Music\", roles that earned her two Olivier Award nomination.\n\nIn October 2000, she released the single \"Our Kind of Love\", billed simply as Hannah, in the UK Singles Chart where it peaked at No. 41.\n\nIn 2008, she made her film debut as Elizabeth Maddox in How to Lose Friends & Alienate People (2008). Her other film credits include Into the Woods (2011), Les Misérables (2012), Winter Ridge (2018) and The Hustle (2019).\n\nIn 2015, Waddingham joined the cast of the fifth season of the HBO series Game of Thrones (2011) as Septa Unella. Hannah appeared in Sex Education (2019) as Sofia Marchetti. In 2020, she gained international recognition for her acclaimed portrayal of Rebecca Welton in the Apple+ comedy series Ted Lasso (2020), for which she won Best Supporting Actress in a Comedy Series at the 2021 Critics Choice Awards.\n\nIn 2014, Hannah welcomed her first child, a daughter. Hannah has since split up the father."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm4578161/", "image": {"height": 2621, "id": "/name/nm4578161/images/rm4246342145", "url": "https://m.media-amazon.com/images/M/MV5BZTAwMjU3ZTEtODVjOS00ZTI4LWEwNWYtYjlkOWZhM2IwMjQ5XkEyXkFqcGdeQXVyNjczNTc4ODU@._V1_.jpg", "width": 1600}, "legacyNameText": "Buchanan, Luciane", "name": "Luciane Buchanan", "birthDate": "1993-07-18", "birthPlace": "Taneatua, Whakatane, Aotearoa, New Zealand", "gender": "female", "heightCentimeters": 157.48, "miniBios": [{"author": "GCM", "id": "/name/nm4578161/bio/mb0447838", "language": "en", "text": "Luciane is of Tongan and Scottish descent, but she was born in Aotearoa (New Zealand). Her early acting training was with Fiona Edgar as a student of TAPAC's Acting for Screen course. Luciane has recently completed studying towards a Bachelor of Arts in Drama and Psychology at The University of Auckland.\n\nLuciane Buchanan's first screen role was as comedian Billy T James' daughter Cherie in Peter Burger's biopic Billy. She has since gone on to perform in The Blue Rose, Power Rangers and as core cast in two seasons of Filthy Rich playing the role of Kennedy Truebridge. Her most recent role is in The Legend of Monkey playing one of the lead roles Tripitaka."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2365811/", "image": {"height": 2288, "id": "/name/nm2365811/images/rm2377159937", "url": "https://m.media-amazon.com/images/M/MV5BNWU2ZGU3M2EtMjRhNy00NjdjLWFlNTUtMjU2NTY2ODhlOWJkXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg", "width": 1525}, "legacyNameText": "Gilpin, Betty", "name": "Betty Gilpin", "birthDate": "1986-07-21", "birthPlace": "New York City, New York, USA", "gender": "female", "heightCentimeters": 170.18, "realName": "Elizabeth Folan Gilpin", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2016-08-06", "id": "/name/nm1505027/", "name": "Cosmo Pfeil"}], "miniBios": [{"author": "Bonitao", "id": "/name/nm2365811/bio/mb0955575", "language": "en", "text": "Elizabeth Folan Gilpin is an American actress. She is best known for portraying Debbie \"Liberty Belle\" Eagan in the Netflix comedy series GLOW (2017-2019), for which she was nominated for three Primetime Emmy Awards for Outstanding Supporting Actress in a Comedy Series. She also starred as Dr. Carrie Roman in the Showtime comedy-drama series Nurse Jackie (2013-2015). Gilpin has appeared in films such as the mystery thriller True Story (2015), the science fiction romantic comedy Future '38 (2017), the fantasy romantic comedy Isn't It Romantic (2019), the drama A Dog's Journey (2019), and the action comedy Stuber (2019). In 2020, Gilpin starred in the horror film The Grudge, the satirical action thriller The Hunt, and the action comedy Coffee & Kareem. For The Hunt, she won a Critics' Choice Super Award for Best Actress in an Action Movie."}]}, {"@type": "imdb.api.name.bio", "akas": ["Alexander Skarsgaard", "Alexander Skarsgard"], "id": "/name/nm0002907/", "image": {"height": 2048, "id": "/name/nm0002907/images/rm1858870528", "url": "https://m.media-amazon.com/images/M/MV5BMTY1MjQxNjEzOF5BMl5BanBnXkFtZTgwMTU5ODM2ODE@._V1_.jpg", "width": 1360}, "legacyNameText": "Skarsgård, Alexander", "name": "Alexander Skarsgård", "birthDate": "1976-08-25", "birthPlace": "Stockholm, Stockholms län, Sweden", "gender": "male", "heightCentimeters": 194.0, "nicknames": ["Alex"], "realName": "Alexander Johan Hjalmar Skarsgård", "trademarks": ["Distinctive mellow voice", "\"Skarsbrow\", i.e. he habitually lifts his left eyebrow quizzically", "Frequently plays very calm restrained individuals, often with positions of authority (Ex. Meekus from Zoolander)", "Cleft chin and razor-sharp cheekbones", "Towering height and lean yet impressively athletic physique"], "miniBios": [{"author": "digitaldiva", "id": "/name/nm0002907/bio/mb0087312", "language": "en", "text": "Alexander Johan Hjalmar Skarsgård was born in Stockholm, Sweden and is the eldest son of famed actor Stellan Skarsgård. Among his siblings are actors Gustaf Skarsgård, Bill Skarsgård, and Valter Skarsgård. For most of his formative years, his father was an acclaimed actor in Europe but had not yet achieved the international fame that came after his star turn in Breaking the Waves (1996). Young Alexander was raised under modest circumstances in a working-class Swedish neighborhood as his parents wanted their children to have as normal an upbringing as possible. He began his acting career at the age of eight and continued working in films and on Swedish television until he turned sixteen and decided acting was not the career for him. Life under a microscope lost its charm and perhaps due to the influence of My Skarsgård, his physician mother, he stopped working as an actor, to continue his education.\n\nInstead of continuing college, at the age of nineteen, he entered compulsory military service (military conscription). He used the time to contemplate his future. He studied at the Leeds Metropolitan University then moved to New York where he enrolled at Marymount Manhattan College to study theatre. After six months in New York, a romantic entanglement lured him back to Sweden but the relationship was short-lived. Despite having a broken heart, Alexander decided to stay in Sweden and, with a bit of life experience under his belt, began his acting career again. He appeared in a number of Swedish productions and became a star in his native country but was interested in broadening his horizons and working outside of Sweden. A visit to Los Angeles landed him both an agent and a part in the Ben Stiller movie, Zoolander (2001). After that Alexander returned to Sweden where he continued honing his acting in film and theatrical productions including \"Who's Afraid of Virginia Woolf?\" and \"Bloody Wedding\". He also co-wrote and co-directed an award-winning short, Att döda ett barn (2003), (To Kill a Child), which was shown at both the Tribeca and Cannes Film Festivals.\n\nHis first big break was with the miniseries Generation Kill (2008). Alexander spent seven months broiling in the desert of Namibia but it was well worth it. His portrayal of Marine Sgt. Brad \"Iceman\" Colbert astonished critics and audiences, alike. Thanks to the writer's strike, after completing Generation Kill (2008), he was cast in the role of \"Eric Northman\", a 1,000-year-old Viking vampire on the hit series, True Blood (2008). The series was created by Alan Ball, the man behind Six Feet Under (2001). True Blood (2008) was adapted from the \"Sookie Stackhouse' novels by Charlaine Harris' and rode to success on quality scripts, great acting and the public's obsession with the vampire genre. In addition to True Blood (2008), which begins its third season in 2010, Alexander has a number of film projects in the works including the remake of Straw Dogs (2011), Melancholia (2011), written and directed by Lars von Trier, action Sci-Fi film, Battleship (2012), and The East (2013), directed by Zal Batmanglij."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm1017334/", "image": {"height": 3391, "id": "/name/nm1017334/images/rm2821908737", "url": "https://m.media-amazon.com/images/M/MV5BYmNhOGE0NDQtNmUxZi00YmZmLTllNjgtM2QwODYzYzM0ZmRhXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg", "width": 5087}, "legacyNameText": "Temple, Juno", "name": "Juno Temple", "birthDate": "1989-07-21", "birthPlace": "London, England, UK", "gender": "female", "heightCentimeters": 157.48, "realName": "Juno Violet Temple", "miniBios": [{"author": "Kad", "id": "/name/nm1017334/bio/mb0140713", "language": "en", "text": "Juno Violet Temple was born in London, England, into a showbiz family, the daughter of producer Amanda Temple and film director Julien Temple. She was named 'Juno' after her parents took a visit to the Grand Canyon during pregnancy and found they were standing on a butte of Cape Final known as Juno Temple. She has English and Scottish ancestry.\n\nHer family moved to America, where she spent the first four years of her life. The family then moved back to England and settled in Somerset. At age four, she decided she wanted to be an actress after her father showed her Beauty and the Beast (1946) by Jean Cocteau.\n\nShe attended Enmore Primary School in Somerset. It was during this time that her father cast her in his film Vigo (1998). However, her father ended up cutting her out of the film. Two years later, at age 11, her father cast her in another of his films, Pandaemonium (2000).\n\nShe became a weekly boarder at King's College boarding school in Taunton. She then moved on to Bedales boarding school in Hampshire to take her A-Levels, one of which was Drama. She left with a B and two C's.\n\nAt age 15, she told her parents that she was serious about becoming an actress Her mother saw a call for an open audition for Notes on a Scandal (2006), and Juno was successful in winning the role of Cate Blanchett's daughter. This was her big break and led to a role in another high-profile film, Atonement (2007). She dyed her hair red to play Lola.\n\nIn 2009, Juno moved to Los Angeles, partly for her acting career."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "I", "id": "/name/nm3880241/", "image": {"height": 1200, "id": "/name/nm3880241/images/rm3531016193", "url": "https://m.media-amazon.com/images/M/MV5BYmVjNTcyYTAtMTQ0My00ZDhhLTk0ZTUtODkwNTI0OWVlZjQyXkEyXkFqcGdeQXVyNDg0MjU5MTg@._V1_.jpg", "width": 960}, "legacyNameText": "Blyth, Tom (I)", "name": "Tom Blyth", "birthDate": "1995-02-02", "birthPlace": "Birmingham, England, UK", "gender": "male", "heightCentimeters": 182.88, "miniBios": [{"author": "Bonitao", "id": "/name/nm3880241/bio/mb0956446", "language": "en", "text": "Tom Keir Blyth is an English actor. His films include Scott and Sid (2018), Benediction (2021), The Hunger Games, Ballad of Songbirds and Snakes (2023). He stars as the titular character of the MGM+ series Billy the Kid (2022) and a supporting role in the HBO series The Gilded Age (2022). Blyth was born in Birmingham and grew up in Woodthorpe, a suburb of Nottingham. He is the son of soap opera producer Gavin Blyth, who passed away when he was 14. Blyth attended Arnold Hill Academy and Bilborough College. His mother Charlotte, a careers counselor, signed him up for drama classes at the Television Workshop. He also joined the National Youth Theatre. He went on to train at the Juilliard School in New York City, as had been his dream, graduating in 2020."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0135221/", "image": {"height": 1202, "id": "/name/nm0135221/images/rm2161897472", "url": "https://m.media-amazon.com/images/M/MV5BMjA1MDgxNDU0Nl5BMl5BanBnXkFtZTgwNjk4NTgwMTE@._V1_.jpg", "width": 960}, "legacyNameText": "Caplan, Lizzy", "name": "Lizzy Caplan", "birthDate": "1982-06-30", "birthPlace": "Los Angeles, California, USA", "gender": "female", "heightCentimeters": 162.56, "realName": "Elizabeth Anne Caplan", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2017-09-02", "id": "/name/nm2068559/", "name": "Tom Riley"}], "miniBios": [{"author": "Anonymous", "id": "/name/nm0135221/bio/mb0168082", "language": "en", "text": "Actress Elizabeth Anne \"Lizzy\" Caplan was born in Los Angeles, California, to Barbara (Bragman), a political aide, and Richard Caplan, a lawyer. She has two older siblings, Julie and Benjamin, and was raised in a Jewish household. Her mother was a cousin of publicist Howard Bragman. Caplan was educated at Alexander Hamilton High School, where she showed an interest in acting and was cast in school plays.\n\nAfter graduating, Caplan made her onscreen debut in the TV movie From Where I Sit (2000). Other roles followed in TV shows such as Freaks and Geeks (1999), Smallville (2001) and The Pitts (2003). Caplan made her big screen debut with a small role in Orange County (2002) and went on to play Janis Ian in the hit Mean Girls (2004). Further successes include Cloverfield (2008), Hot Tub Time Machine (2010) and 127 Hours (2010).\n\nMore recently, Caplan has played Virginia Johnson in the television series Masters of Sex (2013), for which she received an Emmy nomination. Her 2010s film work includes co-starring in The Interview (2014), opposite Joseph Gordon-Levitt in The Night Before (2015), and alongside Jesse Eisenberg, Dave Franco, Woody Harrelson, and Daniel Radcliffe in Now You See Me 2 (2016)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Tina A. Ivlev"], "id": "/name/nm3146486/", "image": {"height": 1362, "id": "/name/nm3146486/images/rm437819905", "url": "https://m.media-amazon.com/images/M/MV5BNWIxYmJiN2ItMmNmNC00ZGNkLWFmNDYtMWE1ZGQ2N2NlYTJhXkEyXkFqcGdeQXVyMTk2NjUyMTM@._V1_.jpg", "width": 1242}, "legacyNameText": "Ivlev, Tina", "name": "Tina Ivlev", "birthPlace": "Moscow, RSFSR, USSR [now Russia]", "gender": "female", "heightCentimeters": 162.56, "miniBios": [{"author": "A", "id": "/name/nm3146486/bio/mb0227431", "language": "en", "text": "Tina Ivlev is an American actress best known for her role as Nightsister Merrin in the hit action-adventure video games \"Star Wars: Jedi Fallen Order\" and Star Wars Jedi: Survivor.\" Ivlev played Nightsister Merrin, the last surviving Nightsister on Dathomir, providing her likeness as well as full performance-capture and voice-acting work for the role.\n\nAs the lead in the thriller, \"Bound to Vengeance,\" which premiered at the Sundance Film Festival, Ivlev garnered much praise for her tour de force performance as a young woman who outwits her kidnapper (Richard Tyson) and attempts to rescue his other victims.\n\nRecently on stage, Ivlev starred in the gripping drama, \"Dry Land,\" a Colt Coeur production written by Ruby Rae Spiegel and directed by Adrienne Campbell-Holt. The play, which immediately became a New York Times Critics' Pick, played to sold out houses in New York.\n\nHer other screen credits include \"Charming the Hearts of Men\" opposite Sean Astin and Kelsey Grammar, \"Deadtectives,\" and \"Death Clique.\" She has appeared in several guest-starring and recurring television roles, including \"Shameless,\" \"All Rise,\" \"Queen of the South,\" \"9-1-1,\" \"Zach Stone is Gonna be Famous,\" and \"Major Crimes\" among many others."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm5896355/", "image": {"height": 2048, "id": "/name/nm5896355/images/rm4152883713", "url": "https://m.media-amazon.com/images/M/MV5BMTllYmE5YTYtZGZmYy00ZTBlLWJlODEtYWQ0ZmU1YTJkMjJlXkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_.jpg", "width": 1365}, "legacyNameText": "Taylor-Joy, Anya", "name": "Anya Taylor-Joy", "birthDate": "1996-04-16", "birthPlace": "Miami, Florida, USA", "gender": "female", "heightCentimeters": 172.72, "realName": "Anya Josephine Marie Taylor-Joy", "spouses": [{"current": true, "fromDate": "2022-07-18", "id": "/name/nm2964968/", "name": "Malcolm McRae"}], "trademarks": ["Large, wide-set eyes", "High cheekbones", "Her British accent."], "miniBios": [{"author": "Matias Supervielle and ahmetkozan", "id": "/name/nm5896355/bio/mb0312658", "language": "en", "text": "Anya-Josephine Marie Taylor-Joy (born 16 April 1996) is a British-American actress. She is best known for her roles as Beth Harmon in The Queen's Gambit (2020), Thomasin in the period horror film The Witch (2015), as Casey Cooke in the horror-thriller Split (2016), and as Lily in the black comedy thriller Thoroughbreds (2017). She has been the recipient of the Cannes Film Festival's Trophée Chopard and was nominated for the BAFTA Rising Star Award.\n\nAnya was born in Miami, the youngest of six children. Her father is Scottish who was born in South America, and her mother is Spanish-English who was born in Zambia in Africa, to an English diplomat father and a Spanish mother from Barcelona. Anya lived her childhood between Argentina and England. Her father was a banker and a powerboat racer, and her mother is a psychologist. Anya was raised in Argentina until the age of six, then moved to London, where the family lived in Victoria. She attended Northlands School in Buenos Aires, then preparatory school Hill House and Queen's Gate School in London, and is also a former ballet dancer. Anya's dream of becoming an actress came when she was very young and it finally became possible when she was offered a modeling job. It wasn't long until Taylor-Joy received her first part in the Show Business. When she was fourteen, she used her savings to move to New York, and at 16, she left school to pursue acting.\n\nAnya's outstanding performance as Thomasin in Robert Eggers' period horror film The Witch (2015), and the positive reviews it got at the Sundance festival revealed her incredible potential to the world; it was widely released and viewed in 2016. She then starred as the title character in the thriller Morgan (2016), directed Luke Scott and also starring Kate Mara. She also starred in Vikram Gandhi's film Barry, which focused on a young Barack Obama in 1981 New York City. Taylor-Joy played one of Obama's close friends. In 2017, she headlined M. Night Shyamalan's horror-thriller film Split (2016), playing Casey Cooke, a girl abducted by a mysterious man with split personalities. In 2019, she reprised her role as Casey in the film Glass. Anya was also the lead actress in the music video for Skrillex's remix of GTA's song Red Lips. She was nominated for the 2017 BAFTA Rising Star Award.\n\nTaylor-Joy is attached to star in Nosferatu, a remake of the film of the same name, to be directed by Eggers in her second collaboration with him. She will also star in The Sea Change."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm4399227/", "image": {"height": 633, "id": "/name/nm4399227/images/rm4115213825", "url": "https://m.media-amazon.com/images/M/MV5BOGIwZTQzNDctOTU4MS00MjA2LWI1ZWEtZWM2OTg4MzU1NWYzXkEyXkFqcGdeQXVyMTMzOTMyOTM4._V1_.jpg", "width": 633}, "legacyNameText": "Wong, Ali", "name": "Ali Wong", "birthDate": "1982-04-19", "birthPlace": "San Francisco, California, USA", "gender": "female", "heightCentimeters": 152.0, "realName": "Alexandra Dawn Wong", "spouses": [{"attributes": "(divorced) (2 children)", "fromDate": "2014-11-27", "name": "Justin Hakuta", "toDate": "2022-04"}], "miniBios": [{"id": "/name/nm4399227/bio/bo424233811", "language": "en", "text": "Ali Wong was born on April 19, 1982 in San Francisco, California, USA. She is an actress and producer, known for Ali Wong: Baby Cobra (2016), Always Be My Maybe (2019) and Birds of Prey (2020). She was previously married to Justin Hakuta."}]}, {"@type": "imdb.api.name.bio", "akas": ["Alex Daddario", "Alexandra Daddorio"], "id": "/name/nm1275259/", "image": {"height": 419, "id": "/name/nm1275259/images/rm2713069056", "url": "https://m.media-amazon.com/images/M/MV5BMTY3Nzg2NjA1OF5BMl5BanBnXkFtZTgwMjY5NTU1MzI@._V1_.jpg", "width": 309}, "legacyNameText": "Daddario, Alexandra", "name": "Alexandra Daddario", "birthDate": "1986-03-16", "birthPlace": "New York City, New York, USA", "gender": "female", "heightCentimeters": 172.72, "realName": "Alexandra Anna Daddario", "spouses": [{"current": true, "fromDate": "2022", "id": "/name/nm0286320/", "name": "Andrew Form"}], "trademarks": ["Strikingly bold blue eyes"], "miniBios": [{"author": "Jaehun Han", "id": "/name/nm1275259/bio/mb0220867", "language": "en", "text": "Alexandra Anna Daddario was born on March 16, 1986 in New York City, New York, to Christina, a lawyer, and Richard Daddario, a prosecutor. Her brother is actor Matthew Daddario, her sister is actor Catharine Daddario, and her grandfather was congressman Emilio Daddario (Emilio Q. Daddario), of Connecticut. She has Italian, Irish, Hungarian/Slovak ancestry. She wanted to be an actress when she was young. Her first job came at age 16, when she got the role of \"Laurie Lewis\" on All My Children (1970). Alex co-starred, with Logan Lerman and Brandon T. Jackson, in the role of Annabeth Chase in the Percy Jackson movies, Percy Jackson & the Olympians: The Lightning Thief (2010) and Percy Jackson: Sea of Monsters (2013), which were based on Rick Riordan's best-selling teen books. At the end of 2012, Alex starred in the music video, Imagine Dragons's \"Radioactive.\"\n\nAlexandra became more known in the 2010s, as she starred as Blake Gaines in earthquake film San Andreas (2015), alongside Dwayne Johnson, and in the films Hall Pass (2011), Texas Chainsaw (2013), and Baywatch (2017). She has appeared on many TV series, including White Collar (2009), It's Always Sunny in Philadelphia (2005), and American Horror Story (2011): Hotel. In 2014, Daddario gained attention for her role on the first season of the HBO series, True Detective (2014)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm3512758/", "image": {"height": 600, "id": "/name/nm3512758/images/rm1435951616", "url": "https://m.media-amazon.com/images/M/MV5BNDQxYjA0ZWYtNjU3Yi00NTRlLWJhOTUtZTFhYjM2OTVjYmFlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg", "width": 422}, "legacyNameText": "Snook, Sarah", "name": "Sarah Snook", "birthDate": "1987-12-01", "birthPlace": "Adelaide, South Australia, Australia", "gender": "female", "heightCentimeters": 165.1, "spouses": [{"current": true, "fromDate": "2021-02", "id": "/name/nm2585483/", "name": "Dave Lawson"}], "trademarks": ["Red hair", "Blue eyes", "Pale skin"], "miniBios": [{"author": "Anonymous", "id": "/name/nm3512758/bio/mb0457546", "language": "en", "text": "Sarah Snook was born and raised in Adelaide, South Australia. Showing promise in performing arts at a young age, Sarah was awarded a scholarship to study drama at Scotch College, Adelaide. After high school, she was accepted in to the prestigious National Institute of Dramatic Arts (NIDA) and graduated in 2008 with a Bachelor of Fine Arts (Acting).\n\nHaving started out in theatre in Sydney, Sarah was the runner-up in the 2011 Australians in Film Heath Ledger Scholarship. She has since gone on to work extensively in film and television in Australia, receiving awards from the Australian Academy for Cinema and Television Arts (AACTA) for Best Actress in a Film, Predestination (2014), and Best Lead Actress in a Television Drama, Sisters of War (2010), the Film Critic's Circle of Australia (FCCA) for Best Actress - Lead Role, Predestination (2014) and Not Suitable for Children (2012), and the Australian Film Critics Association (AFCA) for Best Actress in a Supporting Role, These Final Hours (2013).\n\nInternationally, Sarah has acted in numerous films, most notably Steve Jobs (2015) and The Glass Castle (2017). She also appeared in the Netflix series Black Mirror (2011). On stage, Sarah made her West End debut in 2016 alongside Ralph Fiennes in The Old Vic's production of Henrik Ibsen's \"The Master Builder\".\n\nIn 2017 Sarah wrapped on two Australian productions, Winchester (2018) and Brothers' Nest (2018), and was in New York later in 2017 to shoot the first season of HBO series, Succession (2018)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Nicholas Cage", "Nicolas Kim Coppola", "Nicolas Coppola"], "id": "/name/nm0000115/", "image": {"height": 2048, "id": "/name/nm0000115/images/rm757971456", "url": "https://m.media-amazon.com/images/M/MV5BMjUxMjE4MTQxMF5BMl5BanBnXkFtZTcwNzc2MDM1NA@@._V1_.jpg", "width": 1503}, "legacyNameText": "Cage, Nicolas", "name": "Nicolas Cage", "birthDate": "1964-01-07", "birthPlace": "Long Beach, California, USA", "gender": "male", "heightCentimeters": 183.0, "nicknames": ["Nic"], "realName": "Nicholas Kim Coppola", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2021-02-16", "id": "/name/nm12944288/", "name": "Riko Shibata"}, {"attributes": "(divorced)", "fromDate": "2019-03-23", "id": "/name/nm6833029/", "name": "Erika Koike", "toDate": "2019-05-31"}, {"attributes": "(divorced) (1 child)", "fromDate": "2004-07-30", "id": "/name/nm3141716/", "name": "Alice Kim Cage", "toDate": "2016-01"}, {"attributes": "(divorced)", "fromDate": "2002-08-10", "id": "/name/nm1070086/", "name": "Lisa Marie Presley", "toDate": "2004-05-24"}, {"attributes": "(divorced)", "fromDate": "1995-04-08", "id": "/name/nm0000099/", "name": "Patricia Arquette", "toDate": "2001-05-18"}], "trademarks": ["Often plays eccentric wisecracking characters", "Sharp, dark, pointy eyebrows and striking blue eyes", "Deep husky baritone voice"], "miniBios": [{"author": "Dan Hartung <dhartung@mcs.com>", "id": "/name/nm0000115/bio/mb0005265", "language": "en", "text": "Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor August Coppola (whose brother is director Francis Ford Coppola) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish and German (mother) descent. Cage changed his name early in his career to make his own reputation, succeeding brilliantly with a host of classic, quirky roles by the late 1980s.\n\nInitially studying theatre at Beverly Hills High School (though he dropped out at seventeen), he secured a bit part in Fast Times at Ridgemont High (1982) -- most of which was cut, dashing his hopes and leading to a job selling popcorn at the Fairfax Theater, thinking that would be the only route to a movie career. But a job reading lines with actors auditioning for uncle Francis' Rumble Fish (1983) landed him a role in that film, followed by the punk-rocker in Valley Girl (1983), which was released first and truly launched his career.\n\nHis one-time passion for method acting reached a personal limit when he smashed a street-vendor's remote-control car to achieve the sense of rage needed for his gangster character in The Cotton Club (1984).\n\nIn his early 20s, he dated Jenny Wright for two years and later linked to Uma Thurman. After a relationship of several years with Christina Fulton, a model, they split amicably and share custody of a son, Weston Cage (b. 1990). He also has a son with his ex-wife, Alice Kim Cage."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm9476408/", "image": {"height": 6000, "id": "/name/nm9476408/images/rm708298497", "url": "https://m.media-amazon.com/images/M/MV5BYTE4ZmU3NTQtMWY0OC00YmQ5LThlOTEtMTc3NjcwZjMwN2QzXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg", "width": 3994}, "legacyNameText": "Schafer, Hunter", "name": "Hunter Schafer", "birthDate": "1998-12-31", "birthPlace": "Trenton, New Jersey, USA", "gender": "female", "heightCentimeters": 177.8, "miniBios": [{"author": "Lawrence Chadbourne", "id": "/name/nm9476408/bio/mb0627625", "language": "en", "text": "Born in Trenton, New Jersey on December 31, 1998, Hunter Schafer graduated from the University of NC School of the Arts and became known in the state for her role, along with her father Mac, in challenging a state House bill requiring people to use public bathrooms that matched the gender on their birth certificates, in 2016. She started her career as a fashion model in New York City for companies such as Marc Jacobs and Dior. In 2017 she was cited by Teen Vogue as one of 21 girls younger than 21 who were changing the world. Her TV series role on the show Euphoria came after a casting call on the Instagram social media platform."}]}, {"@type": "imdb.api.name.bio", "akas": ["Sydney Sweeny"], "id": "/name/nm2858875/", "image": {"height": 2667, "id": "/name/nm2858875/images/rm674689025", "url": "https://m.media-amazon.com/images/M/MV5BOTVjOTkxNjMtNDJiYS00YzEzLThmZTItZjJhM2E4NWQyM2Q2XkEyXkFqcGdeQXVyNzM1NTU0NA@@._V1_.jpg", "width": 2000}, "legacyNameText": "Sweeney, Sydney", "name": "Sydney Sweeney", "birthDate": "1997-09-12", "birthPlace": "Spokane, Washington, USA", "gender": "female", "heightCentimeters": 161.0, "miniBios": [{"author": "ahmetkozan (Links by Anonymous Writeups)", "id": "/name/nm2858875/bio/mb0523563", "language": "en", "text": "Sydney Sweeney (born September 12, 1997) is an American actress best known for her roles as Haley Caren on In the Vault (2017) and Emaline Addario on the Netflix series Everything Sucks! (2018). Sweeney is set to star in recurring roles in the HBO miniseries Sharp Objects (2018) starring Amy Adams and the Hulu series The Handmaid's Tale (2017) with Elisabeth Moss.\n\nSweeney has guest starred in TV shows such as Pretty Little Liars (2010), Criminal Minds (2005), Grey's Anatomy (2005), 90210 (2008), and the series In the Vault (2017) as Haley Caren. Sweeney most recently starred as Emaline Addario on the Netflix series Everything Sucks! (2018), which revolved around two groups of students in high school in 1996 in Oregon.\n\nSweeney is set to star in the second season of the Hulu original series The Handmaid's Tale (2017) as Eden, a pious and obedient girl, as well as Alice in the upcoming HBO miniseries Sharp Objects (2018) starring Amy Adams. She will also star in the upcoming psychological thriller Clementine (2019) and the alongside Andrew Garfield in the thriller Under the Silver Lake (2018). Sweeney also starred in the horror film Along Came the Devil (2018)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Alissa Dyck-Skovbye", "Alissa Skovbye"], "id": "/name/nm3309629/", "image": {"height": 2248, "id": "/name/nm3309629/images/rm3526675713", "url": "https://m.media-amazon.com/images/M/MV5BZjM3ZjgxOWYtMDYyMi00NzhlLWEyZDEtMDI4NjVkYjc5ZDJiXkEyXkFqcGdeQXVyMjMwMDc0Njc@._V1_.jpg", "width": 1500}, "legacyNameText": "Skovbye, Ali", "name": "Ali Skovbye", "birthDate": "2002-05-16", "birthPlace": "Vancouver, British Columbia, Canada", "gender": "female", "heightCentimeters": 173.0, "realName": "Alissa Skovbye", "miniBios": [{"author": "Anonymous", "id": "/name/nm3309629/bio/mb0688682", "language": "en", "text": "Born in Vancouver, Canada, Ali began her acting career at only four years old after being scouted for a national car commercial. She went directly into film and television the following year, booking a supporting lead role in the feature film \"Personal Effects\" starring Michelle Pfeiffer and Academy Award winning actress Kathy Bates. A string of guest starring roles in television series followed, including Supernatural(CW), Fringe(FOX), Smallville (CW), Motive (CTV), as well as booking recurring roles on Once Upon a Time (ABC), Falling Skies (TNT), The Man in the High Castle (Amazon), You, Me, Her (Audience), and When Calls the Heart (Hallmark). She was just 11 years old when she booked her first lead in the movie, \"One Christmas Eve\" for Hallmark Hall of Fame. The film was directed by Jay Russell and starred Anne Heche, who mentored her throughout the six week shoot. Ali was subsequently nominated for a Young Artist Award for her work in the film. Ali followed this by booking another lead role in the Hallmark movie Campfire Kiss opposite Danica McKellar.She won a Joey award for best leading actress for her portrayal of Lacey Reynolds.\n\nAli's first starring role was in the independent film \"The Corruption of Divine Providence\". The film centered on a sixteen year old girl, Jeanne Seraphin (played by Skovbye) who is kidnapped from a small French Canadian town after being the subject of an alleged miracle, and different religious factions vie for control over her upon her eventual return. Directly after this Ali flew to Ottawa to film the lead role of Abigail Jones in the Lifetime movie Blind at 17 . While in Ottawa she booked the role of Emma in the Fox Feature Breakthrough opposite Chrissy Metz. All three films are expected to be released in 2019.\n\nIn July of 2019 Ali landed the series regular role of Tully Hart in the highly anticipated Netflix series called Firefly Lane.Firefly Lane is an adaptation of the novel from prolific author Kristin Hannah ,and follows the story of Kate and Tully's enduring friendship from their teen years through their 40's. Skovbye will play teenage Tully in the 1970's, a smart, gorgeous, effortlessly cool wild child who just moved to Firefly Lane with her wacky hippie mom. She's exciting to be around, enviably glam and instantly popular with both boys and girls. But her one true friend is her geeky neighbour Kate. Firefly Lane is set to premiere in late 2020.\n\nAli is drawn to complex and complicated characters and has an innate ability to play the more disturbed or \"flawed\" characters and is excited by the challenges that these roles present. Ali has developed a true passion for acting and has shown her ability to handle a diverse range of characters. She is incredibly dedicated to her craft and continues to train privately to hone her skills."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm9898029/", "image": {"height": 6016, "id": "/name/nm9898029/images/rm1802169089", "url": "https://m.media-amazon.com/images/M/MV5BNDJmYzQ3OWItZDgzNi00MWUwLWEyMDgtNmRkNDdmZGNiZWVkXkEyXkFqcGdeQXVyMjY2NjgxNA@@._V1_.jpg", "width": 4650}, "legacyNameText": "Molony, Alexander", "name": "Alexander Molony", "birthDate": "2006-09-12", "birthPlace": "Bromley, London, England, UK", "gender": "male", "miniBios": [{"author": "The Umbuter", "id": "/name/nm9898029/bio/mb0795271", "language": "en", "text": "Alexander was born in London and started showing an interest in acting when his younger brother also began to work in the industry. Voice work became his focus for a couple of years and he voiced the title role in Claude for Disney Junior.\n\nAlexander has enjoyed success in British theatre including South Pacific in Concert at Cadogan Hall; Bodies at the Royal Court Theatre and most recently, young Macduff in Macbeth at the Barbican for the Royal Shakespeare Company.\n\nHis television includes two series of The Reluctant Landlord opposite Romesh Ranganathan for Sky One."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm1442644/", "image": {"height": 2378, "id": "/name/nm1442644/images/rm780480257", "url": "https://m.media-amazon.com/images/M/MV5BNmFkOWEyMzktMzRlNi00NjBjLWE1YmYtMTMwZDcyMTFlOGE2XkEyXkFqcGdeQXVyMTk0NDE4NDE@._V1_.jpg", "width": 2213}, "legacyNameText": "Sandilands, Neil", "name": "Neil Sandilands", "birthDate": "1975", "birthPlace": "Randfontein, South Africa", "gender": "male", "heightCentimeters": 177.8, "realName": "Neil Joseph William Sandilands", "miniBios": [{"author": "Jay Schachter (Agent)", "id": "/name/nm1442644/bio/mb0280055", "language": "en", "text": "Neil Sandilands can be seen starring in Netflix's hit sci-fi/fantasy drama series \"Sweet Tooth.\" Sandilands shines as General Abbot, a self-appointed general who leads through wit, intimidation, and quirkiness. \"Sweet Tooth\" Season 2 concluded principle photography in New Zealand, June 2022.\n\nIn film, Sandilands was most recently seen starring as Wilhelm Leonberger opposite Tom Hanks in Universal Pictures' Academy Award nominated feature \"News of the World\" (2020) directed by Paul Greengrass.\n\nJuly 2022 sees Neil Sandilands being nominated as best supporting actor by the South African Film and Television Awards (SAFTA) for his work in DAM (Showmax) as well as a South African Music Award (SAMA) for best adult contemporary Afrikaans album for his debut album \"Sangoma Sandilands & Jou Pa se Posse - Maanskyn\". The music of this album also featured as the soundtrack for M-Net Originals 2022 hit show \"Desert Rose\" in which Sandilands portrays the troubled patriarch \"Freddy Fingers\".\n\nA master of disguise, Sandilands starred as super villain \"Big Bad\" Clifford Devoe/The Thinker on The CW's hit show \"The Flash.\" Additional television credits include starring as the contentious, mythological character Titus in \"The 100\" for The CW, AMC/Sundance TV's \"Hap and Leonard\" (opposite James Purefoy, Michael K. Williams, Christina Hendricks), \"House MD,\" \"The Americans\" and \"NCIS: LA.\" The list is long as he started his professional career as a child star in 1989.\n\nBorn in the mining town of Randfontein, South Africa, Sandilands is arguably one of the country's most versatile actors, bringing characters to life in film and television for over three decades, having started his professional acting career at just fourteen years old. Sandilands is the eldest of three children, his father having been a mining professional and his mother a teacher. He attended boarding school in neighboring town Krugersdorp and with the help of an encouraging teacher booked his first television acting gig in \"Meester\" (The Master) in 1989. Sandilands received his bachelor's degree in Social Sciences from the Rand Afrikaans University. He received an honorary award for his contribution to Arts & Culture from the University, having won its Theatre Festival three years consecutively with plays that he had written and starred in, as well initiating an International Film Festival.\n\nSandilands crossed the international divide in 2003 with the arthouse film \"Proteus\" by Canadian director John Greyson, and by 2007 he was a household name in South Africa. He is well known for his portrayal of Bart Kruger in the South African soap opera \"7de Laan.\" However, Sandilands had his sights on an international career, and has made the transition seamlessly. While Sandilands can currently be seen appearing in projects with a global reach, he still works often in South Africa where he performs in his native tongue, Afrikaans (English is his second language).\n\nIn May of 2021 Sandilands released his debut album \"Sangoma Sandilands & Jou Pa se Posse - Maanskyn\", in his native tongue, Afrikaans. The album leaped to Number 1 on iTunes South Africa's charts in 24 hours. Sandilands considers this album an artistic and literary contribution to his country of birth. He collaborated with the cream of South African musicians to produce this 10 track album, writing and composing 7 of the tracks, performing lead vocals and playing the ukulele. He had two previous Nr 1 hits with renowned South African performer Karen Zoid.\n\nAccolades for Sandilands include being a recipient of the South African Academy of Arts and Sciences award for his directorial work on \"Impresario\" - a 21-episode documentary. In 2014 he received a Clio, also as a documentary director. Sandilands is most proud of the fact that he played rugby in South Africa, America, England, Wales and Ireland, and regards the South African Rugby World Cup victory in 2019, for the 3rd time, a miraculous anomaly. He enjoys fishing and cites his philosophical development as being most influenced by Camus, Wittgenstein, Deleuze and Nietzsche, in reverse order. He would love to portray Nietzsche or the character Meursault from Camus' \"L'Étranger\" in the future.\n\nSandilands currently splits his time between South Africa, and Los Angeles, California. He is represented by Stewart Talent and managed by Luber Roklin Entertainment (USA). In South Africa he is represented by Figjam Artists Agency. Henry Mylne (director) writes: \"Vivid, flamboyant (and) thoroughly professional, he doubtlessly brings an electric excitement to both stage and screen that few actors can match.\" neilsandilands.com @realsandilands"}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0376716/", "image": {"height": 4688, "id": "/name/nm0376716/images/rm416160000", "url": "https://m.media-amazon.com/images/M/MV5BMjA5Njg3NDkxNV5BMl5BanBnXkFtZTgwNDczMTgyODE@._V1_.jpg", "width": 3516}, "legacyNameText": "Hendricks, Christina", "name": "Christina Hendricks", "birthDate": "1975-05-03", "birthPlace": "Knoxville, Tennessee, USA", "gender": "female", "heightCentimeters": 172.72, "nicknames": ["Christy"], "realName": "Christina Rene Hendricks", "spouses": [{"attributes": "(divorced)", "fromDate": "2009-10-11", "id": "/name/nm0034309/", "name": "Geoffrey Arend", "toDate": "2019-04-19"}], "trademarks": ["Known for playing intelligent and dominating women", "Bright red lipstick", "Red hair, blue eyes and fair skin.", "Breathy, girlish voice", "Wearing glasses", "Soprano voice"], "miniBios": [{"author": "IMDb Editors", "id": "/name/nm0376716/bio/mb0140121", "language": "en", "text": "Christina Rene Hendricks was born in Knoxville, Tennessee, and grew up in Twin Falls, Idaho. Her father, Robert, originally from England, worked for the U.S. Forest Service, while her mother, Jackie Sue (Raymond), was a psychologist. At the age of 13 her father transferred to the Forest Service Washington, D.C. headquarters and the family moved to nearby Fairfax, Virginia. She began acting at school and went into modeling from the ages of 18 to 27. In her early 20s, she also began appearing on television, landing a recurring role in Beggars and Choosers (1999) in 2000 and another on Kevin Hill (2004) before rising to international fame in Mad Men (2007). As well as her more famously conventional awards nominations (Emmys) and wins (SAG Awards) she also won a SyFy Genre Award in for \"Best Special Guest/Television\" for her role as Saffron in Joss Whedon's short-lived Firefly (2002)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Jimmy Marsden"], "disambiguation": "I", "id": "/name/nm0005188/", "image": {"height": 400, "id": "/name/nm0005188/images/rm1807518976", "url": "https://m.media-amazon.com/images/M/MV5BMTQyOTUzNjc0MF5BMl5BanBnXkFtZTcwNTYyMDYzMw@@._V1_.jpg", "width": 267}, "legacyNameText": "Marsden, James (I)", "name": "James Marsden", "birthDate": "1973-09-18", "birthPlace": "Stillwater, Oklahoma, USA", "gender": "male", "heightCentimeters": 177.8, "nicknames": ["Bello Jimmy", "J. P."], "realName": "James Paul Marsden", "spouses": [{"attributes": "(divorced) (2 children)", "fromDate": "2000-07-22", "id": "/name/nm0513950/", "name": "Lisa Linde", "toDate": "2011-09-23"}], "trademarks": ["All American boy looks"], "miniBios": [{"author": "Anastasia Andrew Veno", "id": "/name/nm0005188/bio/mb0067257", "language": "en", "text": "James Paul Marsden, or better known as just James Marsden, was born on September 18, 1973, in Stillwater, Oklahoma, to Kathleen (Scholz) and James Luther Marsden. His father, a distinguished Professor of Animal Sciences & Industry at Kansas State University, and his mother, a nutritionist, divorced when he was nine years old. James grew up with his four other siblings, sisters, Jennifer and Elizabeth, and brothers, Jeff and Robert. He has English, German, and Scottish ancestry. During his teen years, he attended Putnam City North High School which was located in Oklahoma City. After graduating in 1991, he attended Oklahoma State University and studied Broadcast Journalism. While in university, he became a member of the Delta Tau Delta fraternity.\n\nWhile vacationing with his family in Hawaii, he met actor Kirk Cameron, and his actress sister, Candace Cameron Bure. They eventually invited James to visit them in Los Angeles. After studying in Oklahoma State for over a year and appearing in his college production, \"Bye Bye Birdie\", he left school and moved to Los Angeles to pursue his interest in acting. James got his first job on the pilot episode of The Nanny (1993) as Eddie, who was Margaret Sheffield's boyfriend. He then became part of the Canadian television series, Boogies Diner (1994), which aired for one season. After that series ended, he got a brief role as the original Griffin on Fox's Party of Five (1994). His first big break came when he became the lead on the short-lived ABC series, Second Noah (1996). Although the show didn't last long, the young actor received enough exposure from the public and even managed to win the hearts of fellow teenage girls. In 1996, he attended an audition for a movie titled Primal Fear (1996) but unfortunately lost that role to Edward Norton. Two years later, he was offered a lead role in 54 (1998), which he turned down. The role later went to another actor, Ryan Phillippe.\n\nJames' star power increased when he starred in David Nutter's Disturbing Behavior (1998), alongside Katie Holmes and Nick Stahl, which had mixed reviews, but mostly positive ones. His role in the television series as Glenn Foy in Ally McBeal (1997), is probably one of his biggest achievement to date. He became one of the main cast members during the first half of season 5, where he showcased his singing abilities. It was in that show where he was able to grab the attention of audiences from different backgrounds. The 5' 10\" star later played Lon Hammon Jr. in the romantic movie, The Notebook (2004), which was based on a novel by Nicholas Sparks of the same name. His movies, Lies and Alibis (2006) and 10th & Wolf (2006) was also released around the world to audiences in the year 2006. One of his most memorable roles to fans is his role as Cyclops in the X-Men (2000) movie franchise. The movie was well accepted by audiences and critics, which eventually made James one of the hottest stars since it was released. He was among the actors who starred in all three of the X-Men movies. James had the honor of working alongside Patrick Stewart, Famke Janssen and Hugh Jackman in the film. However, not many people know that he actually had to wear lifts for most of his scenes in the X-men movies, because his character Cyclops is supposed to be 6\" 3\" compared to a 5' 3\" Wolverine. In reality, he is actually under 6' 0\", shorter than Famke Janssen who plays his love interest, Jean Grey, and even shorter than Hugh Jackman who played Wolverine.\n\nIn the year 2006, he played Richard White in the highly anticipated movie, Superman Returns (2006), which coincidentally was directed by Bryan Singer, who also directed previous X-Men installments. Although he appeared in X-Men: The Last Stand (2006), the third installment of the X-Men franchise, many would notice that he in fact had more screen time in 'Superman Returns', as Lois Lane's long awaiting fiancé who had to accept the fact that his fiancée is in love with the man of steel. James earned great reviews from that movie, which led to him getting more movie roles. In 2007, James played Corny Collins in the film Hairspray (2007), an adaption of the Broadway musical based on John Waters movie, Hairspray (1988). He joined a star-studded cast, starring alongside top names such as John Travolta, Queen Latifah and Michelle Pfeiffer. James not only acted in that movie, but also sang two of the film's songs, \"The Nicest Kids In Town\", and \"Hairspray\". Being part of Hairspray catapulted James to a different level of stardom as audiences got to see another side of him. His next role was in the Disney movie, Enchanted (2007), playing Prince Edward, where he acted alongside Amy Adams, Susan Sarandon and Patrick Dempsey. Once again, James had the opportunity to sing in two songs from the movie, \"True Love's Kiss\" and \"That's Amore\". Enchanted (2007) appealed to not only older audiences but also to those who were fans of Disney's network productions. Following his huge success in the years 2006 and 2007, James played the male lead role in the romantic comedy, 27 Dresses (2008), opposite actress Katherine Heigl in 2008. The movie did well at the box office, earning a gross revenue of over $159 million, which exceeded the expectations of crew members especially since it was under a $30 million budget.\n\nMarsden played the male lead in the horror film, The Box (2009), based on the 1970 short story \"Button, Button\" by author Richard Matheson. He starred opposite Cameron Diaz in the movie.\n\nHe co-starred in Accidental Love (2015) (previously Accidental Love (2015), a politically-themed romantic comedy, directed by David O. Russell and filmed in Columbia, South Carolina. Marsden's recent film roles include the sequel comedy Anchorman 2: The Legend Continues (2013), the romantic drama The Best of Me (2014), and the comedy Unfinished Business (2015).\n\nJames was married to Lisa Linde, an actress known from her role in Days of Our Lives (1965). Lisa is the daughter of legendary country music songwriter Dennis Linde. The couple wed on July 22, 2000 and have a son, Jack Holden Marsden who was born on February 1, 2001, and a daughter, Mary James, who was born on August 10, 2005. They divorced in 2011. James has another son, born in 2012, with model Rose Costa.\n\nMany would assume that with all this success achieved by James at this age, he would be somewhat high-headed but James mentioned that despite all the attention he's getting from the public eye, he tries to keep himself as grounded as possible. He even admits that he flies coach instead of first class while traveling with his family. In an interview he mentioned that he believes he has a certain responsibility to let his children know that he isn't special because of what he does, but who he is as a person. With a great humble attitude and a bright future ahead of him, there's definitely more to expect from this Oklahoma native."}]}, {"@type": "imdb.api.name.bio", "akas": ["Isobel Powley"], "id": "/name/nm2525790/", "image": {"height": 870, "id": "/name/nm2525790/images/rm3996723713", "url": "https://m.media-amazon.com/images/M/MV5BZGJhZTExOTUtYjczNS00YWM4LTgwZmMtYmEwNjMxNGViODIyXkEyXkFqcGdeQXVyMTYyNzE5NTIy._V1_.jpg", "width": 686}, "legacyNameText": "Powley, Bel", "name": "Bel Powley", "birthDate": "1992-03-07", "birthPlace": "London, England, UK", "gender": "female", "heightCentimeters": 157.48, "realName": "Isobel Dorothy Powley", "trademarks": ["Petite frame", "Her smile", "Big blue eyes"], "miniBios": [{"author": "Bonitao", "id": "/name/nm2525790/bio/mb0956384", "language": "en", "text": "Isobel Dorothy Powley is an English actress. Powley was born and raised in London, where she was educated at Holland Park School. She began acting as a teenager on television, starring on the CBBC action television series M.I. High (2007-2008), the period miniseries Little Dorrit (2008), the crime series Murderland (2009), and the ITV sitcom Benidorm (2014).\n\nPowley gained critical praise for her portrayal of Princess Margaret in A Royal Night Out (2015), for which she was nominated for a British Independent Film Award for Most Promising Newcomer, and a sexually confused teenager in the coming-of-age film The Diary of a Teenage Girl, for which she won the Gotham Independent Film Award for Best Actress and the Trophee Chopard at the 2016 Cannes Film Festival. She has since starred in the films Mary Shelley (2017), White Boy Rick (2018), Ashes in the Snow (2018), and The King of Staten Island (2020) and on the Apple TV+ drama series The Morning Show (2019-2021)."}]}, {"@type": "imdb.api.name.bio", "akas": ["William Poulter"], "id": "/name/nm2401020/", "image": {"height": 430, "id": "/name/nm2401020/images/rm1925838081", "url": "https://m.media-amazon.com/images/M/MV5BNGM5Y2IxNmYtODg5Zi00YjZhLThkZDUtMGE1ODc4N2MyZjAzXkEyXkFqcGdeQXVyMTExNzQzMDE0._V1_.jpg", "width": 527}, "legacyNameText": "Poulter, Will", "name": "Will Poulter", "birthDate": "1993-01-28", "birthPlace": "England, UK", "gender": "male", "heightCentimeters": 191.0, "realName": "William Jack Poulter", "miniBios": [{"author": "marlasinger816", "id": "/name/nm2401020/bio/mb0111945", "language": "en", "text": "Will Poulter is an English actor, recognized for his performances as Lee Carter in Son of Rambow (2007), Eustace Scrubb in The Chronicles of Narnia: The Voyage of the Dawn Treader (2010), and Kenny Rossmore in We're the Millers (2013). Will was born in Hammersmith, London, the son of Caroline (Barrah), a nurse, and Neil Poulter, a professor of cardiology. His mother was raised in an Anglo family in Kenya, where her own father was a prominent game warden at the Maasai Mara wildlife sanctuary.\n\nPoulter was educated at The Harrodian School, where he participated in drama. He said in an interview that his drama teacher (Laura Lawson) encouraged his audition for the Hammer and Tongs film, Son of Rambow (2007), by knocking on his English class window and mouthing \"auditions\" while pointing at a flier. He was later cast as the spiky-haired delinquent \"Lee Carter\". Laura Lawson was also responsible for the E4 comedy sketch show, School of Comedy (2009), in which Poulter appears portraying various roles, such as \"Mr. Mills\" and a South African security guard. Beginning as an after-school club, School of Comedy (2009) involves children parodying the world of adults. The show was taken to The Edinburgh Festival Fringe and, in 2009, it was adapted into a 6-part television series for E4. The show has, so far, run for two seasons. In 2008, Poulter was cast as \"Eustace Clarence Scrubb\" in the third film of the \"Narnia\" franchise, The Chronicles of Narnia: The Voyage of the Dawn Treader (2010). \"Dawn Treader\" was filmed in Queensland, Australia. During his almost six-month stay in Australia, Poulter was accompanied by his mother and younger sister. His father was not able to stay the entire time because of work, and his older siblings were able to stay for about two weeks, until they had to return to England. Poulter noted that, though it was hard to be separated from his family, they were able to keep in touch through phone calls and emails. More recently, Poulter appeared in the British independent film Wild Bill (2011), directed by Dexter Fletcher, and played Kenny Rossmore, his first American film character, in the comedic We're the Millers (2013), a major box office hit in the United States. His upcoming roles include The Maze Runner (2014), opposite Dylan O'Brien, and the lead in iBoy (2017)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2646861/", "image": {"height": 4480, "id": "/name/nm2646861/images/rm2154267137", "url": "https://m.media-amazon.com/images/M/MV5BODk5NjQ4NTAtNTlkYS00ZGE0LWIyZmItYjJlMzkwNTkzMjQ2XkEyXkFqcGdeQXVyNzg2ODExMQ@@._V1_.jpg", "width": 6720}, "legacyNameText": "Swallow, Emily", "name": "Emily Swallow", "birthDate": "1979-12-18", "birthPlace": "Washington, District of Columbia, USA", "gender": "female", "heightCentimeters": 170.0, "realName": "Emily Rebecca Swallow", "spouses": [{"current": true, "fromDate": "2018-08-26", "id": "/name/nm2169627/", "name": "Chad Kimball"}], "miniBios": [{"author": "Emily Swallow/Lisa Gallant", "id": "/name/nm2646861/bio/mb0216761", "language": "en", "text": "Emily Rebecca Swallow was born in Washington, DC and grew up in Sterling, VA and Jacksonville, FL.\n\nShe earned a BA in Middle Eastern Studies at the University of Virginia and interned at the State Department, but an acting teacher at UVA noticed her passion and talent for acting and singing and encouraged her to pursue further training. She auditioned for the prestigious NYU Tisch Graduate Acting Program and was accepted into their MFA Program.\n\nOn television, Emily is best known for Supernatural (2005), The Mentalist (2008), How to Get Away with Murder (2014), Monday Mornings (2013), and the highly anticipated Disney+ Series The Mandalorian (2019). She can also be heard as the voice of Dracula's ill-fated true love, Lisa Tepes, in the Netflix series Castlevania (2017).\n\nEmily continues to act on stage whenever she can, starring in world premieres of Donald Margulies play The Country House at LA's Geffen Playhouse, opposite Mark Rylance in Louis Jenkins' play Nice Fish at the Guthrie Theatre, in John Patrick Shanley's musical Romantic Poetry at Manhattan Theater Club and in High Fidelity on Broadway. In summer of 2018 she played a lady AND a charlatan opposite Tom Hanks' Falstaff in the Shakespeare Center Los Angeles production of Henry IV Parts 1&2. She was part of the LA Drama Critics' Circle Award-Winning 2016 production of Disgraced at the Mark Taper Forum in LA and she won the Falstaff Award for best Female Performer in 2010 for her performance as Kate in The Taming of the Shrew at the Old Globe in San Diego.\n\nEmily is a gifted singer; she has done her share of musicals and rock concerts. In 2012, Emily and fellow singer/comedienne Jac Huberman created a stage show called Jac N Swallow, which they perform in New York at the Laurie Beechman Theater and Joe's Pub. They would like to do the show again; will someone please babysit Jac's kids?"}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm1143816/", "image": {"height": 1280, "id": "/name/nm1143816/images/rm1420506625", "url": "https://m.media-amazon.com/images/M/MV5BNDkyNzAxYzEtNTQ1Ni00NWYwLWI3ZDYtMWJlMmZkZDdhMjVhXkEyXkFqcGdeQXVyMTUyODYwNDE5._V1_.jpg", "width": 1215}, "legacyNameText": "Rabe, Lily", "name": "Lily Rabe", "birthPlace": "New York, New York, USA", "gender": "female", "heightCentimeters": 172.72, "miniBios": [{"id": "/name/nm1143816/bio/bo429732608", "language": "en", "text": "Lily Rabe was born in New York, New York, USA. She is an actress and producer, known for Miss Stevens (2016), No Reservations (2007) and Fractured (2019)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm3014031/", "image": {"height": 1536, "id": "/name/nm3014031/images/rm3950871041", "url": "https://m.media-amazon.com/images/M/MV5BZjQ0OWQyZjQtZDllOC00MDRlLTlhNTktNjMxM2RlYTQzN2ViXkEyXkFqcGdeQXVyMTg1NTk0NTI@._V1_.jpg", "width": 1011}, "legacyNameText": "Brosnahan, Rachel", "name": "Rachel Brosnahan", "birthDate": "1990-07-12", "birthPlace": "Milwaukee, Wisconsin, USA", "gender": "female", "heightCentimeters": 161.29, "realName": "Rachel Elizabeth Brosnahan", "spouses": [{"current": true, "fromDate": "2016-06-06", "id": "/name/nm4170268/", "name": "Jason Ralph"}], "miniBios": [{"author": "ahmetkozan", "id": "/name/nm3014031/bio/mb0521075", "language": "en", "text": "Rachel Brosnahan was born in in Milwaukee, Wisconsin in 1990 and is an American actress. She is best known for her role as 'Midge' Maisel in the Amazon Prime Video series The Marvelous Mrs. Maisel (2017) for which she has won two Golden Globes for Best Performance by an Actress in a Television Series - Musical or Comedy (2019, 2018), one Emmy for Outstanding Lead Actress in a Comedy Series (2018), and one Critics' Choice Award for Best Actress in a Comedy Series (2018).\n\nShe is also known for her previous roles in the film Beautiful Creatures (2013) as Genevieve Duchannes, in the Netflix original series House of Cards (2013) as Rachel Posner, and in the TV series Manhattan (2014) as Abby Isaacs.\n\nRachel is the daughter of Carol (Best) and Earl Brosnahan, who worked in children's publishing. Her mother is English. Her father is an American, of mostly Irish descent. From the age of four, she was raised in Highland Park, Illinois. She has a younger brother and sister. Rachel is the niece of the late handbag designer Kate Spade, who was her father's sister.\n\nShe attended Wayne Thomas Elementary School, and then Northwood Junior High School. She performed in musical theater during junior high school and high school. At Highland Park High School, she was on the wrestling team for two years and was a snowboarding instructor. When Brosnahan was 16, she took a class with Carole Dibo, the director of Wilmette's Actors' Training Center, and now Brosnahan's manager. She graduated in 2008, and graduated from New York University's Tisch School of the Arts in 2012.\n\nBrosnahan was cast in her first movie role as Lisa in the Michael Bay-produced horror movie The Unborn (2009) while she was still in high school. During college, she performed in single episodes of TV series such as Gossip Girl (2007), The Good Wife (2009), Grey's Anatomy (2005), and In Treatment (2008). After college, she began landing recurring roles in series such as The Blacklist (2013), the short-lived Black Box (2014)), and \"House of Cards\" (2013-15), which brought her career prominence that included an Emmy nomination for Outstanding Guest Actress in a Drama Series in 2015. Initially booked for two episodes and five lines, she caught Beau Willimon's eye; soon, she was developed into a major character. She also played Abby Isaacs for two seasons on the TV drama series \"Manhattan.\"\n\nShe first appeared on stage in 2009 in \"Up\" at the Steppenwolf Theater, which was followed by her Broadway debut in \"The Big Knife\" with the Roundabout Theater Company in 2013. In 2016 she played Desdemona in \"Othello\" at New York Theater Workshop opposite David Oyelowo and Daniel Craig.\n\nShe was cast as the lead role and title character of the Amazon Video series The Marvelous Mrs. Maisel (2017), which premiered in 2017. Her performance earned her a Golden Globe and a Critics' Choice award for Best Actress in a Television Series--Musical or Comedy."}]}, {"@type": "imdb.api.name.bio", "akas": ["Louis Gabriel Basso III"], "disambiguation": "I", "id": "/name/nm2773059/", "image": {"height": 1280, "id": "/name/nm2773059/images/rm729088257", "url": "https://m.media-amazon.com/images/M/MV5BNDgyMzcwYzAtN2JiNy00NjYzLWExMzgtN2Q4NmM4MDBlYWYyXkEyXkFqcGdeQXVyMTI2Nzk3NzI4._V1_.jpg", "width": 1112}, "legacyNameText": "Basso, Gabriel (I)", "name": "Gabriel Basso", "birthDate": "1994-12-11", "birthPlace": "St Louis, Missouri, USA", "gender": "male", "heightCentimeters": 182.88, "miniBios": [{"id": "/name/nm2773059/bio/bo435636440", "language": "en", "text": "Gabriel Basso was born on December 11, 1994 in St Louis, Missouri, USA. He is an actor, known for Super 8 (2011), The Kings of Summer (2013) and Hillbilly Elegy (2020)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Alyssa Alook"], "id": "/name/nm9447283/", "image": {"height": 1500, "id": "/name/nm9447283/images/rm721367809", "url": "https://m.media-amazon.com/images/M/MV5BMWQyYmFlMzUtZGFmYi00ZTE4LWE0YWMtNDg1NDYxNTZjNjBlXkEyXkFqcGdeQXVyODE1Njg3NDQ@._V1_.jpg", "width": 1000}, "legacyNameText": "Wapanatâhk, Alyssa", "name": "Alyssa Wapanatâhk", "gender": "female", "miniBios": [{"id": "/name/nm9447283/bio/bo432776339", "language": "en", "text": "Alyssa Wapanatâhk is known for Peter Pan & Wendy (2023), Napes Kasêkipatwât - The Boy & The Braid (2019) and Robo Games (2018)."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "III", "id": "/name/nm4574440/", "image": {"height": 1735, "id": "/name/nm4574440/images/rm1344726017", "url": "https://m.media-amazon.com/images/M/MV5BNjg4OTgxMTctZDI0MC00ODY4LWEzNmItZjAwNjQ0NGQ1NDQxXkEyXkFqcGdeQXVyNzYyMTMyODk@._V1_.jpg", "width": 1200}, "legacyNameText": "Barrera, Melissa (III)", "name": "Melissa Barrera", "birthDate": "1990-07-04", "birthPlace": "Monterrey, Nuevo León, Mexico", "gender": "female", "heightCentimeters": 170.0, "realName": "Melissa Barrera Martinez", "spouses": [{"current": true, "fromDate": "2019-02-05", "id": "/name/nm4577166/", "name": "Xavier Zazueta"}], "miniBios": [{"author": "MH. Salazar", "id": "/name/nm4574440/bio/mb0442272", "language": "en", "text": "Melissa Barrera Martinez was born in Monterrey, Nuevo León México. The first of four daughters of Rosana Maria Martinez García and Tomás Gerardo Barrera Tames. She attended the American School Foundation of Monterrey from the ages of 4 to 18 when she graduated high school. It was during her middle school years that she began getting involved in theater. She participated in school plays and musicals such as 'The Wizard of Oz,' 'Footloose,' 'Joseph and the Amazing Technicolor Dreamcoat' and 'Aida.' She began her professional career during her last year of high school when she led the Mexican production of 'Romeo y Julieta'(the original french musical) playing the part of Julieta. After that she also participated in a regional production of 'Footloose'in the role of Ariel before leaving for college in New York. She auditioned and was accepted to the Collaborative Arts Project 21 (CAP21) as part of the Tisch School of the Arts in New York University (NYU) in 2009. During her years at NYU she participated in productions such as 'Sweet Charity' and Brecht's 'The Caucasian Chalk Circle' in the lead role of Grusche Vachnadze. In 2011 she left NYU when she was selected to participate in the Mexican reality show 'La Academia'of TV Azteca in which she gained lots of critical acclaim for her singing and dancing abilities. At the end of 2011 she was chosen to participate in her first telenovela in TV Azteca: 'La Mujer de Judas' in the role of Zulamita. Directly after that she was offered her second role as the young ingenue in the telenovela 'La Otra Cara del Alma' alongside the latin telenovela star Gabriela Spanic. In this telenovela she earned great reviews for her acting abilities and earned her first lead in a telenovela as Olvido in 'Siempre Tuya Acapulco.' This became her big break as she positioned herself as one of the fresh new faces of Mexican television and the show became one of the most successful and beloved stories in over 20 countries. After the success of 'Siempre Tuya Acapulco'she got offered her second lead role in a telenovela 'Tanto Amor'in which she once again earned critical acclaim for her acting. After working in television she opted to try her luck in the film industry doing 4 films in two years. Two of the films which she leads are set to premiere in the second half of 2017: The first set in the 1950s 'Sacúdete las Penas', the second, a modern drama 'Prima.' Not leaving her love for the theatre behind Melissa has always procured to alternate television and film with theatre, starring in three long running productions in Mexico city: ¨Despertando en Primavera'(Spring Awakening) as Wendla, the spanish hit musical ¨Hoy No Me Puedo Levantar (Hnmpl)¨ as Maria, and Mel Brook's Él Joven Frankenstein'(Young Frankenstein) as Inga alongside the comedians Adal Ramones and the famous Mascabrothers. For her role as Maria in 'Hnmpl' she won two awards: Revelation in Theatre from the Agrupación de Periodistas Teatrales (APT), and the Female Revelation in a Musical from the Agrupación de Críticos y Periodistas de Teatro (ACPT)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm1185747/", "image": {"height": 5184, "id": "/name/nm1185747/images/rm2112802817", "url": "https://m.media-amazon.com/images/M/MV5BMWZiMjhhYTctMzkxZC00ZTQ2LWFiNDYtODg4YWU3OTY2ODVkXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg", "width": 3456}, "legacyNameText": "Monaghan, Cameron", "name": "Cameron Monaghan", "birthDate": "1993-08-16", "birthPlace": "Santa Monica, California, USA", "gender": "male", "heightCentimeters": 182.0, "realName": "Cameron Riley Monaghan", "miniBios": [{"author": "DMM", "id": "/name/nm1185747/bio/mb0024858", "language": "en", "text": "Cameron Monaghan was born in Santa Monica, California. Cameron's debut TV role as \"Winthrop Paroo\" in The Music Man (2003) was originally played by Ron Howard in The Music Man (1962). Cameron began his acting career at 5 years old in commercials. At age 7, he began appearing on stage as Stuart Little in \"Stuart Little\" and as Piglet in \"Winnie the Pooh\" at Little Palm Family Theatre in Boca. His most famous rolls include Ian Gallagher in \"Shameless US\" and Jerome and Jeremiah Valeska in \"Gotham\"."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0147147/", "image": {"height": 744, "id": "/name/nm0147147/images/rm1318763008", "url": "https://m.media-amazon.com/images/M/MV5BODI0MTYzNTIxNl5BMl5BanBnXkFtZTcwNjg2Nzc0NA@@._V1_.jpg", "width": 627}, "legacyNameText": "Cavill, Henry", "name": "Henry Cavill", "birthDate": "1983-05-05", "birthPlace": "Jersey, Channel Islands", "gender": "male", "heightCentimeters": 185.42, "nicknames": ["Hank", "Henners", "Most Dashing Duke"], "realName": "Henry William Dalgliesh Cavill", "trademarks": ["Strong, defined jawline", "Macho, heroic, stoic characters", "Muscular physique", "Deep resonant voice"], "miniBios": [{"author": "Pedro Borges", "id": "/name/nm0147147/bio/mb0006088", "language": "en", "text": "Henry William Dalgliesh Cavill was born on the Bailiwick of Jersey, a British Crown dependency in the Channel Islands. His mother, Marianne (Dalgliesh), a housewife, was also born on Jersey, and is of Irish, Scottish and English ancestry. Henry's father, Colin Richard Cavill, a stockbroker, is of English origin (born in Chester, England). Henry is the second youngest son, with four brothers. He was privately educated at St. Michael's Preparatory School in Saint Saviour, Jersey before attending Stowe School in Buckinghamshire, England.\n\nHis interest in acting started at an early age with school play renditions of Shakespeare's \"A Midsummer Night's Dream\", and Sonny LaTierri in \"Grease\". He also starred and directed Shakespeare's \"Hamlet\" in the BBC documentary \"40 Minutes\". It was at age 17 when Henry was discovered by casting directors at school who were looking for a young boy to play Albert Mondego in The Count of Monte Cristo (2002). He went on to star in Vendetta (2001), appear in BBC's The Inspector Lynley Mysteries (2001), the television film Goodbye, Mr. Chips (2002), and the television series Midsomer Murders (1997).\n\nWhen Henry was 20 years old, he gained starring roles in I Capture the Castle (2003), Hellraiser: Hellworld (2005), Red Riding Hood (2006) and Tristan + Isolde (2006). He also had a minor role in the fantasy-adventure epic Stardust (2007) alongside Sienna Miller and Ben Barnes. During 2007-2010, Henry had a leading role on the television series The Tudors (2007) as Charles Brandon, 1st Duke of Suffolk. The series was a success and was nominated for a Golden Globe Award in 2007 and won an Emmy Award in 2008. Entertainment Weekly named him \"Most Dashing Duke\".\n\nHe also starred in Blood Creek (2006) and Woody Allen's comedy film Whatever Works (2009). On January 30, 2011, it was announced that Henry Cavill had been cast as the next Superman in Man of Steel (2013), making him the first non-American actor to play Superman. The movie was directed by Zach Snyder, produced by Christopher Nolan, and scripted by David S. Goyer. On November 7, 2011, Henry starred in Tarsem Singh's fantasy-adventure epic Immortals (2011) alongside Mickey Rourke, Freida Pinto and Luke Evans. On September 7, 2012, Henry starred in the action-thriller Cold Light of Day (2003) alongside Bruce Willis and Sigourney Weaver.\n\nOn June 10, 2013, Man of Steel (2013) kicked off its world premiere in New York City followed by London, Bailiwick of Jersey, Sicily, Madrid, Shanghai, Sydney and Tokyo. The movie became the highest-grossing Superman film to date, and the second-highest-grossing reboot of all time behind The Amazing Spider-Man (2012). Glamour magazine ranked him the #1 \"Sexiest Man\". In August 2014, Henry became the Ambassador for Durrell Wildlife Park and created a website and social media called #CavillConservation to help raise funds and awareness for his love of animals and conservation. On November 3, 2014, it was announced that Cavill, his brother Charlie, and London-based producer Rex Glensy, have formed their own British production company, Promethean Productions.\n\nOn August 7, 2015, The Man from U.N.C.L.E. (2015) began its premiere tour with a people's premiere at the famous Somerset House in London, followed by its world premiere in New York City, then Toronto, and Rio de Janeiro. Cavill reprised his role as Superman in Batman v Superman: Dawn of Justice (2016) and Justice League (2017)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm1996829/", "image": {"height": 1880, "id": "/name/nm1996829/images/rm4174288129", "url": "https://m.media-amazon.com/images/M/MV5BNTgzYzY0MzktNzgxOC00NGRhLWJlYjYtY2ZlOTkxMzQwYmQ2XkEyXkFqcGdeQXVyMTAwMDQ3NTc1._V1_.jpg", "width": 1670}, "legacyNameText": "Anozie, Nonso", "name": "Nonso Anozie", "birthDate": "1978-11-17", "birthPlace": "London, England, UK", "gender": "male", "heightCentimeters": 198.1, "trademarks": ["Towering height"], "miniBios": [{"id": "/name/nm1996829/bio/bo419671708", "language": "en", "text": "Nonso Anozie was born on November 17, 1978 in London, England, UK. He is an actor and producer, known for Cinderella (2015), Conan the Barbarian (2011) and Happy-Go-Lucky (2008)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Michelle Rodríguez"], "disambiguation": "I", "id": "/name/nm0735442/", "image": {"height": 676, "id": "/name/nm0735442/images/rm2927663616", "url": "https://m.media-amazon.com/images/M/MV5BMTkwODIzMzYyMl5BMl5BanBnXkFtZTYwNzAyNjAz._V1_.jpg", "width": 450}, "legacyNameText": "Rodriguez, Michelle (I)", "name": "Michelle Rodriguez", "birthDate": "1978-07-12", "birthPlace": "San Antonio, Texas, USA", "gender": "female", "heightCentimeters": 165.1, "nicknames": ["MRod"], "realName": "Mayte Michelle Rodriguez", "trademarks": ["Often plays tough and handy characters"], "miniBios": [{"author": "RoxyInc19@aol.com", "id": "/name/nm0735442/bio/mb0030304", "language": "en", "text": "Mayte Michelle Rodríguez was born on July 12, 1978 in San Antonio, Texas to Carmen Milady Pared Espinal, a housewife, and Rafael Rodríguez Santiago, a U.S. Army solider. Known for tough-chick roles, Michelle is proof that there is a cross between beauty and brawn. Michelle always knew she was destined to become a star, she just didn't know how to get there. Michelle lived in San Antonio until the age of 8 when her parents divorced & moved to the Dominican Republic where she lived for two years before moving to Puerto Rico. At 11, Michelle's family relocated for the last time to Jersey City, New Jersey. Although she has been working since 1999 as an extra in such films as Summer of Sam (1999) and Cradle Will Rock (1999), it only took a magazine ad announcing an open casting call in New York for Michelle to decide to finally step into the spotlight. The role was the female lead, the movie was Girlfight (2000). Despite the lack of experience in film and boxing, Michelle auditioned, along with another 350 girls. After various trials inside an actual boxing ring and five arduous months of training in Brooklyn's Gleason's Gym, she was finally chosen to portray the role of Diana Guzman. As soon as the independent film began making the rounds at various film festivals, Michelle began gaining critical acclaim for her performance earning her awards like the Deauville Festival of American Cinema award for Best Actress and the Las Vegas Film Critics Society for Female Breakthrough performance. As Girlfight (2000) continued to gain notoriety with its September 2000 release, Michelle was already hard at work with films like 3 A.M. (2001), the blockbuster hit The Fast and the Furious (2001), and Resident Evil (2002). With Hollywood calling her name, the future for this feisty Jersey girl is as strong as the punches she throws."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "I", "id": "/name/nm0027572/", "image": {"height": 400, "id": "/name/nm0027572/images/rm268013312", "url": "https://m.media-amazon.com/images/M/MV5BMTY1MjgzODIwNF5BMl5BanBnXkFtZTcwNTM2NzExMw@@._V1_.jpg", "width": 295}, "legacyNameText": "Anderson, Wes (I)", "name": "Wes Anderson", "birthDate": "1969-05-01", "birthPlace": "Houston, Texas, USA", "gender": "male", "heightCentimeters": 185.42, "realName": "Wesley Wales Anderson", "trademarks": ["Makes obsessive and comedic use of rostrum camera insert shots, foregrounding the minutiae of books and other documents.", "Has ended all his movies with a slow-motion shot, with the exception of The Darjeeling Limited (2007).", "Just about the entire score of all of his movies, with the exception of The Darjeeling Limited (2007) and The Grand Budapest Hotel (2014), were composed by Mark Mothersbaugh.", "Frequently casts Owen Wilson, Luke Wilson, Jason Schwartzman, Andrew Wilson, Bill Murray, Kumar Pallana, Dipak Pallana, Brian Tenenbaum, Stephen Dignan, Bob Balaban, Tilda Swinton, Edward Norton, and Anjelica Huston.", "Likes to shoot with extremely wide-angle anamorphic lenses that exhibit considerable barrel distortion.", "Frequently uses a take/double take technique where he will show a character/action, quickly pan to another character/action, then pan back, usually with handheld camera.", "Movies often focus around a broken or unorthodox family circle", "At least one of his characters is usually a grown man seeking the approval of a parent or parent figure.", "Often includes songs by The Rolling Stones on the soundtracks of his films", "The titlecards are almost always in the font Futura Bold, most commonly in yellow color.", "A character giving a complex, lengthy explanation for humor", "Unique ways of introducing a large cast of characters", "Characters who are heavy on body language", "Quirky themes of white middle-class and upper-class issues", "Shots of the characters standing still and facing toward the screen with little to no emotion.", "Features many precisely centered, straight-on shots", "Every Wes Anderson film has essentially the same ending: all the flawed, troubled, confused characters who have struggled to get along throughout the movie come together at the end for a common purpose, and if not actually forgiving each other, at least coming to a kind of acceptance of each other.", "Many of Anderson's movie explore mental illness, especially depression. Many of his characters struggle with finding a reason to keep on living, but they usually find it through support from others."], "miniBios": [{"author": "Anonymous", "id": "/name/nm0027572/bio/mb0166601", "language": "en", "text": "Wesley Wales Anderson was born in Houston, Texas. His mother, Texas Ann (Burroughs), is an archaeologist turned real estate agent, and his father, Melver Leonard Anderson, worked in advertising and PR. He has two brothers, Eric and Mel. Anderson's parents divorced when he was a young child, an event that he described as the most crucial event of his brothers and his growing up. During childhood, Anderson also began writing plays and making super-8 movies. He was educated at Westchester High School and then St. John's, a private prep school in Houston, Texas, which was later to prove an inspiration for the film Rushmore (1998).\n\nAnderson attended the University of Texas in Austin, where he majored in philosophy. It was there that he met Owen Wilson. They became friends and began making short films, some of which aired on a local cable-access station. One of their shorts was Bottle Rocket (1994), which starred Owen and his brother Luke Wilson. The short was screened at the Sundance Film Festival, where it was successfully received, so much so that they received funding to make a feature-length version. Bottle Rocket (1996) was not a commercial hit, but it gained a cult audience and high-profile fans, which included Martin Scorsese.\n\nSuccess followed with films such as Rushmore (1998), The Life Aquatic with Steve Zissou (2004), The Royal Tenenbaums (2001) and an animated feature, Fantastic Mr. Fox (2009). The latter two films earned Anderson Oscar nominations."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "I", "id": "/name/nm0695435/", "image": {"height": 2048, "id": "/name/nm0695435/images/rm2795241729", "url": "https://m.media-amazon.com/images/M/MV5BZjdkYjg1NzMtOTY2YS00ZWI1LWEwZWYtOTU1YTM2ODA2ZWY5XkEyXkFqcGdeQXVyMTM1MjAxMDc3._V1_.jpg", "width": 1536}, "legacyNameText": "Pratt, Chris (I)", "name": "Chris Pratt", "birthDate": "1979-06-21", "birthPlace": "Virginia, Minnesota, USA", "gender": "male", "heightCentimeters": 188.0, "nicknames": ["Chris"], "realName": "Christopher Michael Pratt", "spouses": [{"attributes": "(2 children)", "current": true, "fromDate": "2019-06-08", "id": "/name/nm4083495/", "name": "Katherine Schwarzenegger"}, {"attributes": "(divorced) (1 child)", "fromDate": "2009-07-09", "id": "/name/nm0267506/", "name": "Anna Faris", "toDate": "2018-10-16"}], "trademarks": ["Affable, gregarious if somewhat goofy persona", "Says \"dude\" a lot, on screen and off", "Tall stature"], "miniBios": [{"author": "Pedro Borges/R.M. Sieger", "id": "/name/nm0695435/bio/mb0182972", "language": "en", "text": "Christopher Michael \"Chris\" Pratt was born on June 21, 1979 in Virginia, Minnesota and raised in Lake Stevens, Washington, to Kathleen Louise (Indahl), who worked at a supermarket, and Daniel Clifton Pratt, who remodeled houses. He is of mostly Norwegian descent. He graduated from Lake Stevens High School in 1997, and has two older siblings, Cully and Angie.\n\nChris came to prominence for his small-screen roles, including Bright Abbott in Everwood (2002), Ché in The O.C. (2003), and Andy Dwyer and Parks and Recreation (2009), and notable film roles in Moneyball (2011), The Five-Year Engagement (2012), Zero Dark Thirty (2012), Delivery Man (2013), and Her (2013). In 2014, he broke out as a leading man after headlining two of the year's biggest films: he voiced Emmet Brickowski in The Lego Movie (2014) & starred as Peter Quill/Star-Lord in Guardians of the Galaxy (2014). In 2015, he headlined the sci-fi thriller Jurassic World (2015), the fourth installment in the Jurassic Park franchise and his most financially successful film. In 2016, he co-starred in the remake The Magnificent Seven (2016), with Denzel Washington and Ethan Hawke, and appeared with Jennifer Lawrence in the sci-fi drama Passengers (2016). In the near future, he returns as Star-Lord for Guardians of the Galaxy Vol. 2 (2017), with Jurassic World: Fallen Kingdom (2018) not far behind."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm3880181/", "image": {"height": 1152, "id": "/name/nm3880181/images/rm1896235520", "url": "https://m.media-amazon.com/images/M/MV5BOGU2MzlmNWUtNDQ1Yy00NDRmLWI2NTgtMDhmYTdmNjg1ZWZmXkEyXkFqcGdeQXVyNDgxNjEwOTE@._V1_.jpg", "width": 922}, "legacyNameText": "Lee, Abbey", "name": "Abbey Lee", "birthDate": "1987-06-12", "birthPlace": "Melbourne, Victoria, Australia", "gender": "female", "heightCentimeters": 180.0, "nicknames": ["Abbs"], "realName": "Abbey Lee Kershaw", "trademarks": ["Gapped teeth"], "miniBios": [{"author": "Anonymous", "id": "/name/nm3880181/bio/mb0728503", "language": "en", "text": "Abbey Lee is known for her work as a model and actress. In 2015 Abbey made her feature film debut alongside Tom Hardy and Charlize Theron in George Miller's post-apocalyptic film \"Mad Max: Fury Road\". Abbey has since appeared in numerous feature films in both America and Australia. She has starred in the Australian film \"Ruben Guthrie\", directed by Brendan Cowell; the Lionsgate/Summit epic fantasy film \"Gods Of Egypt\" alongside Gerard Butler and Geoffrey Rush; \"Office Christmas Party\" directed by Josh Gordon and Will Speck in which she starred opposite Jason Bateman, Jennifer Aniston, and TJ Miller; \"The Neon Demon\" from writer/director Nicolas Winding Refn in which she starred opposite Elle Fanning, Keanu Reeves, and Bella Heathcote; and \"The Dark Tower\", based on the best-selling novels from Stephen King and starring Matthew McConaughey and Idris Elba. She also recently starred in the award-winning Australian film \"1%\" opposite Eddie Baroo and Ryan Corr for which she was nominated for Best Lead Actress at the 2018 AACTA Awards. Most recently, Abbey appeared in Justin Kelly's \"Welcome Stranger\", opposite Riley Keough and Caleb Landry Jones, and \"Elizabeth Harvest\", opposite Ciaran Hinds and Carla Gugino.\n\nAbbey made her theatre debut playing the role of Yeliena in the Hampstead Theatre's 2018 London production of \"Uncle Vanya\", directed by Terry Johnson.\n\nAbbey will next be seen in the new Jordan Peele & J.J. Abrams produced HBO series \"Lovecraft Country\", which also stars Michael Kenneth Williams, Jurnee Smollett-Bell, Courtney B Vance and Jonathan Majors, and is scheduled to be released later this year.\n\nPrior to pursuing an acting career Abbey was well known as a highly successful international model, working with designers including Karl Lagerfeld, Gucci, Alexander McQueen, Versace, and Dolce & Gabbana. She has been featured several times on the cover of Australian Vogue."}]}, {"@type": "imdb.api.name.bio", "akas": ["India Ria Amarteifio"], "id": "/name/nm6042130/", "image": {"height": 2000, "id": "/name/nm6042130/images/rm2375135489", "url": "https://m.media-amazon.com/images/M/MV5BYTJjMGQwMWMtOTViNS00ZmJlLTg5MjYtNzMwODA0NDAzMGYwXkEyXkFqcGdeQXVyNjU2NjQxMDY@._V1_.jpg", "width": 1600}, "legacyNameText": "Amarteifio, India", "name": "India Amarteifio", "gender": "female", "miniBios": [{"id": "/name/nm6042130/bio/bo427273510", "language": "en", "text": "India Amarteifio is known for Sex Education (2019), Line of Duty (2012) and Doctor Who (2005)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2933757/", "image": {"height": 1461, "id": "/name/nm2933757/images/rm2456630017", "url": "https://m.media-amazon.com/images/M/MV5BNzgxYTA2OTUtYmE0ZC00ZTc0LWJjY2QtOTIzMTJhNGUyZjBlXkEyXkFqcGdeQXVyMTg4NDI0NDM@._V1_.jpg", "width": 1170}, "legacyNameText": "Gadot, Gal", "name": "Gal Gadot", "birthDate": "1985-04-30", "birthPlace": "Rosh Ha'ayin, Israel", "gender": "female", "heightCentimeters": 178.0, "spouses": [{"attributes": "(3 children)", "current": true, "fromDate": "2008-09-28", "name": "Yaron Varsano"}], "trademarks": ["Statuesque, model-like figure."], "miniBios": [{"author": "Aj and Pedro Borges", "id": "/name/nm2933757/bio/mb0263746", "language": "en", "text": "Gal Gadot is an Israeli actress, singer, martial artist, and model. She was born in Rosh Ha'ayin, Israel. Her parents are Irit, a teacher, and Michael, an engineer. She served in the IDF for two years, and won the Miss Israel title in 2004.\n\nGal made her film debut in the fourth film of the Fast and Furious franchise, Fast & Furious (2009), as Gisele. Her role was expanded in the sequels Fast Five (2011) and Fast & Furious 6 (2013), in which her character was romantically linked to Han Seoul-Oh (Sung Kang).\n\nIn early December 2013, Gal was cast as Wonder Woman in the superhero team-up film Batman v Superman: Dawn of Justice (2016), and filming began in 2014 for a March 2016 release. Gadot received swordsmanship, Kung Fu kickboxing, Capoeira and Brazilian Jiu-Jitsu training in preparation for the role. As a result, her performance as the superhero, which is the first time for the character on film, was hailed as one of the best parts of the otherwise poorly-received film. The film is part of the DC Extended Universe, and Gadot plays the role again in the solo film Wonder Woman (2017), which was received very positively, and superhero team-up Justice League (2017).\n\nShe has been married to Israeli businessman Yaron Varsano since September 28, 2008. They have three daughters."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "I", "id": "/name/nm1451415/", "image": {"height": 895, "id": "/name/nm1451415/images/rm2574733312", "url": "https://m.media-amazon.com/images/M/MV5BZTFhMTU0ODAtNjNjZS00YTcwLWE0Y2ItMWM0OGJiOWJhOTA1XkEyXkFqcGdeQXVyMjc0MTMxMDI@._V1_.jpg", "width": 634}, "legacyNameText": "Sutherland, Alyssa (I)", "name": "Alyssa Sutherland", "birthPlace": "Brisbane, Queensland, Australia", "gender": "female", "heightCentimeters": 180.0, "spouses": [{"attributes": "(divorced)", "fromDate": "2012-02-05", "id": "/name/nm2151655/", "name": "Laurence Shanet", "toDate": "2013-11"}], "trademarks": ["Strawberry blonde hair", "Towering height", "Freckles"], "miniBios": [{"author": "Bio Writer", "id": "/name/nm1451415/bio/mb0253180", "language": "en", "text": "Alyssa Sutherland stars on History's breakout historical drama series, Vikings (2013), as \"Princess Aslaug.\" A native of Brisbane, Australia, Alyssa began modeling at the age 15 and soon after appeared on her first of multiple Vogue Australia covers. Alyssa then moved to New York, where she continued modeling and appeared in campaigns for Calvin Klein, Coco Chanel, Ralph Lauren and Bulgari, among others. She has been photographed by some of the world's leading photographers, including Herb Ritts, Steven Miesel, Bruce Weber and Ellen Von Unwerth. In addition, Alyssa has appeared in dozens of international magazines, including Vogue, Elle, Marie Claire, Harper's Bazaar and Glamour.\n\nBefore joining the cast of \"Vikings,\" Alyssa appeared in several independent films, including The Fortune Theory (2013), Don't Look Up (2009), and Day on Fire (2006) with Olympia Dukakis, which screened at the Toronto and Berlin Film Festivals. On the small screen, Alyssa has appeared on NBC's Law & Order: Special Victims Unit (1999) and Fox's New Amsterdam (2008).\n\nAlyssa currently resides in Los Angeles, California."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm4456120/", "image": {"height": 555, "id": "/name/nm4456120/images/rm714881792", "url": "https://m.media-amazon.com/images/M/MV5BMWRiNzczYzMtOGE1Yi00Njg0LWFkNTUtYzE3NmVkZDZkMjg5XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg", "width": 450}, "legacyNameText": "Debicki, Elizabeth", "name": "Elizabeth Debicki", "birthDate": "1990-08-24", "birthPlace": "Paris, France", "gender": "female", "heightCentimeters": 190.0, "trademarks": ["Statuesque height"], "miniBios": [{"author": "Alexandre Baltazar", "id": "/name/nm4456120/bio/mb0224793", "language": "en", "text": "Debicki was born in Paris, to a Polish father and an Australian mother of Irish descent, who were both dancers. When she was five, the family moved to Melbourne, where she grew up with two younger siblings. She became interested in ballet at an early age and trained as a dancer until deciding to switch to theatre. A student at Huntingtower School in Melbourne's east, Debicki achieved two perfect study scores in Drama and English and was the school's dux when she graduated in 2007. In 2010, she completed a degree in drama at the University of Melbourne's Victorian College of the Arts. In August 2009, she was the recipient of a Richard Pratt Bursary for outstanding acting students in their second year of training."}]}, {"@type": "imdb.api.name.bio", "akas": ["Norman Kreeves", "K. C. Reeves", "Keannu Reeves", "Chuck Spadina"], "id": "/name/nm0000206/", "image": {"height": 2700, "id": "/name/nm0000206/images/rm1958676737", "url": "https://m.media-amazon.com/images/M/MV5BNGJmMWEzOGQtMWZkNS00MGNiLTk5NGEtYzg1YzAyZTgzZTZmXkEyXkFqcGdeQXVyMTE1MTYxNDAw._V1_.jpg", "width": 1800}, "legacyNameText": "Reeves, Keanu", "name": "Keanu Reeves", "birthDate": "1964-09-02", "birthPlace": "Beirut, Lebanon", "gender": "male", "heightCentimeters": 185.5, "nicknames": ["The Wall", "The One"], "realName": "Keanu Charles Reeves", "trademarks": ["Intense contemplative gaze", "Deep husky voice", "Known for playing stoic reserved characters", "Friendly, down-to-earth personality"], "miniBios": [{"author": "Anonymous", "id": "/name/nm0000206/bio/mb0174842", "language": "en", "text": "Keanu Charles Reeves, whose first name means \"cool breeze over the mountains\" in Hawaiian, was born September 2, 1964 in Beirut, Lebanon. He is the son of Patricia Taylor, a showgirl and costume designer, and Samuel Nowlin Reeves, a geologist. Keanu's father was born in Hawaii, of British, Portuguese, Native Hawaiian, and Chinese ancestry, and Keanu's mother is originally from England. After his parents' marriage dissolved, Keanu moved with his mother and younger sister, Kim Reeves, to New York City, then Toronto. Stepfather #1 was Paul Aaron, a stage and film director - he and Patricia divorced within a year, after which she went on to marry (and divorce) rock promoter Robert Miller and hair salon owner Jack Bond. Reeves never reconnected with his biological father. In high school, Reeves was lukewarm toward academics but took a keen interest in ice hockey (as team goalie, he earned the nickname \"The Wall\") and drama. He eventually dropped out of school to pursue an acting career.\n\nAfter a few stage gigs and a handful of made-for-TV movies, he scored a supporting role in the Rob Lowe hockey flick Youngblood (1986), which was filmed in Canada. Shortly after the production wrapped, Reeves packed his bags and headed for Hollywood. Reeves popped up on critics' radar with his performance in the dark adolescent drama, River's Edge (1986), and landed a supporting role in the Oscar-nominated Dangerous Liaisons (1988) with director Stephen Frears.\n\nHis first popular success was the role of totally rad dude Ted \"Theodore\" Logan in Bill & Ted's Excellent Adventure (1989). The wacky time-travel movie became something of a cultural phenomenon, and audiences would forever confuse Reeves's real-life persona with that of his doofy on-screen counterpart. He then joined the casts of Ron Howard's comedy, Parenthood (1989) and Lawrence Kasdan's I Love You to Death (1990).\n\nOver the next few years, Reeves tried to shake the Ted stigma with a series of highbrow projects. He played a slumming rich boy opposite River Phoenix's narcoleptic male hustler in My Own Private Idaho (1991), an unlucky lawyer who stumbles into the vampire's lair in Dracula (1992), and Shakespearean party-pooper Don John in Much Ado About Nothing (1993).\n\nIn 1994, the understated actor became a big-budget action star with the release of Speed (1994). Its success heralded an era of five years in which Reeves would alternate between small films, like Feeling Minnesota (1996) and The Last Time I Committed Suicide (1997), and big films like A Walk in the Clouds (1995) and The Devil's Advocate (1997). (There were a couple misfires, too: Johnny Mnemonic (1995) and Chain Reaction (1996).) After all this, Reeves did the unthinkable and passed on the Speed sequel, but he struck box-office gold again a few years later with the Wachowski siblings' cyberadventure, The Matrix (1999).\n\nNow a bonafide box-office star, Keanu would appear in a string of smaller films -- among them The Replacements (2000), The Watcher (2000), The Gift (2000), Sweet November (2001), and Hardball (2001) - before The Matrix Reloaded (2003) and The Matrix Revolutions (2003) were both released in 2003.\n\nSince the end of The Matrix trilogy, Keanu has divided his time between mainstream and indie fare, landing hits with Something's Gotta Give (2003), The Lake House (2006), and Street Kings (2008). He's kept Matrix fans satiated with films such as Constantine (2005), A Scanner Darkly (2006), and The Day the Earth Stood Still (2008). And he's waded back into art-house territory with Ellie Parker (2005), Thumbsucker (2005), The Private Lives of Pippa Lee (2009), and Henry's Crime (2010).\n\nMost recently, as post-production on the samurai epic 47 Ronin (2013) waged on, Keanu appeared in front of the camera in Side by Side (2012), a documentary on celluloid and digital filmmaking, which he also produced. He also directed another Asian-influenced project, Man of Tai Chi (2013).\n\nIn 2014, Keanu played the title role in the action revenge film John Wick (2014), which became popular with critics and audiences alike. He reprised the role in John Wick: Chapter 2 (2017), taking the now-iconic character to a better opening weekend and even more enthusiastic reviews than the first go-around."}]}, {"@type": "imdb.api.name.bio", "akas": ["Dianna Argon", "The Cast of Glee"], "id": "/name/nm1872698/", "image": {"height": 6780, "id": "/name/nm1872698/images/rm4094171649", "url": "https://m.media-amazon.com/images/M/MV5BZWNjYWYxMjgtYzI5OS00Zjk4LThlYWMtOWQwYWJlZDhhYWVjXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_.jpg", "width": 4526}, "legacyNameText": "Agron, Dianna", "name": "Dianna Agron", "birthDate": "1986-04-30", "birthPlace": "Savannah, Georgia, USA", "gender": "female", "heightCentimeters": 166.37, "realName": "Dianna Elise Agron", "spouses": [{"attributes": "(divorced)", "fromDate": "2016-10-15", "id": "/name/nm4963520/", "name": "'Country' Winston Marshall", "toDate": "2020"}], "trademarks": ["Her nasal accent"], "miniBios": [{"author": "Anonymous", "id": "/name/nm1872698/bio/mb0116345", "language": "en", "text": "Dianna Elise Agron was born in Savannah, Georgia to Mary and Ronald Agron and grew up in a middle-class family in Savannah before moving to Texas and, later, San Francisco, California, because her father was a general manager for Hyatt. Dianna and her brother Jason were raised Jewish and she graduated from Burlingame High School with honors.\n\nWhile Dianna was growing up, she spent much of her time performing. She began dancing at age three, focusing mainly on jazz and ballet; she later began hip-hop dancing. She also appeared in many local musical-theater productions.\n\nAfter graduating from high school, Dianna decided to pursue acting as a career and began appearing in commercials and television shows including CSI: NY (2004), Numb3rs (2005), Veronica Mars (2004), and Heroes (2006). In 2009, she won the role of high-school cheerleader Quinn Fabray on the FOX television series Glee (2009). Since the hit television show's premiere on May 19th, 2009, she and her castmates have received critical praise for well as her fellow cast mates, have received critical praise for their incredible work. In addition to her work on, Glee (2009), Dianna has ventured into films, such as Burlesque (2010), where she had the opportunity to star alongside Christina Aguilera, Cher, and Stanley Tucci, and the action thriller I Am Number Four (2011). There is no doubt that her beautiful talent will shine for years to come."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0004748/", "image": {"height": 735, "id": "/name/nm0004748/images/rm3417193729", "url": "https://m.media-amazon.com/images/M/MV5BOTE3ZjAxOWQtMzc2Ny00ZjU0LWJkMDMtNmQ5ZjJlNzc1NTFlXkEyXkFqcGdeQXVyMjMwNTM1OQ@@._V1_.jpg", "width": 585}, "legacyNameText": "Benz, Julie", "name": "Julie Benz", "birthDate": "1972-05-01", "birthPlace": "Pittsburgh, Pennsylvania, USA", "gender": "female", "heightCentimeters": 162.56, "spouses": [{"current": true, "fromDate": "2012-05-05", "id": "/name/nm4505936/", "name": "Rich Orosco"}, {"attributes": "(divorced)", "fromDate": "1998-05-30", "id": "/name/nm0440885/", "name": "John Kassir", "toDate": "2008-05"}], "trademarks": ["Often plays women who have suffered traumas or losses"], "miniBios": [{"author": "matt-282 and Robert Harris", "id": "/name/nm0004748/bio/mb0002907", "language": "en", "text": "Julie Benz was born in Pittsburgh, Pennsylvania, USA on May 1, 1972. Julie's father is a Pittsburgh surgeon and her mother is a figure skater. The family settled in nearby Murrysville, when Julie was two, and she started ice skating at age three. She competed in the 1988 U.S. Championships in junior ice dancing with her partner David Schilling, coming in 13th. Her older brother and sister, Jeffrey and Jennifer, were in the 1987 U.S. Junior Champions in ice dancing and competed internationally. When Julie was 14, she had a bad stress fracture and had to take time off.\n\nBy 1989, with her figure skating career over, Julie turned to acting and got involved in the local theater where she got a role in the play \"Street Law\". Her first movie role was a small, credited, speaking part on in the Black Cat episode in the Dario Argento/George A. Romero co-direction horror flick, Two Evil Eyes (1990) playing in one scene alongside Harvey Keitel. A year later, she got a role on a TV show called Hi Honey, I'm Home (1991).\n\nAfter graduating from high school, Julie entered New York University to study acting there. After graduation, Julie moved to Los Angeles to further pursue her career and landed some small roles in movies and TV shows including a guest appearance on Married... with Children (1987) and in the Aaron Spelling TV pilot Crosstown Traffic (1995).\n\nIn 1996, Julie auditioned for the role of \"Buffy\" in the series Buffy the Vampire Slayer (1997), but lost out to Sarah Michelle Gellar. However, she was offered a small role as a vampire girl in which she did such a good job that her part was expanded to a few more episodes in playing the vampire \"Darla\". With that, Julie Benz's career had finally taken off. She reprised her role as \"Darla\" in the Buffy spin-off series Angel (1999) for two years and has had several small roles in various film productions. She also had a small, but memorable, role playing a receptionist in the movie As Good as It Gets (1997).\n\nEven after her role on Angel (1999) wrapped up, Julie continued to find work on television in playing many guest staring roles in numerous popular TV shows from CSI: Crime Scene Investigation (2000), to Supernatural (2005), to playing the lead and supporting roles in various made-for-TV movies. She landed another notable role on the TV-cable series Dexter (2006) playing \"Rita\", a troubled divorcée and lover of the title character played by Michael C. Hall. Benz played a leading role in the TV series No Ordinary Family (2010) playing Stephanie Powell along with actors Michael Chiklis, Kay Panabaker, Jimmy Bennett, Autumn Reeser, Romany Malco, and Stephen Collins.\n\nIn 2013, she had the starring role in the sci-fi / fantasy breakout hit show Defiance (2013)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm1408543/", "image": {"height": 1600, "id": "/name/nm1408543/images/rm66657281", "url": "https://m.media-amazon.com/images/M/MV5BNGI0YjQ5MzktZmI1My00YWU2LThjNmUtNTU3YmMyYTIwNjY4XkEyXkFqcGdeQXVyMjI3NzY0NTA@._V1_.jpg", "width": 1064}, "legacyNameText": "Gyasi, David", "name": "David Gyasi", "birthPlace": "Hammersmith, London, England, UK", "gender": "male", "heightCentimeters": 177.8, "miniBios": [{"id": "/name/nm1408543/bio/bo429731345", "language": "en", "text": "David Gyasi was born in Hammersmith, London, England, UK. He is an actor and producer, known for Interstellar (2014), Cloud Atlas (2012) and Annihilation (2018)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Sarah Chalk"], "id": "/name/nm0149950/", "image": {"height": 400, "id": "/name/nm0149950/images/rm1641384448", "url": "https://m.media-amazon.com/images/M/MV5BMjQyNjg4NDI4NV5BMl5BanBnXkFtZTcwOTAzOTUxMg@@._V1_.jpg", "width": 286}, "legacyNameText": "Chalke, Sarah", "name": "Sarah Chalke", "birthDate": "1976-08-27", "birthPlace": "Ottawa, Ontario, Canada", "gender": "female", "heightCentimeters": 172.72, "nicknames": ["Chalky"], "realName": "Sarah Louise Christine Chalke", "miniBios": [{"author": "Anonymous", "id": "/name/nm0149950/bio/mb0006184", "language": "en", "text": "Sarah Chalke was born on 27 August 1976 in Ottawa, Ontario, Canada. Her parents are Angie Chalke and Doug Chalke. She is the middle child, having one older sister, Natasha Chalke, and one younger, Piper Chalke. Sarah made her acting debut in a made-for-TV movie, City Boy (1992). In 1993, after her first film, she auditioned for the role of \"Becky\" on the TV series Roseanne (1988). The show was looking for a replacement after Alicia Goranson quit the show to go to college. Sarah graduated from high school in 1995, while shooting the 1994-1995 season of Roseanne (1988). Also, in 1994, Sarah co-starred in the film, Ernest Goes to School (1994), along with Jim Varney. Then, in 1996, she starred in 2 films, including Robin of Locksley (1996), and also Stand Against Fear (1996), where she played a cheerleader, \"Krista Wilson\". In 1998, a year after Roseanne (1988) ended, Sarah was asked to act in a show called Nothing Too Good for a Cowboy (1998). The show was based on the TV movie with the same name, Nothing Too Good for a Cowboy (1998), which Sarah was also in."}]}, {"@type": "imdb.api.name.bio", "akas": ["Katherine M. Heigl"], "id": "/name/nm0001337/", "image": {"height": 400, "id": "/name/nm0001337/images/rm3255404544", "url": "https://m.media-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1_.jpg", "width": 271}, "legacyNameText": "Heigl, Katherine", "name": "Katherine Heigl", "birthDate": "1978-11-24", "birthPlace": "Washington, District of Columbia, USA", "gender": "female", "heightCentimeters": 175.26, "nicknames": ["Katie"], "realName": "Katherine Marie Heigl", "spouses": [{"attributes": "(3 children)", "current": true, "fromDate": "2007-12-23", "id": "/name/nm1496236/", "name": "Josh Kelley"}], "miniBios": [{"author": "Jude@fanforum.com", "id": "/name/nm0001337/bio/mb0015751", "language": "en", "text": "Katherine Marie Heigl was born on November 24, 1978 in Washington, D.C., to Nancy Heigl (née Engelhardt), a personnel manager, and Paul Heigl, an accountant and executive. Her father is of German/Swiss-German and Irish descent, and her mother is of German ancestry. A short time after her birth, the family moved to New Canaan, Connecticut, where Katherine was to spend the majority of her childhood; the youngest member of her family, Katherine--or \"Katie\" as she is nicknamed--has two elder siblings, John and Meg. Tragically, her older brother Jason died in 1986 of brain injuries suffered in a car accident, after being thrown from the back of a pickup truck. When doctors determined he was brain-dead, the family made the difficult decision to donate his organs. Not only did this painful chapter give Katherine a greater perspective and appreciation for life, but it motivated her to use her celebrity to promote the importance of organ donation.\n\nKatherine was first thrust into the limelight as a child model. An aunt, visiting the family in New Canaan, took a number of photographs of Katherine, then aged nine, in a series of poses to advertise a hair care product she had invented. Upon returning to New York, with permission from Katherine's parents, she sent the photos to a number of modeling agencies. Within a few weeks, Katherine had been signed to Wilhelmina, a renowned international modeling agency. Almost immediately, she made her debut in a magazine advertisement and soon followed this with an inaugural television appearance in a national commercial for Cheerios breakfast cereal.\n\nFollowing a number of commercials and modeling assignments for Sears and Lord & Taylor, she made her big-screen debut in That Night (1992), which starred Juliette Lewis and C. Thomas Howell. It was then that she realized that acting rather than modeling was her passion. In 1993, Katherine appeared in Steven Soderbergh's critically-acclaimed Depression-era drama, King of the Hill (1993), before landing her first leading role as a rebellious teenager, alongside Gérard Depardieu, in My Father the Hero (1994). During this time, Katherine continued to attend New Canaan High School, balancing her academic studies with work on films and modeling, which she undertook during holidays, vacations and weekends.\n\nIn 1995, she played \"Sarah Ryback\", the niece of Steven Seagal's character, in Under Siege 2: Dark Territory (1995), which was her \"debut\" in the action film genre. Acting was now becoming a stronger focus for Katherine, although she still modeled extensively, appearing regularly in magazines such as \"Seventeen\". Television appearances on The Tonight Show with Jay Leno (1992) and Late Night with Conan O'Brien (1993) soon followed, before she took the lead role in Disney's Wish Upon a Star (1996) in 1996. It was also during that year that Katherine's parents divorced and, following her graduation from high school in 1997, she moved with her mother into a four-bedroom house in Los Angeles' Malibu Canyon area. This enabled her to focus upon acting with the guidance and support of her mother, who now managed her career.\n\nIn 1997, Katherine portrayed \"Taffy Entwhistle\", Rita Hayworth's stand-in, in Stand-ins (1997) and was also cast as the beauteous \"Princess Ilene\" in the European production, Prince Valiant (1997). She then made her made-for-TV movie debut, co-starring with Peter Fonda in a re-working of the classic Shakespearean play, The Tempest (1998), updated with an American Civil War theme. In this film, she played \"Miranda Prosper\", a young woman torn between her love for both her father and a Union soldier. Bug Buster (1998) and Bride of Chucky (1998) represented a venture into the horror genre for Katherine. While both films could be described as rather tongue-in-cheek despite their gory emphases, Bride of Chucky (1998) was the better received, both critically and commercially.\n\nIn 1999, Katherine decided to branch out into series television when she accepted the role of the haughty, yet vulnerable, \"Isabel Evans\", on Roswell (1999), a show that blended teen angst with sci-fi drama. Though she had never planned to embark on a career in television, the role of Isabel, a teenager with a secret life, was an offer she found impossible to refuse. In the series, Isabel, her brother Max (Jason Behr) and their friend Michael (Brendan Fehr) are aliens passing as humans in Roswell, New Mexico, as they desperately try to hide the truth from government agencies, the people of Roswell and even their own adopted families. To publicize her role on the show, Katherine graced the covers of magazines such as \"TV Guide\", \"Maxim\" and \"Teen\" and was interviewed on Later (1994) and The Late Late Show with Craig Kilborn (1999). Along with her mother Nancy, she also appeared in an episode of the Sci-Fi TV talk show, Crossing Over with John Edward (2001), during which she spoke with John Edward, a psychic medium, about her late brother, Jason. During the three years Roswell (1999) was in production, Katherine found time to work on several movies. 100 Girls (2000), an independent film released in 2001, is the story of a college freshman who meets the girl of his dreams in an elevator during a blackout, and spends the rest of the movie trying to find her again. Her cameo role is that of Arlene, the competitive tomboy. The second film, Valentine (2001), a horror film starring David Boreanaz and Denise Richards, appeared in U.S. theaters on February 2, 2001. In this movie, which is based upon the 1996 novel by Tom Savage, Katherine plays \"Shelley\", a medical student who meets a sudden demise.\n\nIn the spring of 2001, Katherine accepted a role in NBC's Critical Assembly (2002), a two-hour original television thriller. Katherine and Kerr Smith (Dawson's Creek (1998)) co-starred as brilliant and politically concerned college students who build a nuclear device to illustrate the need for a change in national priorities, but are betrayed by a fellow student when the bomb ends up in the hands of a terrorist. Unfortunately, the telefilm, directed by Eric Laneuville, written by Tom Vaughan, and based on the best-seller \"The Seventh Power\" by James Mills, was shelved when its storyline was deemed too close for comfort to the events of September 11, 2001. It was eventually broadcast in 2003. Since the cancellation of Roswell (1999) in the spring of 2002, Katherine has been busy with various projects, including an appearance on UPN's update of the classic television series, The Twilight Zone (2002). That episode, entitled Cradle of Darkness (2002), aired on October 2, 2002, and featured Katherine in the role of a woman who goes back in time to stop one of the most notorious murders in history. In addition, she completed a movie, Descendant (2003), a psychological thriller inspired by Edgar Allan Poe's \"The Fall of the House of Usher\". She has also starred as \"Romy\" in ABC/Touchstone's two-hour telepic, Romy and Michele: In the Beginning (2005), a prequel to the 1997 feature, Romy and Michele's High School Reunion (1997). During the summer of 2002, Katherine made a major decision in the direction of her career when she signed on for representation in all areas with the William Morris Agency, one of the biggest and most prestigious agencies in the entertainment industry. She is now being represented by Norman Aladjem at Paradigm Agency and being managed by Nancy Heigl and Stephanie Simon and Jason Newman at Untitled Entertainment."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "II", "id": "/name/nm1556270/", "image": {"height": 2048, "id": "/name/nm1556270/images/rm2195477760", "url": "https://m.media-amazon.com/images/M/MV5BMjE5ODA0MjI1OF5BMl5BanBnXkFtZTgwNDE0MDQ5NDM@._V1_.jpg", "width": 1334}, "legacyNameText": "Baumgartner, Christine (II)", "name": "Christine Baumgartner", "birthDate": "1974-03-04", "gender": "female", "realName": "Christine Anne Baumgartner", "spouses": [{"attributes": "(filed for divorce) (3 children)", "current": true, "fromDate": "2004-09-25", "id": "/name/nm0000126/", "name": "Kevin Costner"}], "miniBios": [{"id": "/name/nm1556270/bio/bo418769404", "language": "en", "text": "Christine Baumgartner was born on March 4, 1974. She has been married to Kevin Costner since September 25, 2004. They have three children."}]}, {"@type": "imdb.api.name.bio", "akas": ["Michele Pfeiffer"], "id": "/name/nm0000201/", "image": {"height": 400, "id": "/name/nm0000201/images/rm892246528", "url": "https://m.media-amazon.com/images/M/MV5BMTUzNjI0Njc5NF5BMl5BanBnXkFtZTYwOTM2MjYz._V1_.jpg", "width": 266}, "legacyNameText": "Pfeiffer, Michelle", "name": "Michelle Pfeiffer", "birthDate": "1958-04-29", "birthPlace": "Santa Ana, California, USA", "gender": "female", "heightCentimeters": 171.45, "realName": "Michelle Marie Pfeiffer", "spouses": [{"attributes": "(2 children)", "current": true, "fromDate": "1993-11-13", "id": "/name/nm0005082/", "name": "David E. Kelley"}, {"attributes": "(divorced)", "fromDate": "1981-10-05", "id": "/name/nm0005022/", "name": "Peter Horton", "toDate": "1988-10"}], "miniBios": [{"author": "Natica Jackson <natica@cris.com>", "id": "/name/nm0000201/bio/mb0028036", "language": "en", "text": "Michelle Pfeiffer was born in Santa Ana, California to Dick and Donna Pfeiffer. She has an older brother and two younger sisters - Dedee Pfeiffer, and Lori Pfeiffer, who both dabbled in acting and modeling but decided against making it their lives' work. She graduated from Fountain Valley High School in 1976, and attended one year at the Golden West College, where she studied to become a court reporter. But it was while working as a supermarket checker at Vons, a large Southern California grocery chain, that she realized her true calling. She was married to actor/director Peter Horton (\"Gary\" of Thirtysomething (1987)) in 1981. They were later divorced, and she then had a three year relationship with actor Fisher Stevens. When that didn't work out, Pfeiffer decided she didn't want to wait any longer before having her own family, and in March of 1993, she adopted a baby girl, Claudia Rose. On November 13th of the same year, she married lawyer-turned-writer/producer David E. Kelley, creator of Picket Fences (1992), Chicago Hope (1994), The Practice (1997), and Boston Public (2000). On August 5, 1994 their son, John Henry was born."}]}, {"@type": "imdb.api.name.bio", "akas": ["Hannelore Auer-Auersperg", "Hannelore Auer-Kramm", "Hannelore Auersperg", "Hannelore", "Hannelore Kramm", "Hannelore von Auersperg"], "id": "/name/nm0041676/", "image": {"height": 843, "id": "/name/nm0041676/images/rm4060696576", "url": "https://m.media-amazon.com/images/M/MV5BOWFmMWI0NGItMzJkMy00NzU5LWEwNTgtNWIxYmRkYjMwMmUwXkEyXkFqcGdeQXVyMTcyODY2NDQ@._V1_.jpg", "width": 642}, "legacyNameText": "Auer, Hannelore", "name": "Hannelore Auer", "birthDate": "1942-05-30", "birthPlace": "Linz, Austria", "gender": "female", "spouses": [{"current": true, "fromDate": "1979-09-03", "id": "/name/nm0374430/", "name": "Heino"}, {"fromDate": "1968", "name": "Alfred Prinz von Auersperg", "toDate": "1979"}], "miniBios": [{"id": "/name/nm0041676/bio/bo419167049", "language": "en", "text": "Hannelore Auer was born on May 30, 1942 in Linz, Austria. She is an actress, known for Holiday in St. Tropez (1964), Hotel der toten Gäste (1965) and Übermut im Salzkammergut (1963). She has been married to Heino since September 3, 1979. She was previously married to Alfred Prinz von Auersperg."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm6609666/", "image": {"height": 2048, "id": "/name/nm6609666/images/rm996668672", "url": "https://m.media-amazon.com/images/M/MV5BMTYzOTA0MzU0OV5BMl5BanBnXkFtZTgwMzgxMDM5NTE@._V1_.jpg", "width": 1631}, "legacyNameText": "Lourd, Billie", "name": "Billie Lourd", "birthDate": "1992-07-17", "birthPlace": "Los Angeles, California, USA", "gender": "female", "heightCentimeters": 154.94, "nicknames": ["Billy"], "realName": "Billie Catherine Lourd", "spouses": [{"attributes": "(2 children)", "current": true, "fromDate": "2022-03-12", "id": "/name/nm1032395/", "name": "Austen Rydell"}], "miniBios": [{"author": "Bonitao", "id": "/name/nm6609666/bio/mb0958796", "language": "en", "text": "Billie Lourd is an American actress. She is known for starring as Chanel #3 in the Fox horror comedy series Scream Queens (2015-2016) and for her roles in the FX horror anthology series American Horror Story (2017-present). She also appears as Lieutenant Connix in the Star Wars sequel trilogy (2015-2019)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0297578/", "image": {"height": 2048, "id": "/name/nm0297578/images/rm2093419008", "url": "https://m.media-amazon.com/images/M/MV5BNDAyOTY4MzkxNF5BMl5BanBnXkFtZTgwMjIxNjA1OTE@._V1_.jpg", "width": 1416}, "legacyNameText": "Fugit, Patrick", "name": "Patrick Fugit", "birthDate": "1982-10-27", "birthPlace": "Salt Lake City, Utah, USA", "gender": "male", "heightCentimeters": 182.88, "realName": "Patrick Raymond Fugit", "trademarks": ["Frequently works with Cameron Crowe"], "miniBios": [{"author": "Jen", "id": "/name/nm0297578/bio/mb0012485", "language": "en", "text": "Patrick Fugit was born in Salt Lake City, Utah, to Jan Clark-Fugit, a dance teacher, and Bruce Fugit, an electrical engineer. He has two siblings. He began acting in a summer Theater program through the University of Utah at eleven. He continued on through high school and regional productions. He enjoys biking and skating. In 2002, he was featured in Seventeen magazine, along with Alison Lohman, his co-star from White Oleander (2002)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Dania"], "id": "/name/nm1268158/", "image": {"height": 360, "id": "/name/nm1268158/images/rm4245323008", "url": "https://m.media-amazon.com/images/M/MV5BMjU0OTIyNzQ3MF5BMl5BanBnXkFtZTgwNzQwODU1NjM@._V1_.jpg", "width": 270}, "legacyNameText": "Ramirez, Dania", "name": "Dania Ramirez", "birthDate": "1979-11-08", "birthPlace": "Santo Domingo, Dominican Republic", "gender": "female", "heightCentimeters": 163.83, "realName": "Dania Jissel Ramirez", "spouses": [{"attributes": "(2 children)", "current": true, "fromDate": "2013-02-16", "id": "/name/nm0484314/", "name": "Bev Land"}], "miniBios": [{"author": "Kad", "id": "/name/nm1268158/bio/mb0168084", "language": "en", "text": "Dania is a Latin American actress born in the Dominican Republic. She grew up, living with her grandmother, in a poor household. Her parents left for the United States, when she was 6-months old, and she finally joined them in New York when she was age 10.\n\nShe knew from a young age that she wanted to act. She was discovered by a model scout and cast in a soda commercial. She attended the Actor's workshop in New York City and moved to Los Angeles to pursue her acting career.\n\nHer first job was Jay-Z's girlfriend in his music video, Streets Is Watching (1998). She went on to appear in high profile TV shows The Sopranos (1999), Entourage (2004) and Heroes (2006). She has also appeared in films and, in 2012, she was cast in American Reunion (2012). She is currently starring on Lifetime's Devious Maids (2013) as 'Rosie Falta'."}]}, {"@type": "imdb.api.name.bio", "akas": ["Tomu Kurûzu"], "id": "/name/nm0000129/", "image": {"height": 5122, "id": "/name/nm0000129/images/rm3157463809", "url": "https://m.media-amazon.com/images/M/MV5BYTFlOTdjMjgtNmY0ZC00MDgxLThjNmEtZGIxZTQyZDdkMTRjXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg", "width": 3795}, "legacyNameText": "Cruise, Tom", "name": "Tom Cruise", "birthDate": "1962-07-03", "birthPlace": "Syracuse, New York, USA", "gender": "male", "heightCentimeters": 170.18, "nicknames": ["TC"], "realName": "Thomas Cruise Mapother IV", "spouses": [{"attributes": "(divorced) (1 child)", "fromDate": "2006-11-18", "id": "/name/nm0005017/", "name": "Katie Holmes", "toDate": "2012-08-20"}, {"attributes": "(divorced) (2 children)", "fromDate": "1990-12-24", "id": "/name/nm0000173/", "name": "Nicole Kidman", "toDate": "2001-08-08"}, {"attributes": "(divorced)", "fromDate": "1987-05-09", "id": "/name/nm0000211/", "name": "Mimi Rogers", "toDate": "1990-02-04"}], "trademarks": ["Often plays romantic leading men with an edge", "Often plays characters caught up in extraordinary circumstances", "Frequently plays intelligent yet laidback and likeable characters", "Beaming smile and intense eye contact", "Boundless off-stage energy", "Many of his films feature scenes of him running", "Known for doing many of his own stunts, even exceptionally dangerous ones"], "miniBios": [{"author": "Tom McDonough, Grant failor", "id": "/name/nm0000129/bio/mb0007903", "language": "en", "text": "In 1976, if you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not too distant future he would be Tom Cruise, one of the top 100 movie stars of all time, he would have probably grinned and told you that his ambition was to join the priesthood. Nonetheless, this sensitive, deeply religious youngster who was born in 1962 in Syracuse, New York, was destined to become one of the highest paid and most sought after actors in screen history.\n\nTom is the only son (among four children) of nomadic parents, Mary Lee (Pfeiffer), a special education teacher, and Thomas Cruise Mapother III, an electrical engineer. His parents were both from Louisville, Kentucky, and he has German, Irish, and English ancestry. Young Tom spent his boyhood always on the move, and by the time he was 14 he had attended 15 different schools in the U.S. and Canada. He finally settled in Glen Ridge, New Jersey with his mother and her new husband. While in high school, Tom wanted to become a priest but pretty soon he developed an interest in acting and abandoned his plans of becoming a priest, dropped out of school, and at age 18 headed for New York and a possible acting career. The next 15 years of his life are the stuff of legends. He made his film debut with a small part in Endless Love (1981) and from the outset exhibited an undeniable box office appeal to both male and female audiences.\n\nWith handsome movie star looks and a charismatic smile, within 5 years Tom Cruise was starring in some of the top-grossing films of the 1980s including Top Gun (1986); The Color of Money (1986), Rain Man (1988) and Born on the Fourth of July (1989). By the 1990s he was one of the highest-paid actors in the world earning an average 15 million dollars a picture in such blockbuster hits as Interview with the Vampire: The Vampire Chronicles (1994), Mission: Impossible (1996) and Jerry Maguire (1996), for which he received an Academy Award Nomination for best actor. Tom Cruise's biggest franchise, Mission Impossible, has also earned a total of 3 billion dollars worldwide. Tom Cruise has also shown lots of interest in producing, with his biggest producer credits being the Mission Impossible franchise.\n\nIn 1990 he renounced his devout Catholic beliefs and embraced The Church of Scientology claiming that Scientology teachings had cured him of the dyslexia that had plagued him all of his life. A kind and thoughtful man well known for his compassion and generosity, Tom Cruise is one of the best liked members of the movie community. He was married to actress Nicole Kidman until 2001. Thomas Cruise Mapother IV has indeed come a long way from the lonely wanderings of his youth to become one of the biggest movie stars ever."}]}, {"@type": "imdb.api.name.bio", "akas": ["Timothee Chalamet", "Timothy Chalamet", "Lil Timmy Tim"], "id": "/name/nm3154303/", "image": {"height": 2265, "id": "/name/nm3154303/images/rm4082101761", "url": "https://m.media-amazon.com/images/M/MV5BNThiOTM4NTAtMDczNy00YzlkLWJhNTEtZTZhNDVmYzlkZWI0XkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_.jpg", "width": 3000}, "legacyNameText": "Chalamet, Timothée", "name": "Timothée Chalamet", "birthDate": "1995-12-27", "birthPlace": "New York City, New York, USA", "gender": "male", "heightCentimeters": 177.8, "nicknames": ["Timo", "Timmy", "Tim", "Timmy T", "Lil Timmy Tim"], "realName": "Timothée Hal Chalamet", "trademarks": ["Chiseled jawline", "Youthful, boyish face"], "miniBios": [{"author": "Tolfe", "id": "/name/nm3154303/bio/mb0488751", "language": "en", "text": "Timothée Hal Chalamet was born in Manhattan, to Nicole Flender, a real estate broker and dancer, and Marc Chalamet, a UNICEF editor. His mother, who is from New York, is Jewish, of Russian Jewish and Austrian Jewish descent. His father, who is from Nîmes, France, is of French and English ancestry. He is the brother of actress Pauline Chalamet, a nephew of director Rodman Flender, and a grandson of screenwriter Harold Flender.\n\nHe grew up in an artistic family, appearing in commercials and the New York theatre scene, and attending the LaGuardia High School of Music, Art and Performing Arts, where his classmate and friend was actor Ansel Elgort (the two later received their first Golden Globe nominations in the same year, 2017). For a time, Timothée also attended Columbia University.\n\nHe made his film debut in 2014, as a high school student in Jason Reitman's Men, Women & Children (2014) and Matthew McConaughey's character's teenage son in Interstellar (2014). He subsequently had sizable roles in several indie films, playing the younger version of writer Stephen Elliott in The Adderall Diaries (2015), the male lead, Zac, in the drama One and Two (2015), and Billy in the road trip drama Miss Stevens (2016). On stage, he has appeared in the plays The Talls, by Anna Kerrigan, and John Patrick Shanley's autobiographical Prodigal Son, while on television, he has had a minor role in the film Loving Leah (2009), a big part in Law & Order (1990), and meatier roles on the shows Royal Pains (2009) and Homeland (2011), among other work.\n\nHe broke out in 2017, appearing in notable supporting roles, as a soldier in the western Hostiles (2017) and a high school crush of the title character in Lady Bird (2017), and in a leading role as Elio, an Italian Jewish seventeen year-old who romances his father's older assistant, played by Armie Hammer, in the Luca Guadagnino drama Call Me by Your Name (2017). Timothée's role as Elio received significant critical acclaim, and he was nominated for the Academy Award for Best Actor, and the Golden Globe Award for Best Actor, Drama, and won many critics' groups' awards for Best Actor of the Year.\n\nIn 2018, he starred as Nic Sheff, who suffers from substance abuse problems, in the drama Beautiful Boy (2018). In 2019, he will headline the Woody Allen comedy A Rainy Day in New York (2019), with Selena Gomez, play Henry V of England, King from 1413 to 1422, in the historical drama The King (2019), and embody love interest Laurie in Greta Gerwig's take on Little Women (2019)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Zendaya Coleman"], "id": "/name/nm3918035/", "image": {"height": 1040, "id": "/name/nm3918035/images/rm1855008256", "url": "https://m.media-amazon.com/images/M/MV5BMjAxZTk4NDAtYjI3Mi00OTk3LTg0NDEtNWFlNzE5NDM5MWM1XkEyXkFqcGdeQXVyOTI3MjYwOQ@@._V1_.jpg", "width": 780}, "legacyNameText": "Zendaya", "name": "Zendaya", "birthDate": "1996-09-01", "birthPlace": "Oakland, California, USA", "gender": "female", "heightCentimeters": 178.0, "nicknames": ["Daya", "Z", "Marie"], "realName": "Zendaya Maree Stoermer Coleman", "miniBios": [{"author": "Mymble Ansdal", "id": "/name/nm3918035/bio/mb0113745", "language": "en", "text": "Zendaya (which means \"to give thanks\" in the language of Shona) is an American actress and singer born in Oakland, California. She began her career appearing as a child model working for Macy's, Mervyns and Old Navy. She was a backup dancer before gaining prominence for her role as Rocky Blue on the Disney Channel sitcom Shake It Up (2010) which also includes Bella Thorne, Kenton Duty and Roshon Fegan. Zendaya was a contestant on the sixteenth season of the competition series Dancing with the Stars. She went on to produce and star as K.C. Cooper in the Disney Channel sitcom K.C. Undercover (2015) She made her film breakthrough in 2017, starring as Michelle \"MJ\" Jones in the Marvel Cinematic Universe superhero film Spider-Man: Homecoming (2017) and as Anne Wheeler in the musical drama film The Greatest Showman (2017) alongside actors such as Tom Holland, Hugh Jackman and Zac Efron. Besides acting, singing and dancing she is an ambassador for Convoy of Hope. She has written a book, launched her own clothing line (Daya by Zendaya) and proved herself to be a great role model for young girls all around the world."}]}, {"@type": "imdb.api.name.bio", "akas": ["Katy O'Brian"], "id": "/name/nm6884042/", "image": {"height": 1300, "id": "/name/nm6884042/images/rm1530651905", "url": "https://m.media-amazon.com/images/M/MV5BYWU4ZjQ5MzMtODU0ZC00MTBmLWI5ZWYtMWZhN2FiYTg2NmNjXkEyXkFqcGdeQXVyNTYyMDU5MzI@._V1_.jpg", "width": 867}, "legacyNameText": "O'Brian, Katy M.", "name": "Katy M. O'Brian", "gender": "female", "heightCentimeters": 170.18, "spouses": [{"current": true, "fromDate": "2020-07-22", "id": "/name/nm8116815/", "name": "Kylie Chi"}], "miniBios": [{"author": "Katy O'Brian", "id": "/name/nm6884042/bio/mb0315151", "language": "en", "text": "Katy O'Brian is an actress and martial artist from Indianapolis, IN. Her love for acting began with local theater productions at a young age, but her true passion was always in film. After working on several local projects, in 2016, Katy moved to Los Angeles to pursue a career in Film and Television. She landed her first TV role as a savior on AMC's, \"The Walking Dead\" followed by small parts on, \"Halt and Catch Fire\" and \"How to Get Away with Murder,\" before landing her first series regular role as George on the Syfy zombie apocalypse series, \"Z Nation.\"\n\nKaty continues to teach and train martial arts and loves to incorporate that passion into her acting career whenever possible."}]}, {"@type": "imdb.api.name.bio", "akas": ["Hayden Panettier", "Hayden Panitterie"], "id": "/name/nm0659363/", "image": {"height": 531, "id": "/name/nm0659363/images/rm2609283840", "url": "https://m.media-amazon.com/images/M/MV5BOTY2OTI1NzA0NV5BMl5BanBnXkFtZTcwOTczMTA2Mw@@._V1_.jpg", "width": 404}, "legacyNameText": "Panettiere, Hayden", "name": "Hayden Panettiere", "birthDate": "1989-08-21", "birthPlace": "Palisades, New York, USA", "gender": "female", "heightCentimeters": 152.4, "nicknames": ["Mushroom", "Hayd"], "realName": "Hayden Leslie Panettiere", "miniBios": [{"author": "multiple users", "id": "/name/nm0659363/bio/mb0027251", "language": "en", "text": "Hayden Lesley Panettiere was born on August 21, 1989 in Palisades, New York, to actress Lesley Vogel and fire department captain Skip Panettiere. Her younger brother is actor Jansen Panettiere. Her parents are both of half Italian descent, along with German and English. Her mother got her started in the business by doing commercials when she was just 11 months old. Then, at only 4 1/2, she was cast on the soap opera One Life to Live (1968), where she remained until 1997. Since then, she has gone on to appear in many feature films and TV movies. But she is probably best known in the United States for her role as \"Claire\" on the hit TV show, Heroes (2006).\n\nAs for movies, Hayden starred in Remember the Titans (2000) with Denzel Washington and Joe Somebody (2001) with Tim Allen. When Hayden isn't working, she enjoys singing, dancing, horseback riding, gymnastics, taking piano lessons, and swimming.\n\nShe has been involved with many animated movies, beginning with A Bug's Life (1998) as \"Dot\", later to follow was Dinosaur (2000), the video game Kingdom Hearts (2002), and The Mark of Kri (2002). Her next movie is Racing Stripes (2005), a partly animated film, but Hayden will star in the human role; other cast members include the voices of Whoopi Goldberg, Dustin Hoffman, Joshua Jackson and Mandy Moore.\n\nIn 2003, she joined the likes of Jessica Lange, Tom Wilkinson and Clancy Brown in Jane Anderson's Normal (2003), a film about a Midwestern husband and father who announces his plans to have a sex-change operation. In July of the same year, Hayden appeared in a John Guare play, \"Landscape of the Body\", for the Williamstown theater festival in Williamstown, Massachusetts."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "V", "id": "/name/nm3647676/", "image": {"height": 1072, "id": "/name/nm3647676/images/rm1377878785", "url": "https://m.media-amazon.com/images/M/MV5BZTA4ODAyYzktZWU0Ni00MmVmLWJlNWQtN2Y1NzZkZDlhZGE4XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg", "width": 712}, "legacyNameText": "Murphy, Charlie (V)", "name": "Charlie Murphy", "birthDate": "1987-11-30", "birthPlace": "Wexford, County Wexford, Ireland", "gender": "female", "heightCentimeters": 162.0, "miniBios": [{"author": "Alex H", "id": "/name/nm3647676/bio/mb0922116", "language": "en", "text": "Charlie Murphy is an award-winning actress, known for Peaky Blinders (2013-2022), Happy Valley (2014-2022) and '71 (2014). She features as series regular Makee in the Halo TV adaptation of the popular video game series for Paramount / Amblin.\n\nShe is the recipient of four IFTA awards as Best Actress for Peaky Blinders, Happy Valley, The Village and Love/Hate.\n\nShe is known for her role as Siobhán Delaney in the RTÉ drama series Love/Hate, for which she won Best TV Actress at the 2013 Irish Film and Television Award, and Best Actress in a Lead Role at the 2015 Irish Film and Television Awards.\n\nShe has extensive theatre credits including The Lieutenant of Inishmore by Martin McDonagh (West End), Disco Pigs by Enda Walsh (Young Vic, London), Arlington by Enda Walsh (Galway International Arts Festival, St Ann's Warehouse, New York), Our Few and Evil Days and Pygmalion (Abbey Theatre, Dublin) for which she won the Irish Theatre Award for Best Actress."}]}, {"@type": "imdb.api.name.bio", "akas": ["Stefania Lavie Owen", "Stefania Owen"], "id": "/name/nm2901344/", "image": {"height": 2048, "id": "/name/nm2901344/images/rm1405426944", "url": "https://m.media-amazon.com/images/M/MV5BNzQzNjQwMTg4M15BMl5BanBnXkFtZTgwMzI5MjQ2ODE@._V1_.jpg", "width": 1361}, "legacyNameText": "Owen, Stefania LaVie", "name": "Stefania LaVie Owen", "birthDate": "1997-12-15", "birthPlace": "Miami, Florida, USA", "gender": "female", "heightCentimeters": 160.02, "realName": "Stefania LaVie Owen", "miniBios": [{"author": "ahmetkozan", "id": "/name/nm2901344/bio/mb0673451", "language": "en", "text": "Stefania LaVie Owen is a New Zealand-American actress. She is known for her roles as Puddle Kadubic in the television series Running Wilde and as Dorrit Bradshaw in the teen drama television series The Carrie Diaries. She starred as Nicole Chance in the 2016-17 Hulu original psychological thriller, Chance.\n\nOwen was born on December 15, 1997 in Miami, Florida, to an American mother and a New Zealand father. Her mother is of Cuban descent. Owen moved to New Zealand at age four, settling in Pauatahanui, a village 30 km (19 mi) north of the capital city Wellington.\n\nOwen lives between New York City and Wellington. She attended Pauatahanui school, where she won the cup for performing arts, and which helped begin her career in acting. She also attended Chilton Saint James School, an all-girls private school, in Lower Hutt, Wellington. Her sisters Lolo and Carly accompanied her there as well, and she was involved in many school productions and dancing classes.\n\nOwen made her acting debut in the 2009 Peter Jackson film The Lovely Bones, playing Flora Hernandez. From 2010 to 2011, she played the character Puddle Kadubic in the Fox comedy series Running Wilde. Owen co-starred as Dorrit, Carrie Bradshaw's younger rebellious sister, in The CW's The Carrie Diaries, which premiered on January 14, 2013. She had a role in the 2015 comedy slasher film Krampus, directed by Michael Dougherty. She also portrayed Deedee in the drama film Coming Through the Rye."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0000379/", "image": {"height": 2048, "id": "/name/nm0000379/images/rm3769549824", "url": "https://m.media-amazon.com/images/M/MV5BMTQ3NzkwNzM1MV5BMl5BanBnXkFtZTgwMzE2MTQ3MjE@._V1_.jpg", "width": 1540}, "legacyNameText": "Dunst, Kirsten", "name": "Kirsten Dunst", "birthDate": "1982-04-30", "birthPlace": "Point Pleasant, New Jersey, USA", "gender": "female", "heightCentimeters": 166.4, "nicknames": ["Kiki"], "realName": "Kirsten Caroline Dunst", "spouses": [{"attributes": "(2 children)", "current": true, "fromDate": "2022-07-02", "id": "/name/nm0687146/", "name": "Jesse Plemons"}], "miniBios": [{"author": "TrendEkiD@aol.com", "id": "/name/nm0000379/bio/mb0010109", "language": "en", "text": "Kirsten Caroline Dunst is an American actress, who also holds German citizenship. She was born on April 30, 1982 in Point Pleasant, New Jersey, to parents Inez (née Rupprecht), who owned an art gallery, and Klaus Dunst, a medical services executive. She has a younger brother named Christian Dunst, born in 1987. Her father is German, from Hamburg, and her mother, who is American, is of German and Swedish descent.\n\nHer career began at the age of 3 when she started modeling and appearing in commercials. She made her feature film debut with an uncredited role at age 6 in the 'Oedipus Wrecks' segment of Woody Allen's 1989 film New York Stories (1989). She received her first film credit in The Bonfire of the Vanities (1990). Her family moved to Los Angeles in 1993, where her film career took off.\n\nIn 1994, she made her breakthrough performance in Interview with the Vampire: The Vampire Chronicles (1994), alongside such stars as Brad Pitt and Tom Cruise. Her performance earned her a Golden Globe nomination, the MTV Award for Best Breakthrough Performance and the Saturn Award for Best Young Actress. In 1995, she was named one of People Magazine's 50 Most Beautiful People. Over the next few years, she made a string of hit movies including Little Women (1994), Jumanji (1995) and Small Soldiers (1998).\n\nIn 2000, she received rave reviews for her role as \"Lux Lisbon\" in Sofia Coppola's independent film, The Virgin Suicides (1999) and proved her status as a leading actress in the comedy hit, Bring It On (2000). She also graduated from Notre Dame High School in Los Angeles in June of that year.\n\nIn 2002, she landed one of her best known roles as Peter Parker's love interest, Mary Jane Watson, in Spider-Man (2002). She continued her role in Spider-Man 2 (2004) and Spider-Man 3 (2007).\n\nShe went on to land roles in such films as Eternal Sunshine of the Spotless Mind (2004), the romantic comedy Wimbledon (2004), and in Cameron Crowe's Elizabethtown (2005). She also played the title character in Sofia Coppola's Marie Antoinette (2006).\n\nDunst won the Best Actress Award at the 2011 Cannes Film Festival for her performance as Justine in Lars von Trier's Melancholia (2011). In 2012, she appeared in Walter Salles' film adaptation of On the Road (2012) and the independent comedy Bachelorette (2012). She also has several films in production, including The Two Faces of January (2014).\n\nHer charity work includes designing a necklace to raise funds for the Elizabeth Glaser Pediatric AIDS Foundation as well as supporting various cancer charities."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm4025229/", "image": {"height": 6000, "id": "/name/nm4025229/images/rm536001025", "url": "https://m.media-amazon.com/images/M/MV5BNjk3NTA0MDctNTc0OC00NzY2LWEzZTItZTY2MjMwZGE1OTAyXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg", "width": 4000}, "legacyNameText": "Waterhouse, Suki", "name": "Suki Waterhouse", "birthDate": "1992-01-05", "birthPlace": "Hammersmith, London, England, UK", "gender": "female", "heightCentimeters": 172.7, "realName": "Alice Suki Waterhouse", "trademarks": ["Tall and slender figure", "Blonde hair and full, dark eyebrows", "Deep voice"], "miniBios": [{"author": "ahmetkozan and Wikipedia", "id": "/name/nm4025229/bio/mb0301466", "language": "en", "text": "Alice Suki Waterhouse (born 5 January 1992) is an English actress, model and entrepreneur.\n\nShe was born in Hammersmith, London and was raised in Chiswick, London, the daughter of Elizabeth, a cancer care nurse, and Norman Waterhouse, a plastic surgeon. She has a brother named Charlie, and two younger sisters Madeleine and Imogen Waterhouse, known as Immy, who is also a model.\n\nWaterhouse began her modeling career after being discovered in a pub in London when she was 16. She became the face of the Burberry Brit Rhythm Fragrance and later Amo by Salvatore Ferragamo. Waterhouse walked the runway for brands such as Balenciaga, Vivienne Westwood, and Burberry, where she opened at closed there SS'15 show, and Balenciaga. Waterhouse has appeared on the cover of British, Korean, Thai, Taiwanese and Turkish Vogue, Tatler, British and Korean Elle as well as Lucky, L'Officiel, American Marie Claire, French Grazia and 1883 Magazine. Waterhouse has also shot editorials for American, Chinese, Russian, and Japanese Vogue Love Magazine, American Elle, Velour, and Stylist Magazine among others. In April 2017, Waterhouse was chosen as the \"Mercier Muse\" for the makeup brand Laura Mercier.\n\nWaterhouse played Marlene in the sequel The Divergent Series: Insurgent (2015), based on the book of the same name. In March 2015 it was announced that Waterhouse had been cast in the role of Arlen in Ana Lily Amirpour's romance thriller film The Bad Batch. In June 2016, it was announced that Waterhouse will play Cecily of York in the Starz miniseries adaptation of the novel The White Princess by Philippa Gregory. She played the leading female role \"The Girl\", in the 2017 drama movie The Girl Who Invented Kissing, released April 29, 2017, written and directed by Tom Sierchio. Waterhouse cast in Sam Levinsons 'Assasination Nation' and in 2018 was cast as 'Ms Norman' in 'Detective Pikachu'. In 2019, she played 'Camille' in the Simon Barett directed 'Seance'. In 2020 she has been cast in Amazon's 'Daisy Jones and the Six' playing Karen Sirko.\n\nWaterhouse has a accessories company 'Pop and Suki'. Pop & Suki is a direct-to-consumer, millennial fashion accessories brand. which has been worn by Lady Gaga, Pippa Middleton and Emma Stone."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm3341156/", "image": {"height": 612, "id": "/name/nm3341156/images/rm3007807489", "url": "https://m.media-amazon.com/images/M/MV5BMWQ3YTQwZjktMjQ4NC00ZTA2LTk4YmEtMDVhOWUwM2YzMzZiXkEyXkFqcGdeQXVyMjIwNjgxMTU@._V1_.jpg", "width": 423}, "legacyNameText": "Balfour, Jodi", "name": "Jodi Balfour", "birthDate": "1987-10-29", "birthPlace": "Cape Town, South Africa", "gender": "female", "heightCentimeters": 170.18, "miniBios": [{"author": "MPR", "id": "/name/nm3341156/bio/mb0181447", "language": "en", "text": "Born and raised in South Africa, Jodi Balfour spent her early youth working in Cape Town's theatre and television industry. She graduated with a BA (hons) in Theatre & Performance from The University of Cape Town and, after her family moved to the west coast of Canada, began working internationally. Jodi now lives in Los Angeles, California."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2602672/", "image": {"height": 856, "id": "/name/nm2602672/images/rm1038389505", "url": "https://m.media-amazon.com/images/M/MV5BYjhjMjllMDctZjgzNC00YmQxLTg4MDgtNjFjZDE1MTVmOTI3XkEyXkFqcGdeQXVyMTI3OTAxNTU@._V1_.jpg", "width": 1280}, "legacyNameText": "Harlow, Eve", "name": "Eve Harlow", "birthDate": "1989-06-20", "birthPlace": "Moscow, RSFSR, USSR [now Russia]", "gender": "female", "heightCentimeters": 170.18, "miniBios": [{"id": "/name/nm2602672/bio/bo420901257", "language": "en", "text": "Eve Harlow was born on June 20, 1989 in Moscow, RSFSR, USSR [now Russia]. She is an actress, known for The 100 (2014), Next (2020) and Agents of S.H.I.E.L.D. (2013)."}]}, {"@type": "imdb.api.name.bio", "akas": ["guest star"], "disambiguation": "I", "id": "/name/nm0493159/", "image": {"height": 5096, "id": "/name/nm0493159/images/rm3928803841", "url": "https://m.media-amazon.com/images/M/MV5BNjUyNDUyYTQtMTg5NC00MjNjLTllZDgtNGI5ZjZiMjcxM2FmXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_.jpg", "width": 3504}, "legacyNameText": "Lawson, Ben (I)", "name": "Ben Lawson", "birthDate": "1980-02-06", "birthPlace": "Brisbane, Queensland, Australia", "gender": "male", "heightCentimeters": 187.96, "nicknames": ["Vegas"], "miniBios": [{"id": "/name/nm0493159/bio/bo423335054", "language": "en", "text": "Ben Lawson was born on February 6, 1980 in Brisbane, Queensland, Australia. He is an actor, known for No Strings Attached (2011), Don't Trust the B---- in Apartment 23 (2012) and Designated Survivor (2016)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Alexander Doetsch", "Alexandre Doetsch"], "id": "/name/nm4101853/", "image": {"height": 641, "id": "/name/nm4101853/images/rm940186369", "url": "https://m.media-amazon.com/images/M/MV5BOGUxYmJmNjQtNWVmMy00ZWIzLWE1NzUtZTg3ZWEwN2NmMThjXkEyXkFqcGdeQXVyMTI2Nzk2MjQ1._V1_.jpg", "width": 481}, "legacyNameText": "Dreymon, Alexander", "name": "Alexander Dreymon", "birthDate": "1983-02-07", "gender": "male", "heightCentimeters": 177.8, "miniBios": [{"author": "The 7th Scribe", "id": "/name/nm4101853/bio/mb0410070", "language": "en", "text": "Alexander Dreymon was born February 7, 1983 in Germany and grew up in France, Switzerland and the United States. He studied in Paris and trained three years at Drama Centre London. Dreymon worked on stage in London and Paris and made his screen debut alongside Doctor Who star Matt Smith in the British drama Christopher and His Kind (2011). He worked on several independent features in the United States and played Luke Ramsey in American Horror Story- Coven. Dreymon is portraying Uhtred of Bebbanburg in the historical sword-slinging drama The Last Kingdom on Netflix."}]}, {"@type": "imdb.api.name.bio", "akas": ["Debora Kinski"], "id": "/name/nm0135666/", "image": {"height": 2178, "id": "/name/nm0135666/images/rm3751821312", "url": "https://m.media-amazon.com/images/M/MV5BZGY2NTJjYTUtY2U5Yy00ZDc5LWE4ZTgtYmYyNGNkZWVkYmEyXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg", "width": 1428}, "legacyNameText": "Caprioglio, Debora", "name": "Debora Caprioglio", "birthDate": "1968-05-03", "birthPlace": "Mestre, Venice, Veneto, Italy", "gender": "female", "heightCentimeters": 165.1, "spouses": [{"current": true, "fromDate": "2008-09", "id": "/name/nm1132769/", "name": "Angelo Maresca"}], "miniBios": [{"id": "/name/nm0135666/bio/bo420414204", "language": "en", "text": "Debora Caprioglio was born on May 3, 1968 in Mestre, Venice, Veneto, Italy. She is an actress, known for Paprika (1991), Albergo Roma (1996) and Paganini (1989). She has been married to Angelo Maresca since September 2008."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm8087548/", "image": {"height": 793, "id": "/name/nm8087548/images/rm1803486209", "url": "https://m.media-amazon.com/images/M/MV5BNjI0NjFjMTMtMTVmOS00ZTRmLTlmMmQtZDI1MzA5OGQxZjdmXkEyXkFqcGdeQXVyNjU5MjQxNDE@._V1_.jpg", "width": 918}, "legacyNameText": "Convery, Christian", "name": "Christian Convery", "birthDate": "2009-11-10", "birthPlace": "Vancouver, British Columbia, Canada", "gender": "male", "miniBios": [{"author": "imPRint", "id": "/name/nm8087548/bio/mb0736475", "language": "en", "text": "At only 13 years old, Christian Convery has made a name for himself as a young actor working alongside some of the biggest names in Hollywood. Christian best known for his starring role in the popular dystopian sci-fi series Sweet Tooth on Netflix. The series, based on the popular comic book series and produced by Robert Downey Jr and Susan Downey, will return for season two on April 27, 2023.\n\nMost recently, Convery starred as 'Henry' in the Elizabeth Banks-directed comedy-horror-thriller epic Cocaine Bear alongside Keri Russell and O'Shea Jackson Jr. The Universal Pictures opened top of the box office when it released in theaters on February 24, 2023.\n\nLater this year, Christian is set to voice Paw Patrol: The Mighty Movie among an all-star cast which includes Kristen Bell, Jimmy Kimmel, James Marsden, Tyler Perry and Yara Shahidi. The sequel to children's film sensation is set to release in theaters on September 29, 2023.\n\nChristian's prior film/TV credits include: Highland Films' drama Tiger Rising (2022); Disney's Diary of a Wimpy Kid (2021); Paramount Pictures' Playing With Fire (2019); Amazon's critically-acclaimed film Beautiful Boy (2018) opposite Timothee Chalamet and Steve Carell; Netflix's Pup Academy (2019-2022); Disney's Descendants 3 (2019); Marvel's Venom (2018); Syfy's Van Helsing; CW's Supernatural (2016) and more.\n\nSince booking his first project at the age of six, Christian has showed no signs of slowing down, and is quickly garnering recognition as one of the more sought after child actors in Hollywood. He has won a Leo Award, five Young Artist Awards, six Young Entertainer Awards and nine Joey Awards in his hometown of Vancouver, Canada."}]}, {"@type": "imdb.api.name.bio", "akas": ["Yeun Sang-yeop", "Steven Yuen"], "id": "/name/nm3081796/", "image": {"height": 918, "id": "/name/nm3081796/images/rm961601792", "url": "https://m.media-amazon.com/images/M/MV5BNjE4YmU2MTItMjE0ZC00Y2YxLWJkYWMtOTNiMTc0MDFjNjJlXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg", "width": 660}, "legacyNameText": "Yeun, Steven", "name": "Steven Yeun", "birthDate": "1983-12-21", "birthPlace": "Seoul, South Korea", "gender": "male", "heightCentimeters": 172.4, "realName": "Sang-Yeop Yeun", "spouses": [{"attributes": "(2 children)", "current": true, "fromDate": "2016-12-03", "name": "Joana Pak"}], "miniBios": [{"author": "dy and Monica Choudhury", "id": "/name/nm3081796/bio/mb0115208", "language": "en", "text": "Steven Yeun was born in Seoul, South Korea, to June and Je Yeun. His family first immigrated to Canada and stayed there for one year, and then moved to the U.S. He has a brother named Brian. He began acting while at Kalamazoo College in Kalamazoo, MI, where he studied Psychology as a major (BS in Psychology, 2005). When he realized his love for acting he went to study theatre in college instead of med school. He was a member of Stir Friday Night, a sketch-comedy group made up of Asian-American performers, and was also a member of the Second City comedy troupe in Chicago. He earned roles on The Big Bang Theory (2007) (as Sebastian), in Jerry (2009) (as Chaz) and in different commercials for Best Buy, Apple, and Milky Way. He lives in L.A.\n\nSteven enjoys playing guitar. His parents own beauty supply stores in Detroit, MI."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2186865/", "image": {"height": 1024, "id": "/name/nm2186865/images/rm2741653760", "url": "https://m.media-amazon.com/images/M/MV5BNjllNmMzNWYtM2JjMS00ODg4LTk2OWEtYWE3OTc1NzMzMGM2XkEyXkFqcGdeQXVyNTc0NTQ3MQ@@._V1_.jpg", "width": 682}, "legacyNameText": "Chau, Hong", "name": "Hong Chau", "birthDate": "1979-06-25", "birthPlace": "Thailand", "gender": "female", "heightCentimeters": 154.9, "miniBios": [{"id": "/name/nm2186865/bio/bo420039893", "language": "en", "text": "Hong Chau was born on June 25, 1979 in Thailand. She is an actress and writer, known for The Whale (2022), Downsizing (2017) and The Menu (2022)."}]}, {"@type": "imdb.api.name.bio", "akas": ["Zoë Saldana", "Zoe Saldaña", "Zoë Saldaña"], "disambiguation": "I", "id": "/name/nm0757855/", "image": {"height": 2519, "id": "/name/nm0757855/images/rm365667585", "url": "https://m.media-amazon.com/images/M/MV5BMGNhNzdlMTAtZGE2NS00MmU5LWIzNmYtMjVlNThiNmU1ZWY4XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg", "width": 2244}, "legacyNameText": "Saldana, Zoe (I)", "name": "Zoe Saldana", "birthDate": "1978-06-19", "birthPlace": "Passaic, New Jersey, USA", "gender": "female", "heightCentimeters": 170.0, "realName": "Zoë Yadira Saldaña Nazario", "spouses": [{"attributes": "(3 children)", "current": true, "fromDate": "2013-06", "id": "/name/nm5939695/", "name": "Marco Perego Saldana"}], "trademarks": ["Often plays strong, dominant heroines"], "miniBios": [{"author": "LeoRMC", "id": "/name/nm0757855/bio/mb0031175", "language": "en", "text": "Zoe Saldana was born on June 19, 1978 in Passaic, New Jersey, to Asalia Nazario and Aridio Saldaña. Her father was Dominican and her mother is Puerto Rican. She was raised in Queens, New York. When she was 10 years old, she and her family moved to the Dominican Republic, where they would live for the next seven years. While living there, Zoe discovered a keen interest in performance dance and began her training at the prestigious ECOS Espacio de Danza Dance Academy where she learned ballet as well as other dance forms. Not only did her training provide an excellent outlet for the enthusiastic and energetic youngster, it would also prove to be a fortunate precursor for the start of her professional acting career. At age 17, Zoe and her family moved back to the United States where her love for dance followed and an interest in theater performance became stronger.\n\nShe began performing with the Faces theater troupe which put on plays geared to provide positive messages for teens with themes dealing with issues such as substance abuse and sex. These performances not only gave her valuable experience but also a source of great pride knowing that she was making a difference in the lives of young people like herself. While performing with the Faces troupe and also the New York Youth Theater, Zoe was recruited for a talent agency and her dance training years before coupled with her acting experience greatly helped her land her first big screen role as Eva Rodriguez, the talented and headstrong ballet dancer in the film Center Stage (2000). Since her professional career began several years ago, Zoe's talent and determination have allowed her to be involved in blockbuster films and act with major actors, actresses and industry insiders at a pace that very few young professionals have experienced.\n\nZoe has not only held her own in major motion picture productions but gained the respect and praise from industry insiders such as Jerry Bruckheimer and Steven Spielberg and actors/actresses such as Tom Hanks, Bernie Mac, Keira Knightley, Ashton Kutcher, Kirsten Dunst and Orlando Bloom. According to many of her co-stars, producers and directors, the sky is no limit for this young star who has incredible range, intense concentration, and a steely determination to be involved with projects that challenge her professionally with wide-ranging subject matters and characters. Just to ask practically anyone who she has worked for or with about her, glowing comments abound and earned friendships and respect are readily revealed. A star has been born, and growing every day."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2913280/", "image": {"height": 403, "id": "/name/nm2913280/images/rm2691339265", "url": "https://m.media-amazon.com/images/M/MV5BNWQ4NTYzYjQtYzBhNC00YmM0LTk1YTAtZWNkMmZkNzFkNmY0XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_.jpg", "width": 600}, "legacyNameText": "Cummings, Ashleigh", "name": "Ashleigh Cummings", "birthDate": "1992-11-11", "birthPlace": "Jeddah, Saudi Arabia", "gender": "female", "heightCentimeters": 162.6, "realName": "Ashleigh Lillian Cummings", "miniBios": [{"id": "/name/nm2913280/bio/bo421505145", "language": "en", "text": "Ashleigh Cummings was born on November 11, 1992 in Jeddah, Saudi Arabia. She is an actress, known for The Goldfinch (2019), Hounds of Love (2016) and NOS4A2 (2019)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm0000126/", "image": {"height": 2048, "id": "/name/nm0000126/images/rm3635252224", "url": "https://m.media-amazon.com/images/M/MV5BMTY1ODkwMTQxOF5BMl5BanBnXkFtZTcwNzkwNDcyMw@@._V1_.jpg", "width": 1365}, "legacyNameText": "Costner, Kevin", "name": "Kevin Costner", "birthDate": "1955-01-18", "birthPlace": "Lynwood, California, USA", "gender": "male", "heightCentimeters": 185.42, "realName": "Kevin Michael Costner", "spouses": [{"attributes": "(filed for divorce) (3 children)", "current": true, "fromDate": "2004-09-25", "id": "/name/nm1556270/", "name": "Christine Baumgartner"}, {"attributes": "(divorced) (3 children)", "fromDate": "1978-02-11", "id": "/name/nm0798262/", "name": "Cindy Costner", "toDate": "1994-12-12"}], "trademarks": ["Frequently appears in Westerns", "Frequently appears in sports-themed films, in particular baseball"], "miniBios": [{"author": "John Sacksteder <jsack@ka.net>", "id": "/name/nm0000126/bio/mb0007554", "language": "en", "text": "Kevin Michael Costner was born on January 18, 1955 in Lynwood, California, the third child of Bill Costner, a ditch digger and ultimately an electric line servicer for Southern California Edison, and Sharon Costner (née Tedrick), a welfare worker. His older brother, Dan, was born in 1950. A middle brother died at birth in 1953. His father's job required him to move regularly, which caused Kevin to feel like an Army kid, always the new kid at school, which led to him being a daydreamer. As a teen, he sang in the Baptist church choir, wrote poetry, and took writing classes. At 18, he built his own canoe and paddled his way down the rivers that Lewis & Clark followed to the Pacific. Despite his present height, he was only 5'2\" when he graduated high school. Nonetheless, he still managed to be a basketball, football and baseball star. In 1973, he enrolled at California State University at Fullerton, where he majored in business. During that period, Kevin decided to take acting lessons five nights a week. He graduated with a business degree in 1978 and married his college sweetheart, Cindy Costner. He initially took a marketing job in Orange County. Everything changed when he accidentally met Richard Burton on a flight from Mexico. Burton advised him to go completely after acting if that is what he wanted. He quit his job and moved to Hollywood soon after. He drove a truck, worked on a deep sea fishing boat, and gave bus tours to stars' homes before finally making his own way into the films. After making one soft core sex film, he vowed to not work again if that was the only work he could do. He didn't work for nearly six years, while he waited for a proper break. That break came with The Big Chill (1983), even though his scenes ended up on the cutting room floor -- he was remembered by director Lawrence Kasdan when he decided to make Silverado (1985). Costner's career took off after that."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm2780578/", "image": {"height": 1399, "id": "/name/nm2780578/images/rm3748221184", "url": "https://m.media-amazon.com/images/M/MV5BMTkzNjIwNzQ1NV5BMl5BanBnXkFtZTgwMDUwODk2NDM@._V1_.jpg", "width": 2048}, "legacyNameText": "Shahidi, Yara", "name": "Yara Shahidi", "birthDate": "2000-02-10", "birthPlace": "Minneapolis, Minnesota, USA", "gender": "female", "heightCentimeters": 167.64, "realName": "Yara Sayeh Shahidi", "miniBios": [{"id": "/name/nm2780578/bio/bo421195302", "language": "en", "text": "Yara Shahidi was born on February 10, 2000 in Minneapolis, Minnesota, USA. She is an actress and producer, known for Salt (2010), Black-ish (2014) and Grown-ish (2018)."}]}, {"@type": "imdb.api.name.bio", "disambiguation": "V", "id": "/name/nm0262635/", "image": {"height": 400, "id": "/name/nm0262635/images/rm1966443008", "url": "https://m.media-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1_.jpg", "width": 285}, "legacyNameText": "Evans, Chris (V)", "name": "Chris Evans", "birthDate": "1981-06-13", "birthPlace": "Boston, Massachusetts, USA", "gender": "male", "heightCentimeters": 182.88, "nicknames": ["Cevans"], "realName": "Christopher Robert Evans", "trademarks": ["Muscular physique"], "miniBios": [{"author": "Bryson Atud and Anastasia Andrew Veno", "id": "/name/nm0262635/bio/mb0010919", "language": "en", "text": "Christopher Robert Evans is an American actor, film producer, and director. Evans began his acting career in typical fashion: performing in school productions and community theatre.\n\nHe was born in Boston, Massachusetts, the son of Lisa (Capuano), who worked at the Concord Youth Theatre, and G. Robert Evans III, a dentist. His uncle is former U.S. Representative Mike Capuano. Chris's father is of half German and half Welsh/English/Scottish ancestry, while Chris's mother is of half Italian and half Irish descent. He has an older sister, Carly Evans, and two younger siblings, a brother named Scott Evans, who is also an actor, and a sister named Shana Evans. The family moved to suburban Sudbury when he was 11 years-old. Bitten by the acting bug in the first grade because his older sister, Carly, started performing, Evans followed suit and began appearing in school plays. While at Lincoln-Sudbury Regional High School, his drama teacher cited his performance as \"Leontes\" in \"The Winter's Tale\" as exemplary of his skill. After more plays and regional theatre, he moved to New York and attended the Lee Strasberg Theatre Institute.\n\nOn the advice of friends, he landed an internship at a casting office and befriended a couple of the agents he regularly communicated with - one of whom later took him on as a client. The screen - not the stage - then became his focus; Evans soon began auditioning for feature films and television series. Evans made one of his first appearances on The Fugitive (2000) (CBS, 2000-2001), a remake of the 1960s series and feature film starring Harrison Ford. In the episode \"Guilt\", Evans played the son of a small-town sheriff who tries to exact revenge after Dr. Richard Kimble - incognito as a liquor store owner - refuses to sell him and his friends alcohol. After small roles in Cherry Falls (2000) and The Newcomers (2000) - two unknown low-budget features - Evans appeared in Boston Public (2000) (Fox, 2000-2004) as a murder suspect. He then appeared in his first major feature, Not Another Teen Movie (2001), a spoof on teen comedies wherein he played a jock who makes a bet that he can turn an unpopular and unkempt girl (Chyler Leigh) into prom queen.\n\nAfter filming a couple of television pilots he was confident would be successful - Just Married (2003) and Eastwick (2002) - he appeared in another listless teen comedy, The Perfect Score (2004), playing an average, ho-hum student who takes part in a plot to steal the SAT test. Hijinks naturally ensue. Then, Evans broke through to the Big Time, grabbing the lead in the kidnapping thriller, Cellular (2004), a suspenseful B movie with a cheesy gimmick - a random wrong number on his cell phone forces him into a high-stakes race to save an unknown woman's life. Despite an unassuming performance from Evans and Kim Basinger as the damsel in distress, Cellular (2004) failed to break any box office records or please a wide majority of critics. Evans then prepared himself for super stardom when he signed on to play Johnny Storm in Fantastic Four (2005), 20th Century Fox's long-awaited adaptation of the Marvel comic. Although the film was wildly uneven and disappointing, Evans nearly stole the show with his energetic, unfettered performance. In that year itself, Chris was noticed by critics and made it into magazine and Internet countdowns, scoring himself a third position of the hot body countdown from Gay.com and #18 on E! Television's 2006 101 Sexiest Celebrity Bodies.\n\nThe year 2007 also proved to be one successful year for Chris, as he had two movies released around the world that same year, starting with the second installment of the Marvel franchise Fantastic Four. Chris received positive reviews for his performance. The Nanny Diaries (2007), where Evans played Harvard Hottie, showed his sensitive. The year 2008 saw Chris Evans' part of the movie Street Kings (2008), playing the character Detective Paul Diskant. The movie is about police officers trying to cover up their wrongdoings and audiences got to see a serious side of Chris. In the same year, Chris also worked on the movie The Loss of a Teardrop Diamond (2008)."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm3053338/", "image": {"height": 1332, "id": "/name/nm3053338/images/rm1008443648", "url": "https://m.media-amazon.com/images/M/MV5BMTgxNDcwMzU2Nl5BMl5BanBnXkFtZTcwNDc4NzkzOQ@@._V1_.jpg", "width": 1000}, "legacyNameText": "Robbie, Margot", "name": "Margot Robbie", "birthDate": "1990-07-02", "birthPlace": "Dalby, Queensland, Australia", "gender": "female", "heightCentimeters": 167.64, "realName": "Margot Elise Robbie", "spouses": [{"current": true, "fromDate": "2016-12-18", "id": "/name/nm3943537/", "name": "Tom Ackerley"}], "trademarks": ["Striking blue eyes"], "miniBios": [{"author": "Pedro Borges", "id": "/name/nm3053338/bio/mb0140717", "language": "en", "text": "Margot Elise Robbie was born on July 2, 1990 in Dalby, Queensland, Australia to Scottish parents. Her mother, Sarie Kessler, is a physiotherapist, and her father, is Doug Robbie. She comes from a family of four children, having two brothers and one sister. She graduated from Somerset College in Mudgeeraba, Queensland, Australia, a suburb in the Gold Coast hinterland of South East Queensland, where she and her siblings were raised by their mother and spent much of her time at the farm belonging to her grandparents. In her late teens, she moved to Melbourne, Victoria, Australia to pursue an acting career.\n\nFrom 2008-2010, Robbie played the character of Donna Freedman in the long-running Australian soap opera, Neighbours (1985), for which she was nominated for two Logie Awards. She set off to pursue Hollywood opportunities, quickly landing the role of Laura Cameron on the short-lived ABC series, Pan Am (2011). She made her big screen debut in the film, About Time (2013).\n\nRobbie rose to fame co-starring alongside Leonardo DiCaprio, portraying the role of Naomi Lapaglia in Martin Scorsese's Oscar nominated film, The Wolf of Wall Street (2013). She was nominated for a Breakthrough Performance MTV Movie Award, and numerous other awards.\n\nIn 2014, Robbie founded her own production company, LuckyChap Entertainment. She also appeared in the World War II romantic-drama film, Suite Française (2014). She starred in Focus (2015) and Z for Zachariah (2015), and made a cameo in The Big Short (2015).\n\nIn 2016, she married Tom Ackerley in Byron Bay, New South Wales, Australia.\n\nShe starred as Jane Porter in The Legend of Tarzan (2016), Tanya Vanderpoel in Whiskey Tango Foxtrot (2016) and as DC comics villain Harley Quinn in Suicide Squad (2016), for which she was nominated for a Teen Choice Award, and many other awards.\n\nShe portrayed figure skater Tonya Harding in the biographical film I, Tonya (2017), receiving critical acclaim and a Golden Globe Award nomination for Best Actress - Motion Picture Comedy or Musical."}]}, {"@type": "imdb.api.name.bio", "akas": ["Melanie Jayne Lynskey"], "disambiguation": "I", "id": "/name/nm0001491/", "image": {"height": 400, "id": "/name/nm0001491/images/rm210734080", "url": "https://m.media-amazon.com/images/M/MV5BMjIzNDg5NTg4Nl5BMl5BanBnXkFtZTcwMTU3NjgyMw@@._V1_.jpg", "width": 286}, "legacyNameText": "Lynskey, Melanie (I)", "name": "Melanie Lynskey", "birthDate": "1977-05-16", "birthPlace": "New Plymouth, New Zealand", "gender": "female", "heightCentimeters": 170.18, "nicknames": ["Mel"], "realName": "Melanie Jayne Lynskey", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2018", "id": "/name/nm0728762/", "name": "Jason Ritter"}, {"attributes": "(divorced)", "fromDate": "2007-04-14", "id": "/name/nm0801051/", "name": "Jimmi Simpson", "toDate": "2014-05-22"}], "miniBios": [{"author": "N.R.", "id": "/name/nm0001491/bio/mb0063774", "language": "en", "text": "At 16 years of age, Melanie Lynskey captivated filmgoers with an astonishing debut in Peter Jackson's revered psychological crime picture, Heavenly Creatures (1994). Her bold embodiment of the real-life Pauline Parker - a teenage outcast whose fierce bond with her only friend (a pre-stardom Kate Winslet) spiralled dangerously out of control - was heralded by TIME's Richard Corliss as \"perfect\", whilst earning the young New Zealander a Best Actress trophy in her motherland. Following a three-year hiatus spent studying at university and re-locating to Los Angeles, Lynskey made a welcome return to the silver screen when she was cast as Drew Barrymore's lovable stepsister in Andy Tennant's feminist fairy tale reworking, Ever After: A Cinderella Story (1998). Parts in Detroit Rock City (1999), But I'm a Cheerleader (1999), Coyote Ugly (2000), Snakeskin (2001), Abandon (2002), Sweet Home Alabama (2002), Shattered Glass (2003), and Clint Eastwood's Oscar-nominated war epic Flags of Our Fathers (2006) came next.\n\nIn the ensuing years, Lynskey emerged as one of the industry's most celebrated character actors, gaining plaudits for a succession of notable turns in prestige vehicles such as Sam Mendes's Away We Go (2009), Jason Reitman's Up in the Air (2009), Steven Soderbergh's The Informant! (2009), Tom McCarthy's Win Win (2011), Stephen Chbosky's The Perks of Being a Wallflower (2012), and Adam McKay's Don't Look Up (2021). Prolific supporting roles - opposite the calibre of George Clooney, Edward Norton, Matt Damon, and Leonardo DiCaprio - aside, headline appearances in Hello I Must Be Going (2012), Happy Christmas (2014), The Intervention (2016) - for which she received a Special Jury Prize at Sundance - and the genre-bending I Don't Feel at Home in This World Anymore (2017) have equally proved her mettle as a dynamite leading lady.\n\nOn television, Lynskey has worked her scene-stealing magic in an eclectic mixture of projects, such as the enormously successful Two and a Half Men (2003), where she appeared for twelve years as Charlie Sheen's duplicitous admirer, Rose; the acclaimed HBO dramedy Togetherness (2015), for which she nabbed a Critics' Choice nomination for her \"sublime\" (Vanity Fair) portrayal of a dissatisfied stay-at-home mother; the supernatural horror series Castle Rock (2018), where she headlined as troubled psychic Molly Strand; and the critically lauded miniseries Mrs. America (2020), in which she co-starred with Cate Blanchett. In 2022, Lynskey collected a coveted Critics' Choice Award (Best Actress in a Drama Series) for her mesmerising portrayal of Shauna - a suburban housewife harbouring grim secrets - on Showtime's furiously popular Yellowjackets (2021), with Alan Sepinwall of Rolling Stone describing her work as the \"dark, messy, charismatic part she's been waiting her whole career to play\"."}]}, {"@type": "imdb.api.name.bio", "akas": ["Josh Jackson"], "disambiguation": "I", "id": "/name/nm0005045/", "image": {"height": 512, "id": "/name/nm0005045/images/rm1226608640", "url": "https://m.media-amazon.com/images/M/MV5BMTkyMTkxMzAyNF5BMl5BanBnXkFyZXN1bWU@._V1_.jpg", "width": 341}, "legacyNameText": "Jackson, Joshua (I)", "name": "Joshua Jackson", "birthDate": "1978-06-11", "birthPlace": "Vancouver, British Columbia, Canada", "gender": "male", "heightCentimeters": 187.96, "nicknames": ["J.J.", "Josh"], "realName": "Joshua Browning Jackson Carter", "spouses": [{"attributes": "(1 child)", "current": true, "fromDate": "2019", "id": "/name/nm3853652/", "name": "Jodie Turner-Smith"}], "miniBios": [{"author": "Karen <cmoten@selu.edu>", "id": "/name/nm0005045/bio/mb0017481", "language": "en", "text": "Joshua Carter Jackson was born in Vancouver, British Columbia. His Irish mother, Fiona Jackson, is a casting director originally from Dublin. His American father, John Carter Jackson, is from Texas. Josh spent the first eight years of his life in California before returning to Canada. At the age of 11, Josh decided he wanted to pursue acting. Knowing how cruel an acting career could be, his mother took him to his first audition in hopes of discouraging him. Instead, he landed a commercial for Keebler's potato chips. Since then, Josh has had a full career ranging from theater to television."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm8567338/", "image": {"height": 1024, "id": "/name/nm8567338/images/rm2225872641", "url": "https://m.media-amazon.com/images/M/MV5BZTc1YmUzMTMtZjQyYS00ZTIwLWFiNTYtMWNmNDZmODhiMzUwXkEyXkFqcGdeQXVyNzEyNDIxMTI@._V1_.jpg", "width": 823}, "legacyNameText": "Calle, Sasha", "name": "Sasha Calle", "birthDate": "1995-08-07", "birthPlace": "Boston, Massachusetts, USA", "gender": "female", "heightCentimeters": 170.2, "miniBios": [{"id": "/name/nm8567338/bio/bo431238705", "language": "en", "text": "Sasha Calle was born on August 7, 1995 in Boston, Massachusetts, USA. She is an actress, known for The Flash (2023), Supergirl and On Swift Horses."}]}, {"@type": "imdb.api.name.bio", "akas": ["Annie Palicki"], "disambiguation": "I", "id": "/name/nm1597316/", "image": {"height": 2048, "id": "/name/nm1597316/images/rm3265700096", "url": "https://m.media-amazon.com/images/M/MV5BMTQ4MjM4OTA2OF5BMl5BanBnXkFtZTcwNDM3NzIzOQ@@._V1_.jpg", "width": 1361}, "legacyNameText": "Palicki, Adrianne (I)", "name": "Adrianne Palicki", "birthDate": "1983-05-06", "birthPlace": "Toledo, Ohio, USA", "gender": "female", "heightCentimeters": 180.34, "nicknames": ["Annie"], "realName": "Adrianne Lee Palicki", "spouses": [{"attributes": "(filed for divorce)", "current": true, "fromDate": "2019-05-19", "id": "/name/nm0342241/", "name": "Scott Grimes"}], "miniBios": [{"author": "km2266", "id": "/name/nm1597316/bio/mb0027185", "language": "en", "text": "Adrianne Palicki was born on May 6, 1983 in Toledo, Ohio, to Nancy (French) and Jeffrey Palicki. Her father is of Polish and Hungarian descent, and her mother is of English and German ancestry. Adrianne graduated from Whitmer High School. She did not take the stage in her first play until she was a sophomore at Whitmer High School. While in high school, she played basketball and ran track, and was runner-up for homecoming queen. She was a series regular on the first three seasons of NBC's drama series Friday Night Lights (2006). She has since starred of co-starred in the films Legion (2010), Red Dawn (2012) and G.I. Joe: Retaliation (2013)."}]}, {"@type": "imdb.api.name.bio", "akas": ["The Sneepers"], "disambiguation": "II", "id": "/name/nm0348181/", "image": {"height": 2048, "id": "/name/nm0348181/images/rm956936960", "url": "https://m.media-amazon.com/images/M/MV5BMTYxMDgzMjA5OV5BMl5BanBnXkFtZTcwMzMwMTUxNw@@._V1_.jpg", "width": 1530}, "legacyNameText": "Gunn, James (II)", "name": "James Gunn", "birthDate": "1966-08-05", "birthPlace": "St. Louis, Missouri, USA", "gender": "male", "heightCentimeters": 182.88, "realName": "James Francis Gunn Jr.", "spouses": [{"current": true, "fromDate": "2022-09-30", "id": "/name/nm1684744/", "name": "Jennifer Holland"}, {"attributes": "(divorced)", "fromDate": "2000-10-07", "id": "/name/nm0278979/", "name": "Jenna Fischer", "toDate": "2008"}], "trademarks": ["Heavy use of tongue-in-cheek dialogue.", "Unconventional characters", "Nearly always casts Nathan Fillion, Elizabeth Banks, Gregg Henry, Michael Rooker, Lloyd Kaufman, brother Sean Gunn and Rob Zombie in his movies. His dog Wesley Von Spears often get the roles as well", "His spiky hair", "His films almost always deal with preserving humanity and optimism, through hard circumstances and bizzare events unfolding", "Frequently works with ensemble casts.", "Usage of obscure references and characters", "Usage of licensed music that fits the plot and characters.", "Spontaneous dancing", "Elaborate color palettes"], "miniBios": [{"author": "Bill Sinewski/Robert Sieger", "id": "/name/nm0348181/bio/mb0014558", "language": "en", "text": "James Gunn was born and raised in St. Louis, Missouri, to Leota and James Francis Gunn. He is from a large Catholic family, with Irish and Czech ancestry. His father and his uncles were all lawyers. He has been writing and performing as long as he can remember. He began making 8mm films at the age of twelve. Many of these were comedic splatter films featuring his brothers being disemboweled by zombies. He attended Saint Louis University High (SLUH) college preparatory school but later dropped out of college to pursue a rock and roll career.\n\nHis band, \"the Icons\", released one album, \"Mom, We Like It Here on Earth\". He earned very little money doing this and so during this time, he also worked as an orderly in Tucson, Arizona, upon which many of the situations in his first novel, \"The Toy Collector\", are based. He wrote and drew comic strips for underground and college newspapers.\n\nGunn eventually returned to school and received his B.A. at Saint Louis University in his native St. Louis. He moved to New York where he received an MFA in creative writing from Columbia University, which he today thinks may have been a wonderfully expensive waste of time. While finishing his MFA, he started writing \"The Toy Collector\" and began working for \"Troma Studios\", America's leading B-Movie production company. While there he wrote and produced the cult classic Tromeo and Juliet (1996) and, with Lloyd Kaufman, he wrote \"All I Need to Know about Filmmaking I Learned from the Toxic Avenger\".\n\nGunn had a spiritual awakening in Cannes in 1997 and quit Troma and relocated from New York to Los Angeles. He wrote and acted in the film The Specials (2000) with Rob Lowe, Jamie Kennedy, Thomas J. Churchill and his brother Sean Gunn. He wrote two scripts for Warner Brothers live action movies: Spy vs. Spy (1985) and Scooby-Doo (2002). In 1999, after almost five years, he finished \"The Toy Collector\". After doing Scooby-Doo 2: Monsters Unleashed (2004), Gunn made his directorial debut with Slither (2006). He later made the superhero film Super (2010) and the successful Marvel films Guardians of the Galaxy (2014) and its sequel Guardians of the Galaxy Vol. 2 (2017)\n\nGunn has four brothers, all of whom are in the entertainment industry. His brother, Patrick Gunn, is a Senior VP at Artisan Entertainment, the company responsible for distributing (and the marketing campaign of) The Blair Witch Project (1999). His brother, Brian Gunn, is a screenwriter who works in partnership with their cousin Mark Gunn.\n\nGunn's brother, Matt Gunn wrote and starred in the winner of the 1997 Sundance Film Festival, Man About Town (1997). Gunn's brother, Sean Gunn, is an actor regularly seen in films, commercials, and such TV shows as Angel (1999). James and Sean have collaborated on two occasions Sean starred in Tromeo and Juliet (1996), and they acted together and co-produced The Specials (2000). The brothers have one sister, Beth, who is a lawyer.\n\nGunn married actress and cartoonist Jenna Fischer in 2000. They divorced in 2008. He is now in a relationship with Jennifer Holland"}]}, {"@type": "imdb.api.name.bio", "akas": ["Weatherman"], "id": "/name/nm0000093/", "image": {"height": 2048, "id": "/name/nm0000093/images/rm864335360", "url": "https://m.media-amazon.com/images/M/MV5BMjA1MjE2MTQ2MV5BMl5BanBnXkFtZTcwMjE5MDY0Nw@@._V1_.jpg", "width": 1363}, "legacyNameText": "Pitt, Brad", "name": "Brad Pitt", "birthDate": "1963-12-18", "birthPlace": "Shawnee, Oklahoma, USA", "gender": "male", "heightCentimeters": 180.34, "nicknames": ["Brad"], "realName": "William Bradley Pitt", "spouses": [{"attributes": "(divorced) (6 children)", "fromDate": "2014-08-23", "id": "/name/nm0001401/", "name": "Angelina Jolie", "toDate": "2019-04-13"}, {"attributes": "(divorced)", "fromDate": "2000-07-29", "id": "/name/nm0000098/", "name": "Jennifer Aniston", "toDate": "2005-10-02"}], "trademarks": ["Chiseled good looks", "Strong jawline and bold blue eyes", "Frequently works with David Fincher"], "miniBios": [{"author": "Anonymous and JJH", "id": "/name/nm0000093/bio/mb0174672", "language": "en", "text": "William Bradley \"Brad\" Pitt was born on December 18, 1963 in Shawnee, Oklahoma and raised in Springfield, Missouri to Jane Etta Pitt (née Hillhouse), a school counselor & William Alvin \"Bill\" Pitt, a truck company manager. At Kickapoo High School, Pitt was involved in sports, debating, student government and school musicals. Pitt attended the University of Missouri, where he majored in journalism with a focus on advertising. He occasionally acted in fraternity shows. He left college two credits short of graduating to move to California. Before he became successful at acting, Pitt supported himself by driving strippers in limos, moving refrigerators and dressing as a giant chicken while working for El Pollo Loco.\n\nPitt's earliest credited roles were in television, starting on the daytime soap opera Another World (1964) before appearing in the recurring role of Randy on the legendary prime time soap opera Dallas (1978). Following a string of guest appearances on various television series through the 1980s, Pitt gained widespread attention with a small part in Thelma & Louise (1991), in which he played a sexy criminal who romanced and conned Geena Davis. This led to starring roles in badly received films such as Johnny Suede (1991) & Cool World (1992).\n\nBut Pitt's career hit an upswing with his casting in A River Runs Through It (1992), which cemented his status as an multi-layered actor as opposed to just a pretty face. Pitt's subsequent projects were as quirky and varied in tone as his performances, ranging from his unforgettably comic cameo as stoner roommate Floyd in True Romance (1993) to romantic roles in such visually lavish films as Interview with the Vampire: The Vampire Chronicles (1994) and Legends of the Fall (1994), to an emotionally tortured detective in the horror-thriller Se7en (1995). His portrayal of frenetic oddball Jeffrey Goines in 12 Monkeys (1995) won him a Globe for Best Performance by an Actor in a Supporting Role.\n\nPitt's portrayal of Achilles in the big-budget period drama Troy (2004) helped establish his appeal as an action star and was closely followed by a co-starring role in the stylish spy-versus-spy flick Mr. & Mrs. Smith (2005). It was on the set of Mr. & Mrs. Smith that Pitt, who married Jennifer Aniston in a highly publicized ceremony in 2000, met Angelina Jolie. Pitt left Aniston for Jolie in 2005, a break-up that continues to fuel tabloid stories years after its occurrence.\n\nHe continues to wildly vary his film choices, appearing in everything from high-concept popcorn flicks such as Megamind (2010) to adventurous critic-bait like Inglourious Basterds (2009) and The Tree of Life (2011). He has received two Best Actor Oscar nominations, for The Curious Case of Benjamin Button (2008) and Moneyball (2011). In 2014, he starred in the war film Fury (2014), opposite Shia LaBeouf, Logan Lerman, Jon Bernthal, and Michael Peña.\n\nPitt and Jolie have 6 children, 3 adopted & 3 biological."}]}, {"@type": "imdb.api.name.bio", "id": "/name/nm8958770/", "image": {"height": 3428, "id": "/name/nm8958770/images/rm1014248705", "url": "https://m.media-amazon.com/images/M/MV5BODRiMjFjYzgtZWJhZS00NDgzLWFhMTUtM2UzZmRlNGI2MjZmXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg", "width": 2426}, "legacyNameText": "Mescal, Paul", "name": "Paul Mescal", "birthDate": "1996-02-02", "birthPlace": "Maynooth, County Kildare, Ireland", "gender": "male", "heightCentimeters": 180.34, "miniBios": [{"id": "/name/nm8958770/bio/bo431803450", "language": "en", "text": "Paul Mescal was born on February 2, 1996 in Maynooth, County Kildare, Ireland. He is an actor, known for Aftersun (2022), Normal People (2020) and The Lost Daughter (2021)."}]}]